create table students (
	student_id int primary key,
	first_name text,
	last_name text,
	gender text
);

create table faculty (
	faculty_id int primary key,
	faculty_name text
);
create table staff (
	staff_id int primary key,
	faculty_id int references faculty(faculty_id),
	first_name text,
	last_name text,
	role text,
	research text
);
create table departments (
	department_id int primary key,
	department_name text,
	faculty_id int references faculty(faculty_id)
);
create table courses (
	course_id int primary key,
	course_name text,
	department_id int references departments(department_id),
	credits int,
	pre_course int
);

create table transcripts (
	grade numeric(10,2),
	student_id int references students(student_id),
	course_id int references courses(course_id)
);
create table housing (
	housing_id int primary key,
	capacity int,
	housing_name text
);
create table student_groups (
	group_id int primary key,
	group_name text
);
create table student_contacts (
	student_id int references students(student_id),
	contact_details text,
	housing_id int references housing(housing_id)
);
create table instructors (
	instructor_id int primary key,
	staff_id int references staff(staff_id),
	course_id int references courses(course_id)
);
create table advisors (
	advisor_id int primary key,
	staff_id int references staff(staff_id),
	department_id int references departments(department_id)
);
create table degree_progress (
	credits_required int,
	student_id int references students(student_id)
);
create table meal_plans (
	plan_id int primary key,
	foods text,
	cost int,
	student_id int references students(student_id)
);
create table student_fees (
	fee_id int primary key,
	student_id int references students(student_id),
	amount int,
	status boolean
);
create table library (
	recourse_id int primary key,
	title text,
	checkout_date date,
	due_date date
);
create table health_services (
	service_id int primary key,
	student_id int references students(student_id),
	visit_date date,
	duration int
);
create table student_achievements (
	achievement_id int primary key,
	student_id int references students(student_id),
	achievements text
	
);
create table internships (
	intership_id int primary key,
	student_id int references students(student_id),
	company text,
	start_date date,
	end_date date
);
create table study_abroad (
	program_id int primary key,
	student_id int references students(student_id),
	county text,
	start_date date,
	end_date date
);
create table student_events (
	event_id int primary key,
	event_name text,
	event_date date,
	location text
);
create table graduations (
	graduation_id int primary key,
	student_id int,
	graduation_date date
);
create table admissions (
	admission_id int primary key,
	student_id int references students(student_id),
	admission_date date,
	advisor_id int references advisors(advisor_id)
);
create table alumni (
	alumni_id int primary key,
	first_name text,
	last_name text,
	graduation_year date,
	current_position text,
	department_id int references departments(department_id)
);
create table enrollments(
	enrollment_id int primary key,
	student_id int references students(student_id),
	instructor_id int references instructors(instructor_id),
	group_id int references student_groups(group_id),
	enrollment_date date
);
--сделано
INSERT INTO students (student_id, first_name, last_name, gender) VALUES
(1, 'Том', 'Хэнкс', 'мужской'),
(2, 'Мэрил', 'Стрип', 'женский'),
(3, 'Леонардо', 'ДиКаприо', 'мужской'),
(4, 'Джулия', 'Робертс', 'женский'),
(5, 'Брэд', 'Питт', 'мужской'),
(6, 'Анджелина', 'Джоли', 'женский'),
(7, 'Джонни', 'Депп', 'мужской'),
(8, 'Сандра', 'Буллок', 'женский'),
(9, 'Уилл', 'Смит', 'мужской'),
(10, 'Дженнифер', 'Лоуренс', 'женский'),
(11, 'Дензел', 'Вашингтон', 'мужской'),
(12, 'Скарлетт', 'Йоханссон', 'женский'),
(13, 'Мэтт', 'Дэймон', 'мужской'),
(14, 'Энн', 'Хэтэуэй', 'женский'),
(15, 'Морган', 'Фриман', 'мужской'),
(16, 'Шарлиз', 'Терон', 'женский'),
(17, 'Сэмюэл', 'Джексон', 'мужской'),
(18, 'Николь', 'Кидман', 'женский'),
(19, 'Джордж', 'Клуни', 'мужской'),
(20, 'Кейт', 'Бланшетт', 'женский'),
(21, 'Роберт', 'Дауни-мл.', 'мужской'),
(22, 'Натали', 'Портман', 'женский'),
(23, 'Хью', 'Джекман', 'мужской'),
(24, 'Риз', 'Уизерспун', 'женский'),
(25, 'Крис', 'Хемсворт', 'мужской'),
(26, 'Эмма', 'Стоун', 'женский'),
(27, 'Райан', 'Рейнольдс', 'мужской'),
(28, 'Анна', 'Кендрик', 'женский'),
(29, 'Крис', 'Эванс', 'мужской'),
(30, 'Эмили', 'Блант', 'женский'),
(31, 'Карлос', 'Эрнандес', 'мужской'),
(32, 'Мария', 'Гарсия', 'женский'),
(33, 'Хуан', 'Мартинес', 'мужской'),
(34, 'Луиса', 'Фернандес', 'женский'),
(35, 'Педро', 'Лопес', 'мужской'),
(36, 'София', 'Ортис', 'женский'),
(37, 'Рафаэль', 'Рамирес', 'мужской'),
(38, 'Елена', 'Круз', 'женский'),
(39, 'Антонио', 'Наварро', 'мужской'),
(40, 'Исабель', 'Морено', 'женский'),
(41, 'Хорхе', 'Герреро', 'мужской'),
(42, 'Роса', 'Рейес', 'женский'),
(43, 'Мигель', 'Агилар', 'мужской'),
(44, 'Кармен', 'Руис', 'женский'),
(45, 'Фернандо', 'Алонсо', 'мужской'),
(46, 'Лаура', 'Гомес', 'женский'),
(47, 'Диего', 'Варгас', 'мужской'),
(48, 'Ана', 'Медина', 'женский'),
(49, 'Густаво', 'Ортега', 'мужской'),
(50, 'Патрисия', 'Кастильо', 'женский'),
(51, 'Эдуардо', 'Перес', 'мужской'),
(52, 'Тереса', 'Флорес', 'женский'),
(53, 'Оскар', 'Диас', 'мужской'),
(54, 'Беатрис', 'Гильен', 'женский'),
(55, 'Армандо', 'Хименес', 'мужской'),
(56, 'Вероника', 'Мендоса', 'женский'),
(57, 'Альберто', 'Дельгадо', 'мужской'),
(58, 'Сесилия', 'Марти', 'женский'),
(59, 'Энрике', 'Кастильо', 'мужской'),
(60, 'Лидия', 'Бенитес', 'женский'),
(61, 'Роберто', 'Монтеро', 'мужской'),
(62, 'Клара', 'Фернандо', 'женский'),
(63, 'Адриан', 'Вега', 'мужской'),
(64, 'Марта', 'Ромеро', 'женский'),
(65, 'Хулио', 'Салазар', 'мужской'),
(66, 'Габриела', 'Санчо', 'женский'),
(67, 'Серхио', 'Мендес', 'мужской'),
(68, 'Алехандра', 'Васкес', 'женский'),
(69, 'Рикардо', 'Санчес', 'мужской'),
(70, 'Сандра', 'Буллок', 'женский'),
(71, 'Джимон', 'Хонсу', 'мужской'),
(72, 'Лупита', 'Нионго', 'женский'),
(73, 'Чиветель', 'Эджиофор', 'мужской'),
(74, 'Тандиве', 'Ньютон', 'женский'),
(75, 'Идрис', 'Эльба', 'мужской'),
(76, 'Дэвид', 'Ойелоуо', 'мужской'),
(77, 'Акон', '', 'мужской'),
(78, 'Шарлто', 'Копли', 'мужской'),
(79, 'Джон', 'Бойега', 'мужской'),
(80, 'Даниэль', 'Калуя', 'мужской'),
(81, 'Хэл', 'Берри', 'женский'),
(82, 'Омар', 'Си', 'мужской'),
(83, 'Софи', 'Оконедо', 'женский'),
(84, 'Терри', 'Фарелл', 'женский'),
(85, 'Мехрешт', 'Кемп', 'женский'),
(86, 'Кофи', 'Сирибоэ', 'мужской'),
(87, 'Джина', 'Торрес', 'женский'),
(88, 'Майкл', 'К. Уильямс', 'мужской'),
(89, 'Тайрон', 'Бенсон', 'мужской'),
(90, 'Джина', 'Паркер', 'женский'),
(91, 'Мишель', 'Ван Дер Ватер', 'женский'),
(92, 'Адевале', 'Акинойе-Агбаже', 'мужской'),
(93, 'Хаким', 'Кае-Казим', 'мужской'),
(94, 'Ричард', 'Мофе-Дамиджо', 'мужской'),
(95, 'Нонсо', 'Анозие', 'мужской'),
(96, 'Тони', 'Кгороге', 'мужской'),
(97, 'Керри', 'Вашингтон', 'женский'),
(98, 'Сэмюэл', 'Эль Джексон', 'мужской'),
(99, 'Форест', 'Уитакер', 'мужской'),
(100, 'Вупи', 'Голдберг', 'женский'),
(101, 'Шахрукх', 'Кхан', 'мужской'),
(102, 'Айшвария', 'Рай', 'женский'),
(103, 'Амитабх', 'Баччан', 'мужской'),
(104, 'Дипика', 'Падукон', 'женский'),
(105, 'Салман', 'Кхан', 'мужской'),
(106, 'Приянка', 'Чопра', 'женский'),
(107, 'Акшай', 'Кумар', 'мужской'),
(108, 'Карина', 'Капур', 'женский'),
(109, 'Хритик', 'Рошан', 'мужской'),
(110, 'Каджол', '', 'женский'),
(111, 'Ранбир', 'Капур', 'мужской'),
(112, 'Алиа', 'Бхатт', 'женский'),
(113, 'Анушка', 'Шарма', 'женский'),
(114, 'Рани', 'Мукерджи', 'женский'),
(115, 'Аджай', 'Девган', 'мужской'),
(116, 'Сонам', 'Капур', 'женский'),
(117, 'Али', 'Кхан', 'мужской'),
(118, 'Шридеви', '', 'женский'),
(119, 'Раджникант', '', 'мужской'),
(120, 'Видья', 'Балан', 'женский'),
(121, 'Санни', 'Деол', 'мужской'),
(122, 'Табу', '', 'женский'),
(123, 'Мадхури', 'Диксит', 'женский'),
(124, 'Анупам', 'Кхер', 'мужской'),
(125, 'Кангана', 'Ранаут', 'женский'),
(126, 'Жерар', 'Депардье', 'мужской'),
(127, 'Марион', 'Котийяр', 'женский'),
(128, 'Жан', 'Дюжарден', 'мужской'),
(129, 'Одри', 'Тоту', 'женский'),
(130, 'Венсан', 'Кассель', 'мужской'),
(131, 'Леа', 'Сейду', 'женский'),
(132, 'Даниэль', 'Отой', 'мужской'),
(133, 'Жюльетт', 'Бинош', 'женский'),
(134, 'Гийом', 'Кане', 'мужской'),
(135, 'Изабель', 'Юппер', 'женский'),
(136, 'Матье', 'Амальрик', 'мужской'),
(137, 'Фанни', 'Ардан', 'женский'),
(138, 'Жан-Поль', 'Бельмондо', 'мужской'),
(139, 'Катрин', 'Денёв', 'женский'),
(140, 'Луи', 'Де Фюнес', 'мужской'),
(141, 'Софи', 'Марсо', 'женский'),
(142, 'Ален', 'Делон', 'мужской'),
(143, 'Брижит', 'Бардо', 'женский'),
(144, 'Ромен', 'Дюрис', 'мужской'),
(145, 'Эмманюэль', 'Беар', 'женский'),
(146, 'Тахар', 'Рахим', 'мужской'),
(147, 'Мелани', 'Лоран', 'женский'),
(148, 'Жан', 'Рено', 'мужской'),
(149, 'Милен', 'Фармер', 'женский'),
(150, 'Ксавье', 'Долан', 'мужской'),
(151, 'Даниэль', 'Брюль', 'мужской'),
(152, 'Франка', 'Потенте', 'женский'),
(153, 'Тиль', 'Швайгер', 'мужской'),
(154, 'Диана', 'Крюгер', 'женский'),
(155, 'Мориц', 'Бляйбтрой', 'мужской'),
(156, 'Нина', 'Хосс', 'женский'),
(157, 'Себастьян', 'Кох', 'мужской'),
(158, 'Сандра', 'Хюллер', 'женский'),
(159, 'Юрген', 'Прохнов', 'мужской'),
(160, 'Катя', 'Риман', 'женский'),
(161, 'Хайнер', 'Лаутербах', 'мужской'),
(162, 'Ханна', 'Херцшпрунг', 'женский'),
(163, 'Ульрих', 'Тукур', 'мужской'),
(164, 'Нина', 'Кунцендорф', 'женский'),
(165, 'Август', 'Диль', 'мужской'),
(166, 'Каролина', 'Херфурт', 'женский'),
(167, 'Элиас', 'Мбарек', 'мужской'),
(168, 'Жюли', 'Энгельбрехт', 'женский'),
(169, 'Армин', 'Мюллер-Шталь', 'мужской'),
(170, 'Сибиль', 'Раух', 'женский'),
(171, 'Моника', 'Беллуччи', 'женский'),
(172, 'Роберто', 'Бениньи', 'мужской'),
(173, 'София', 'Лорен', 'женский'),
(174, 'Марчелло', 'Мастроянни', 'мужской'),
(175, 'Изабелла', 'Росселлини', 'женский'),
(176, 'Джанкарло', 'Джаннини', 'мужской'),
(177, 'Валерия', 'Голино', 'женский'),
(178, 'Лука', 'Зингаретти', 'мужской'),
(179, 'Клаудия', 'Кардинале', 'женский'),
(180, 'Нино', 'Манфреди', 'мужской'),
(181, 'Стефания', 'Сандорелли', 'женский'),
(182, 'Витторио', 'Гассман', 'мужской'),
(183, 'Анита', 'Экберг', 'женский'),
(184, 'Уго', 'Тоньятци', 'мужской'),
(185, 'Пьерфранческо', 'Фавино', 'мужской'),
(186, 'Маргерита', 'Буй', 'женский'),
(187, 'Риккардо', 'Скамарчо', 'мужской'),
(188, 'Алессандро', 'Гассман', 'мужской'),
(189, 'Федерика', 'Феллини', 'женский'),
(190, 'Эннио', 'Фантастичини', 'мужской'),
(191, 'Ерболат', 'Тогузаков', 'мужской'),
(192, 'Берик', 'Айтжанов', 'мужской'),
(193, 'Асанали', 'Ашимов', 'мужской'),
(194, 'Алтынай', 'Ногербек', 'женский'),
(195, 'Тунгышбай', 'Жаманкулов', 'мужской'),
(196, 'Айнур', 'Ниязова', 'женский'),
(197, 'Нурлан', 'Алимжанов', 'мужской'),
(198, 'Айдана', 'Меденова', 'женский'),
(199, 'Куаныш', 'Байсакалов', 'мужской'),
(200, 'Мадина', 'Садуакасова', 'женский'),
(201, 'Аскар', 'Илясов', 'мужской'),
(202, 'Гульназ', 'Жоланова', 'женский'),
(203, 'Досхан', 'Жолжахсынов', 'мужской'),
(204, 'Салтанат', 'Бакаева', 'женский'),
(205, 'Бахытжан', 'Алпейсов', 'мужской'),
(206, 'Жанель', 'Маказханова', 'женский'),
(207, 'Талгат', 'Асемкулов', 'мужской'),
(208, 'Лаура', 'Королева', 'женский'),
(209, 'Азамат', 'Сатыбалды', 'мужской'),
(210, 'Меруерт', 'Утебаева', 'женский'),
(211, 'Дэниел', 'Рэдклифф', 'мужской'),
(212, 'Кейт', 'Бланшетт', 'женский'),
(213, 'Хью', 'Грант', 'мужской'),
(214, 'Джуди', 'Денч', 'женский'),
(215, 'Колин', 'Фёрт', 'мужской'),
(216, 'Хелен', 'Миррен', 'женский'),
(217, 'Иэн', 'Маккеллен', 'мужской'),
(218, 'Кейра', 'Найтли', 'женский'),
(219, 'Эдди', 'Редмэйн', 'мужской'),
(220, 'Эмили', 'Блант', 'женский'),
(221, 'Бенедикт', 'Камбербэтч', 'мужской'),
(222, 'Рейчел', 'Вайс', 'женский'),
(223, 'Орландо', 'Блум', 'мужской'),
(224, 'Кейт', 'Уинслет', 'женский'),
(225, 'Кристиан', 'Бэйл', 'мужской'),
(226, 'Тильда', 'Суинтон', 'женский'),
(227, 'Чарли', 'Ханнэм', 'мужской'),
(228, 'Сирша', 'Ронан', 'женский'),
(229, 'Том', 'Хиддлстон', 'мужской'),
(230, 'Кэри', 'Маллиган', 'женский'),
(231, 'Хенри', 'Кавилл', 'мужской'),
(232, 'Розамунд', 'Пайк', 'женский'),
(233, 'Мартин', 'Фриман', 'мужской'),
(234, 'Емилия', 'Кларк', 'женский'),
(235, 'Дэниэл', 'Крэйг', 'мужской'),
(236, 'Фелисити', 'Джонс', 'женский'),
(237, 'Том', 'Харди', 'мужской'),
(238, 'Саманта', 'Мортон', 'женский'),
(239, 'Рэйф', 'Файнс', 'мужской'),
(240, 'Лили', 'Коллинз', 'женский'),
(241, 'Эндрю', 'Гарфилд', 'мужской'),
(242, 'Наоми', 'Уоттс', 'женский'),
(243, 'Мэттью', 'Гуд', 'мужской'),
(244, 'Ребекка', 'Холл', 'женский'),
(245, 'Саймон', 'Пегг', 'мужской'),
(246, 'Гемма', 'Артертон', 'женский'),
(247, 'Дэвид', 'Теннант', 'мужской'),
(248, 'Клер', 'Фой', 'женский'),
(249, 'Роберт', 'Паттинсон', 'мужской'),
(250, 'Сирша', 'Ронан', 'женский');
--сделано
INSERT INTO faculty (faculty_id, faculty_name) VALUES
(1, 'Факультет Прикладной Математики'),
(2, 'Факультет Иностранных Языков'),
(3, 'Факультет Физики'),
(4, 'Факультет Химии'),
(5, 'Факультет Биологии'),
(6, 'Факультет Информатики'),
(7, 'Факультет Истории'),
(8, 'Факультет Философии'),
(9, 'Факультет Экономики'),
(10, 'Факультет Журналистики');
--сделано
INSERT INTO staff (staff_id, faculty_id, first_name, last_name, role, research) VALUES
(1, 1, 'Криштиану', 'Роналду', 'Преподаватель', NULL),
(2, 2, 'Лионель', 'Месси', 'Преподаватель', NULL),
(3, 3, 'Роберт', 'Левандовски', 'Преподаватель', NULL),
(4, 4, 'Килиан', 'Мбаппе', 'Преподаватель', NULL),
(5, 5, 'Неймар', '', 'Преподаватель', NULL),
(6, 6, 'Златан', 'Ибрагимович', 'Преподаватель', NULL),
(7, 7, 'Гарет', 'Бэйл', 'Преподаватель', NULL),
(8, 8, 'Серхио', 'Рамос', 'Преподаватель', NULL),
(9, 9, 'Вирджил', 'ван Дейк', 'Преподаватель', NULL),
(10, 10, 'Френки', 'де Йонг', 'Преподаватель', NULL),
(11, 1, 'Лука', 'Модрич', 'Преподаватель', NULL),
(12, 2, 'Мохамед', 'Салах', 'Преподаватель', NULL),
(13, 3, 'Кевин', 'де Брюйне', 'Преподаватель', NULL),
(14, 4, 'Эден', 'Азар', 'Преподаватель', NULL),
(15, 5, 'Антуан', 'Гризманн', 'Преподаватель', NULL),
(16, 6, 'Леброн', 'Джеймс', 'Докторант', 'Исследование в баскетболе'),
(17, 7, 'Кевин', 'Дюрант', 'Докторант', 'Стратегии игры в баскетболе'),
(18, 8, 'Майкл', 'Джордан', 'Докторант', 'История баскетбола'),
(19, 9, 'Шакил', 'О’Нил', 'Докторант', 'Техники обороны в баскетболе'),
(20, 10, 'Карим', 'Абдул-Джаббар', 'Докторант', 'Эволюция баскетбольных техник'),
(21, 1, 'Коби', 'Брайант', 'Докторант', 'Психология спортивных достижений'),
(22, 2, 'Стефен', 'Карри', 'Докторант', 'Технологии в баскетболе'),
(23, 3, 'Яннис', 'Адетокунбо', 'Докторант', 'Маркетинг в спорте'),
(24, 4, 'Дирк', 'Новицки', 'Докторант', 'Инновации в спортивном тренинге'),
(25, 5, 'Тим', 'Дункан', 'Докторант', 'История баскетбольных чемпионатов'),
(26, 6, 'Чарльз', 'Баркли', 'Докторант', 'Стратегии командного взаимодействия'),
(27, 7, 'Аллен', 'Айверсон', 'Докторант', 'Техники ведения мяча'),
(28, 8, 'Карл', 'Мэлоун', 'Докторант', 'Физическая подготовка в баскетболе'),
(29, 9, 'Дэвид', 'Робинсон', 'Докторант', 'История развития баскетбола'),
(30, 10, 'Джон', 'Стоктон', 'Докторант', 'Тактика игры на защите'),
(31, 1, 'Филипп', 'Киркоров', 'Охранник', NULL),
(32, 2, 'Алла', 'Пугачева', 'Охранник', NULL),
(33, 3, 'Сергей', 'Лазарев', 'Охранник', NULL),
(34, 4, 'Дима', 'Билан', 'Охранник', NULL),
(35, 5, 'Полина', 'Гагарина', 'Охранник', NULL),
(36, 1, 'Александр', 'Кокорин', 'Уборщик', NULL),
(37, 2, 'Артем', 'Дзюба', 'Уборщик', NULL),
(38, 3, 'Игорь', 'Акинфеев', 'Уборщик', NULL),
(39, 4, 'Юрий', 'Жирков', 'Уборщик', NULL),
(40, 5, 'Алан', 'Дзагоев', 'Уборщик', NULL);
--сделано
INSERT INTO departments (department_id, department_name, faculty_id) VALUES
	(1, 'Теоретическая Математика', 1),
	(2, 'Прикладная Информатика', 1),
	(3, 'Лингвистика', 2),
	(4, 'Перевод и Интерпретация', 2),
	(5, 'Теоретическая Физика', 3),
	(6, 'Экспериментальная Физика', 3),
	(7, 'Органическая Химия', 4),
	(8, 'Неорганическая Химия', 4),
	(9, 'Молекулярная Биология', 5),
	(10, 'Экология и Эволюция', 5),
	(11, 'Программирование', 6),
	(12, 'Системный Анализ', 6),
	(13, 'История России', 7),
	(14, 'Всемирная История', 7),
	(15, 'Социальная Философия', 8),
	(16, 'Этика', 8),
	(17, 'Макроэкономика', 9),
	(18, 'Микроэкономика', 9),
	(19, 'Тележурналистика', 10),
	(20, 'Пресса', 10);
--сделано
INSERT INTO courses (course_id, course_name, department_id, credits,pre_course) VALUES
(1, 'Основы теоретической математики', 1, 5,null),
(2, 'Основы прикладной информатики', 2, 5,1),
(3, 'Введение в лингвистику', 3, 5,null),
(4, 'Основы перевода и интерпретации', 4, 5,3),
(5, 'Основы теоретической физики', 5, 5,null),
(6, 'Лабораторный курс экспериментальной физики', 6, 5,5),
(7, 'Основы органической химии', 7, 5,null),
(8, 'Основы неорганической химии', 8, 5,7),
(9, 'Основы молекулярной биологии', 9, 5,null),
(10, 'Экология и эволюционная биология', 10, 5,9),
(11, 'Основы программирования', 11, 5,null),
(12, 'Введение в системный анализ', 12, 5,11),
(13, 'История России: обзор', 13, 5,null),
(14, 'Основы всемирной истории', 14, 5,13),
(15, 'Введение в социальную философию', 15, 5,null),
(16, 'Основы этики', 16, 3,15),
(17, 'Основы макроэкономики', 17, 3,null),
(18, 'Основы микроэкономики', 18, 3,17),
(19, 'Основы тележурналистики', 19, 3,null),
(20, 'История и теория прессы', 20, 3,19),
(21, 'Продвинутый курс теоретической математики', 1, 3,null),
(22, 'Продвинутый курс прикладной информатики', 2, 3,21),
(23, 'Лингвистические исследования', 3, 3,null),
(24, 'Техники перевода и интерпретации', 4, 3,23),
(25, 'Специализированные темы теоретической физики', 5, 3,null),
(26, 'Основы теории информации', 1, 2,25),
(27, 'Компьютерные сети и коммуникации', 2, 2,null),
(28, 'Социолингвистика', 3, 2,27),
(29, 'Межкультурная коммуникация', 4, 2,null),
(30, 'Квантовая физика', 5, 2,29);
INSERT INTO transcripts (grade, student_id, course_id)
VALUES
(3.67, 1, 1),
(2.33, 2, 2),
(2.33, 3, 3),
(2.67, 4, 4),
(2.0, 5, 5),
(3.33, 6, 6),
(2.33, 7, 7),
(3.67, 8, 8),
(3.67, 9, 9),
(3.33, 10, 10),
(2.67, 11, 11),
(3.0, 12, 12),
(2.67, 13, 13),
(3.67, 14, 14),
(4.0, 15, 15),
(2.67, 16, 16),
(3.67, 17, 17),
(3.33, 18, 18),
(3.33, 19, 19),
(4.0, 20, 20),
(2.33, 21, 21),
(2.33, 22, 22),
(2.33, 23, 23),
(2.33, 24, 24),
(2.0, 25, 25),
(3.33, 26, 26),
(4.0, 27, 27),
(3.33, 28, 28),
(3.67, 29, 29),
(2.0, 30, 30),
(3.67, 31, 1),
(3.67, 32, 2),
(2.0, 33, 3),
(3.67, 34, 4),
(2.67, 35, 5),
(2.67, 36, 6),
(2.67, 37, 7),
(2.0, 38, 8),
(3.33, 39, 9),
(3.67, 40, 10),
(4.0, 41, 11),
(3.0, 42, 12),
(2.33, 43, 13),
(4.0, 44, 14),
(2.67, 45, 15),
(2.0, 46, 16),
(2.0, 47, 17),
(2.67, 48, 18),
(2.67, 49, 19),
(2.0, 50, 20),
(3.67, 51, 21),
(3.67, 52, 22),
(4.0, 53, 23),
(2.67, 54, 24),
(2.67, 55, 25),
(2.67, 56, 26),
(2.0, 57, 27),
(3.0, 58, 28),
(3.33, 59, 29),
(2.33, 60, 30),
(2.33, 61, 1),
(2.33, 62, 2),
(3.0, 63, 3),
(2.33, 64, 4),
(2.0, 65, 5),
(4.0, 66, 6),
(2.0, 67, 7),
(2.0, 68, 8),
(4.0, 69, 9),
(4.0, 70, 10),
(2.0, 71, 11),
(3.0, 72, 12),
(4.0, 73, 13),
(3.0, 74, 14),
(4.0, 75, 15),
(2.33, 76, 16),
(2.67, 77, 17),
(3.0, 78, 18),
(2.33, 79, 19),
(3.0, 80, 20),
(3.0, 81, 21),
(3.33, 82, 22),
(3.0, 83, 23),
(4.0, 84, 24),
(3.67, 85, 25),
(2.0, 86, 26),
(3.33, 87, 27),
(3.33, 88, 28),
(2.0, 89, 29),
(3.67, 90, 30),
(4.0, 91, 1),
(2.33, 92, 2),
(2.67, 93, 3),
(3.67, 94, 4),
(2.33, 95, 5),
(3.67, 96, 6),
(2.33, 97, 7),
(2.0, 98, 8),
(3.0, 99, 9),
(2.0, 100, 10),
(3.67, 101, 11),
(2.67, 102, 12),
(4.0, 103, 13),
(4.0, 104, 14),
(2.0, 105, 15),
(3.33, 106, 16),
(2.33, 107, 17),
(4.0, 108, 18),
(3.33, 109, 19),
(3.33, 110, 20),
(2.33, 111, 21),
(2.0, 112, 22),
(4.0, 113, 23),
(3.0, 114, 24),
(4.0, 115, 25),
(3.33, 116, 26),
(3.33, 117, 27),
(4.0, 118, 28),
(3.67, 119, 29),
(4.0, 120, 30),
(3.0, 121, 1),
(3.0, 122, 2),
(3.67, 123, 3),
(3.0, 124, 4),
(3.67, 125, 5),
(3.33, 126, 6),
(4.0, 127, 7),
(2.0, 128, 8),
(2.0, 129, 9),
(3.33, 130, 10),
(3.67, 131, 11),
(3.0, 132, 12),
(3.33, 133, 13),
(2.0, 134, 14),
(3.33, 135, 15),
(3.33, 136, 16),
(2.0, 137, 17),
(3.33, 138, 18),
(3.33, 139, 19),
(2.0, 140, 20),
(4.0, 141, 21),
(3.67, 142, 22),
(2.0, 143, 23),
(3.67, 144, 24),
(2.33, 145, 25),
(4.0, 146, 26),
(3.0, 147, 27),
(2.67, 148, 28),
(3.0, 149, 29),
(4.0, 150, 30),
(3.33, 151, 1),
(3.0, 152, 2),
(3.0, 153, 3),
(3.33, 154, 4),
(3.67, 155, 5),
(3.67, 156, 6),
(2.33, 157, 7),
(3.67, 158, 8),
(3.33, 159, 9),
(3.67, 160, 10),
(4.0, 161, 11),
(2.0, 162, 12),
(2.33, 163, 13),
(2.33, 164, 14),
(4.0, 165, 15),
(3.33, 166, 16),
(3.67, 167, 17),
(3.67, 168, 18),
(3.0, 169, 19),
(3.0, 170, 20),
(2.0, 171, 21),
(4.0, 172, 22),
(2.33, 173, 23),
(2.33, 174, 24),
(2.67, 175, 25),
(3.33, 176, 26),
(3.67, 177, 27),
(4.0, 178, 28),
(3.33, 179, 29),
(2.67, 180, 30),
(3.67, 181, 1),
(2.0, 182, 2),
(3.33, 183, 3),
(2.33, 184, 4),
(3.33, 185, 5),
(4.0, 186, 6),
(3.67, 187, 7),
(2.33, 188, 8),
(2.0, 189, 9),
(3.33, 190, 10),
(3.0, 191, 11),
(2.67, 192, 12),
(2.33, 193, 13),
(4.0, 194, 14),
(4.0, 195, 15),
(4.0, 196, 16),
(3.0, 197, 17),
(2.33, 198, 18),
(2.33, 199, 19),
(3.67, 200, 20),
(2.67, 201, 21),
(2.33, 202, 22),
(2.67, 203, 23),
(4.0, 204, 24),
(2.0, 205, 25),
(3.33, 206, 26),
(4.0, 207, 27),
(2.67, 208, 28),
(3.0, 209, 29),
(2.67, 210, 30);

INSERT INTO housing 
VALUES
(1, 350, 'sdu_house'),
(2, 300, 'kbtu_house'),
(3, 250, 'nu_house');
--сделано
INSERT INTO student_groups (group_id, group_name)
VALUES
(1, 'Молодые Лидеры'),
(2, 'Творческий Коллектив'),
(3, 'Научные Исследования'),
(4, 'Спортивная Энергия');
--сделано
INSERT INTO instructors (instructor_id, staff_id, course_id) VALUES
(1, 1, 1),
(2, 1, 2),
(3, 2, 1),
(4, 2, 3),
(5, 3, 4),
(6, 3, 5),
(7, 4, 7),
(8, 5, 8),
(9, 5, 9),
(10, 6, 10),
(11, 6, 1),
(12, 7, 2),
(13, 7, 3),
(14, 8, 4),
(15, 8, 5),
(16, 9, 6),
(17, 9, 7),
(18, 10, 8),
(19, 10, 9),
(20, 11, 10),
(21, 11, 11),
(22, 12, 12),
(23, 12, 13),
(24, 13, 14),
(25, 13, 15),
(26, 14, 16),
(27, 14, 17),
(28, 15, 18),
(29, 15, 19),
(30, 16, 20),
(31, 16, 21),
(32, 17, 22),
(33, 17, 23),
(34, 18, 24),
(35, 18, 25),
(36, 19, 26),
(37, 19, 27),
(38, 20, 28),
(39, 20, 29),
(40, 21, 30),
(41, 21, 1),
(42, 22, 2),
(43, 22, 3),
(44, 23, 4),
(45, 23, 5),
(46, 24, 6),
(47, 24, 7),
(48, 25, 8),
(49, 25, 9),
(50, 10, 15);
--сделано
INSERT INTO student_contacts (student_id, contact_details, housing_id)
VALUES
(1, '+780856', NULL),
(2, '+778253', 1),
(3, '+787760', 2),
(4, '+781583', NULL),
(5, '+789190', 2),
(6, '+779257', 3),
(7, '+787149', NULL),
(8, '+778329', 1),
(9, '+787612', 1),
(10, '+787425', NULL),
(11, '+780857', 1),
(12, '+788186', 2),
(13, '+788866', NULL),
(14, '+785583', 3),
(15, '+782990', 1),
(16, '+778719', NULL),
(17, '+783074', 2),
(18, '+781578', 2),
(19, '+785928', NULL),
(20, '+782780', 1),
(21, '+787754', 1),
(22, '+777112', NULL),
(23, '+786420', 3),
(24, '+778708', 2),
(25, '+780536', NULL),
(26, '+789306', 1),
(27, '+788858', 1),
(28, '+787126', NULL),
(29, '+784843', 3),
(30, '+783715', 2),
(31, '+789516', NULL),
(32, '+781617', 3),
(33, '+781232', 2),
(34, '+784889', NULL),
(35, '+777540', 2),
(36, '+780185', 2),
(37, '+781851', NULL),
(38, '+779394', 3),
(39, '+777889', 1),
(40, '+789222', NULL),
(41, '+786113', 3),
(42, '+781880', 2),
(43, '+788146', NULL),
(44, '+778004', 1),
(45, '+778988', 1),
(46, '+789885', NULL),
(47, '+781672', 1),
(48, '+778645', 3),
(49, '+779526', NULL),
(50, '+779799', 1),
(51, '+781032', 3),
(52, '+788424', NULL),
(53, '+779092', 3),
(54, '+788940', 1),
(55, '+785527', NULL),
(56, '+779165', 1),
(57, '+789516', 1),
(58, '+783023', NULL),
(59, '+785883', 2),
(60, '+778335', 2),
(61, '+786295', NULL),
(62, '+782857', 1),
(63, '+788240', 3),
(64, '+780784', NULL),
(65, '+780471', 2),
(66, '+786784', 3),
(67, '+784784', NULL),
(68, '+778327', 3),
(69, '+778329', 2),
(70, '+778306', NULL),
(71, '+777377', 1),
(72, '+779261', 1),
(73, '+788636', NULL),
(74, '+780018', 1),
(75, '+778355', 2),
(76, '+777259', NULL),
(77, '+778672', 2),
(78, '+784410', 2),
(79, '+778511', NULL),
(80, '+784685', 3),
(81, '+784224', 3),
(82, '+787695', NULL),
(83, '+778240', 1),
(84, '+782793', 3),
(85, '+786999', NULL),
(86, '+789544', 2),
(87, '+778045', 2),
(88, '+778144', NULL),
(89, '+784702', 1),
(90, '+783647', 3),
(91, '+786005', NULL),
(92, '+779428', 2),
(93, '+780892', 3),
(94, '+786085', NULL),
(95, '+781489', 3),
(96, '+786472', 2),
(97, '+789116', NULL),
(98, '+788065', 1),
(99, '+782156', 1),
(100, '+783563', NULL),
(101, '+783546', 2),
(102, '+777410', 2),
(103, '+781822', NULL),
(104, '+779124', 2),
(105, '+777541', 2),
(106, '+783400', NULL),
(107, '+782460', 1),
(108, '+786630', 3),
(109, '+781126', NULL),
(110, '+786790', 3),
(111, '+784457', 2),
(112, '+788917', NULL),
(113, '+788527', 3),
(114, '+778746', 1),
(115, '+787969', NULL),
(116, '+786799', 3),
(117, '+784469', 2),
(118, '+782603', NULL),
(119, '+782688', 2),
(120, '+778340', 3),
(121, '+789166', NULL),
(122, '+780298', 2),
(123, '+786998', 1),
(124, '+787030', NULL),
(125, '+788539', 1),
(126, '+778409', 3),
(127, '+788869', NULL),
(128, '+787393', 3),
(129, '+787159', 3),
(130, '+783766', NULL),
(131, '+784697', 1),
(132, '+779683', 1),
(133, '+777157', NULL),
(134, '+782144', 2),
(135, '+788246', 2),
(136, '+785557', NULL),
(137, '+789301', 3),
(138, '+779352', 3),
(139, '+784046', NULL),
(140, '+788735', 3),
(141, '+788647', 2),
(142, '+788290', NULL),
(143, '+789896', 1),
(144, '+786255', 2),
(145, '+781157', NULL),
(146, '+789985', 3),
(147, '+786617', 2),
(148, '+784818', NULL),
(149, '+780749', 2),
(150, '+785949', 2),
(151, '+788054', NULL),
(152, '+780649', 1),
(153, '+787693', 1),
(154, '+787464', NULL),
(155, '+780775', 2),
(156, '+785574', 1),
(157, '+777493', NULL),
(158, '+782660', 3),
(159, '+778766', 1),
(160, '+782947', NULL),
(161, '+785592', 2),
(162, '+787670', 2),
(163, '+777525', NULL),
(164, '+785241', 2),
(165, '+777322', 1),
(166, '+784726', NULL),
(167, '+788419', 3),
(168, '+786838', 1),
(169, '+789370', NULL),
(170, '+781372', 1),
(171, '+782087', 2),
(172, '+789957', NULL),
(173, '+780705', 1),
(174, '+782924', 2),
(175, '+785763', NULL),
(176, '+789058', 3),
(177, '+778314', 2),
(178, '+777354', NULL),
(179, '+778602', 1),
(180, '+786243', 2),
(181, '+780215', NULL),
(182, '+784182', 1),
(183, '+789241', 3),
(184, '+780799', NULL),
(185, '+777569', 2),
(186, '+782449', 3),
(187, '+787977', NULL),
(188, '+781066', 3),
(189, '+787552', 3),
(190, '+784366', NULL),
(191, '+784787', 3),
(192, '+778111', 2),
(193, '+788039', NULL),
(194, '+777129', 2),
(195, '+789978', 3),
(196, '+785500', NULL),
(197, '+784385', 1),
(198, '+784795', 2),
(199, '+787028', NULL),
(200, '+781281', 3),
(201, '+780606', 3),
(202, '+789083', NULL),
(203, '+783705', 2),
(204, '+781192', 1),
(205, '+786878', NULL),
(206, '+777254', 2),
(207, '+787450', 2),
(208, '+777590', NULL),
(209, '+787652', 1),
(210, '+785815', 2),
(211, '+787666', NULL),
(212, '+788368', 3),
(213, '+784324', 2),
(214, '+784831', NULL),
(215, '+783008', 1),
(216, '+786303', 2),
(217, '+789644', NULL),
(218, '+788606', 2),
(219, '+783531', 3),
(220, '+778516', NULL),
(221, '+781094', 2),
(222, '+780295', 3),
(223, '+782492', NULL),
(224, '+786940', 3),
(225, '+780484', 2),
(226, '+783624', NULL),
(227, '+780079', 1),
(228, '+784780', 2),
(229, '+781283', NULL),
(230, '+786159', 2),
(231, '+782305', 3),
(232, '+778989', NULL),
(233, '+785072', 1),
(234, '+781517', 2),
(235, '+781475', NULL),
(236, '+787153', 2),
(237, '+783109', 1),
(238, '+784086', NULL),
(239, '+784101', 3),
(240, '+780627', 1),
(241, '+782820', NULL),
(242, '+784231', 1),
(243, '+780795', 2),
(244, '+784307', NULL),
(245, '+782658', 2),
(246, '+778438', 1),
(247, '+784563', NULL),
(248, '+779615', 1),
(249, '+786701', 3),
(250, '+781901', NULL);

--сделано
INSERT INTO advisors (advisor_id, staff_id, department_id) VALUES
(1, 1,1),  
(2, 2,2),  
(3, 3,3),  
(4, 4,4),  
(5, 5,5), 
(6, 16,6),  
(7, 17,7),  
(8, 18,8), 
(9, 19,9),  
(10, 20,10),
(21, 11,11),  
(17, 12,12),  
(18, 13,20), 
(19, 14, 13),  
(20, 15,14),
(11, 6,15),  
(12, 7,16),  
(13, 8,17),  
(14, 9,18),  
(15, 10,19),
(16, 21,1);
INSERT INTO degree_progress (credits_required, student_id)
VALUES
(150, 1),
(60, 2),
(30, 3),
(30, 4),
(30, 5),
(60, 6),
(90, 7),
(30, 8),
(90, 9),
(90, 10),
(60, 11),
(240, 12),
(60, 13),
(150, 14),
(240, 15),
(30, 16),
(180, 17),
(30, 18),
(210, 19),
(150, 20),
(150, 21),
(60, 22),
(60, 23),
(180, 24),
(150, 25),
(240, 26),
(60, 27),
(240, 28),
(210, 29),
(90, 30),
(150, 31),
(180, 32),
(150, 33),
(150, 34),
(0, 35),
(240, 36),
(60, 37),
(0, 38),
(120, 39),
(120, 40),
(60, 41),
(30, 42),
(210, 43),
(210, 44),
(210, 45),
(90, 46),
(180, 47),
(90, 48),
(240, 49),
(180, 50),
(240, 51),
(0, 52),
(180, 53),
(0, 54),
(120, 55),
(180, 56),
(120, 57),
(0, 58),
(120, 59),
(180, 60),
(210, 61),
(240, 62),
(240, 63),
(120, 64),
(120, 65),
(180, 66),
(150, 67),
(0, 68),
(210, 69),
(180, 70),
(0, 71),
(180, 72),
(210, 73),
(0, 74),
(180, 75),
(150, 76),
(240, 77),
(60, 78),
(60, 79),
(150, 80),
(60, 81),
(180, 82),
(0, 83),
(120, 84),
(150, 85),
(0, 86),
(240, 87),
(150, 88),
(240, 89),
(240, 90),
(120, 91),
(210, 92),
(90, 93),
(240, 94),
(30, 95),
(210, 96),
(30, 97),
(240, 98),
(0, 99),
(240, 100),
(30, 101),
(0, 102),
(30, 103),
(60, 104),
(240, 105),
(90, 106),
(0, 107),
(0, 108),
(210, 109),
(150, 110),
(0, 111),
(90, 112),
(120, 113),
(0, 114),
(60, 115),
(240, 116),
(0, 117),
(120, 118),
(60, 119),
(150, 120),
(90, 121),
(90, 122),
(0, 123),
(180, 124),
(60, 125),
(150, 126),
(240, 127),
(90, 128),
(60, 129),
(210, 130),
(150, 131),
(150, 132),
(210, 133),
(60, 134),
(240, 135),
(180, 136),
(60, 137),
(240, 138),
(30, 139),
(30, 140),
(240, 141),
(60, 142),
(120, 143),
(180, 144),
(30, 145),
(0, 146),
(60, 147),
(90, 148),
(120, 149),
(180, 150),
(30, 151),
(60, 152),
(150, 153),
(60, 154),
(180, 155),
(30, 156),
(150, 157),
(0, 158),
(60, 159),
(120, 160),
(150, 161),
(30, 162),
(60, 163),
(210, 164),
(60, 165),
(0, 166),
(90, 167),
(180, 168),
(0, 169),
(180, 170),
(90, 171),
(90, 172),
(60, 173),
(90, 174),
(90, 175),
(240, 176),
(0, 177),
(90, 178),
(240, 179),
(0, 180),
(120, 181),
(210, 182),
(90, 183),
(0, 184),
(30, 185),
(180, 186),
(60, 187),
(210, 188),
(30, 189),
(120, 190),
(0, 191),
(120, 192),
(210, 193),
(90, 194),
(30, 195),
(120, 196),
(180, 197),
(60, 198),
(120, 199),
(60, 200),
(120, 201),
(240, 202),
(210, 203),
(120, 204),
(240, 205),
(180, 206),
(90, 207),
(60, 208),
(180, 209),
(150, 210),
(0, 211),
(0, 212),
(210, 213),
(60, 214),
(150, 215),
(120, 216),
(30, 217),
(0, 218),
(90, 219),
(150, 220),
(150, 221),
(0, 222),
(60, 223),
(240, 224),
(150, 225),
(30, 226),
(120, 227),
(150, 228),
(30, 229),
(30, 230),
(240, 231),
(180, 232),
(180, 233),
(90, 234),
(30, 235),
(180, 236),
(180, 237),
(90, 238),
(240, 239),
(0, 240),
(30, 241),
(180, 242),
(0, 243),
(150, 244),
(60, 245),
(180, 246),
(120, 247),
(30, 248),
(210, 249),
(0, 250);
--сделано
insert into meal_plans (plan_id, foods, cost, student_id) values (1, 'Cream - 35%', 803, 12);
insert into meal_plans (plan_id, foods, cost, student_id) values (2, 'Dried Cherries', 933, 132);
insert into meal_plans (plan_id, foods, cost, student_id) values (3, 'Urban Zen Drinks', 867, 44);
insert into meal_plans (plan_id, foods, cost, student_id) values (4, 'Cheese - Cheddar With Claret', 722, 208);
insert into meal_plans (plan_id, foods, cost, student_id) values (5, 'Cheese - Perron Cheddar', 695, 111);
insert into meal_plans (plan_id, foods, cost, student_id) values (6, 'Shrimp - 21/25, Peel And Deviened', 942, 86);
insert into meal_plans (plan_id, foods, cost, student_id) values (7, 'Foam Espresso Cup Plain White', 522, 250);
insert into meal_plans (plan_id, foods, cost, student_id) values (8, 'Snapple - Mango Maddness', 981, 9);
insert into meal_plans (plan_id, foods, cost, student_id) values (9, 'Sole - Fillet', 845, 38);
insert into meal_plans (plan_id, foods, cost, student_id) values (10, 'Ecolab - Mikroklene 4/4 L', 772, 62);
insert into meal_plans (plan_id, foods, cost, student_id) values (11, 'Olives - Nicoise', 821, 66);
insert into meal_plans (plan_id, foods, cost, student_id) values (12, 'Salami - Genova', 599, 4);
insert into meal_plans (plan_id, foods, cost, student_id) values (13, 'Milk - Chocolate 250 Ml', 702, 173);
insert into meal_plans (plan_id, foods, cost, student_id) values (14, 'Truffle Cups - White Paper', 633, 221);
insert into meal_plans (plan_id, foods, cost, student_id) values (15, 'Red Pepper Paste', 880, 97);
insert into meal_plans (plan_id, foods, cost, student_id) values (16, 'Macaroons - Homestyle Two Bit', 787, 121);
insert into meal_plans (plan_id, foods, cost, student_id) values (17, 'Ham - Virginia', 924, 19);
insert into meal_plans (plan_id, foods, cost, student_id) values (18, 'Mushroom - Morels, Dry', 729, 140);
insert into meal_plans (plan_id, foods, cost, student_id) values (19, 'Truffle - Whole Black Peeled', 775, 17);
insert into meal_plans (plan_id, foods, cost, student_id) values (20, 'Dried Apple', 870, 170);
insert into meal_plans (plan_id, foods, cost, student_id) values (21, 'Bar - Granola Trail Mix Fruit Nut', 679, 20);
insert into meal_plans (plan_id, foods, cost, student_id) values (22, 'Quail - Whole, Boneless', 523, 161);
insert into meal_plans (plan_id, foods, cost, student_id) values (23, 'Baking Soda', 695, 193);
insert into meal_plans (plan_id, foods, cost, student_id) values (24, 'Tea - Camomele', 630, 89);
insert into meal_plans (plan_id, foods, cost, student_id) values (25, 'Chinese Foods - Pepper Beef', 644, 161);
insert into meal_plans (plan_id, foods, cost, student_id) values (26, 'Sambuca - Ramazzotti', 715, 195);
insert into meal_plans (plan_id, foods, cost, student_id) values (27, 'Glass Clear 8 Oz', 815, 128);
insert into meal_plans (plan_id, foods, cost, student_id) values (28, 'Basil - Fresh', 601, 151);
insert into meal_plans (plan_id, foods, cost, student_id) values (29, 'Shrimp, Dried, Small / Lb', 773, 149);
insert into meal_plans (plan_id, foods, cost, student_id) values (30, 'Bread - Multigrain Oval', 639, 8);
insert into meal_plans (plan_id, foods, cost, student_id) values (31, 'Pastry - Banana Tea Loaf', 677, 42);
insert into meal_plans (plan_id, foods, cost, student_id) values (32, 'Cod - Salted, Boneless', 694, 143);
insert into meal_plans (plan_id, foods, cost, student_id) values (33, 'Apple - Custard', 788, 81);
insert into meal_plans (plan_id, foods, cost, student_id) values (34, 'Silicone Parch. 16.3x24.3', 505, 101);
insert into meal_plans (plan_id, foods, cost, student_id) values (35, 'Beef - Top Sirloin - Aaa', 842, 68);
insert into meal_plans (plan_id, foods, cost, student_id) values (36, 'Lettuce - Escarole', 798, 148);
insert into meal_plans (plan_id, foods, cost, student_id) values (37, 'Wine - Tio Pepe Sherry Fino', 996, 30);
insert into meal_plans (plan_id, foods, cost, student_id) values (38, 'Flax Seed', 880, 126);
insert into meal_plans (plan_id, foods, cost, student_id) values (39, 'Kolrabi', 624, 229);
insert into meal_plans (plan_id, foods, cost, student_id) values (40, 'Chocolate - Pistoles, Lactee, Milk', 724, 13);
insert into meal_plans (plan_id, foods, cost, student_id) values (41, 'Bag Clear 10 Lb', 686, 35);
insert into meal_plans (plan_id, foods, cost, student_id) values (42, 'Rice - Aborio', 540, 34);
insert into meal_plans (plan_id, foods, cost, student_id) values (43, 'Appetizer - Sausage Rolls', 514, 182);
insert into meal_plans (plan_id, foods, cost, student_id) values (44, 'Milk 2% 500 Ml', 526, 135);
insert into meal_plans (plan_id, foods, cost, student_id) values (45, 'Vodka - Hot, Lnferno', 759, 49);
insert into meal_plans (plan_id, foods, cost, student_id) values (46, 'Wine - Hardys Bankside Shiraz', 992, 131);
insert into meal_plans (plan_id, foods, cost, student_id) values (47, 'Wine - Chateauneuf Du Pape', 648, 203);
insert into meal_plans (plan_id, foods, cost, student_id) values (48, 'Flour - Teff', 515, 56);
insert into meal_plans (plan_id, foods, cost, student_id) values (49, 'Tea - Jasmin Green', 953, 208);
insert into meal_plans (plan_id, foods, cost, student_id) values (50, 'Pail - 15l White, With Handle', 709, 87);
insert into meal_plans (plan_id, foods, cost, student_id) values (51, 'Corn - Cream, Canned', 918, 82);
insert into meal_plans (plan_id, foods, cost, student_id) values (52, 'Lidsoupcont Rp12dn', 594, 51);
insert into meal_plans (plan_id, foods, cost, student_id) values (53, 'Potatoes - Peeled', 920, 98);
insert into meal_plans (plan_id, foods, cost, student_id) values (54, 'Ice Cream - Strawberry', 714, 193);
insert into meal_plans (plan_id, foods, cost, student_id) values (55, 'Beer - Pilsner Urquell', 773, 131);
insert into meal_plans (plan_id, foods, cost, student_id) values (56, 'Crab - Meat Combo', 690, 247);
insert into meal_plans (plan_id, foods, cost, student_id) values (57, 'Nestea - Ice Tea, Diet', 504, 13);
insert into meal_plans (plan_id, foods, cost, student_id) values (58, 'Oil - Margarine', 863, 176);
insert into meal_plans (plan_id, foods, cost, student_id) values (59, 'Lamb - Rack', 637, 39);
insert into meal_plans (plan_id, foods, cost, student_id) values (60, 'Creme De Menth - White', 832, 147);
insert into meal_plans (plan_id, foods, cost, student_id) values (61, 'Butter Balls Salted', 848, 146);
insert into meal_plans (plan_id, foods, cost, student_id) values (62, 'Tea - Green', 870, 15);
insert into meal_plans (plan_id, foods, cost, student_id) values (63, 'Ginger - Fresh', 960, 216);
insert into meal_plans (plan_id, foods, cost, student_id) values (64, 'Cheese - Bocconcini', 856, 23);
insert into meal_plans (plan_id, foods, cost, student_id) values (65, 'Water - San Pellegrino', 637, 179);
insert into meal_plans (plan_id, foods, cost, student_id) values (66, 'Veal - Knuckle', 719, 16);
insert into meal_plans (plan_id, foods, cost, student_id) values (67, 'Soup - Campbells, Spinach Crm', 928, 73);
insert into meal_plans (plan_id, foods, cost, student_id) values (68, 'Tart Shells - Sweet, 2', 805, 61);
insert into meal_plans (plan_id, foods, cost, student_id) values (69, '7up Diet, 355 Ml', 544, 193);
insert into meal_plans (plan_id, foods, cost, student_id) values (70, 'Gloves - Goldtouch Disposable', 991, 66);
insert into meal_plans (plan_id, foods, cost, student_id) values (71, 'Longos - Chicken Wings', 930, 146);
insert into meal_plans (plan_id, foods, cost, student_id) values (72, 'Mustard - Seed', 785, 112);
insert into meal_plans (plan_id, foods, cost, student_id) values (73, 'Extract Vanilla Pure', 587, 211);
insert into meal_plans (plan_id, foods, cost, student_id) values (74, 'Pomello', 941, 16);
insert into meal_plans (plan_id, foods, cost, student_id) values (75, 'Flour - Masa De Harina Mexican', 941, 185);
insert into meal_plans (plan_id, foods, cost, student_id) values (76, 'Lamb - Whole, Fresh', 802, 37);
insert into meal_plans (plan_id, foods, cost, student_id) values (77, 'Cookie Dough - Chocolate Chip', 723, 61);
insert into meal_plans (plan_id, foods, cost, student_id) values (78, 'Yukon Jack', 818, 242);
insert into meal_plans (plan_id, foods, cost, student_id) values (79, 'Apple - Macintosh', 748, 85);
insert into meal_plans (plan_id, foods, cost, student_id) values (80, 'Shrimp - Black Tiger 13/15', 841, 34);
insert into meal_plans (plan_id, foods, cost, student_id) values (81, 'Wine - Saint - Bris 2002, Sauv', 740, 25);
insert into meal_plans (plan_id, foods, cost, student_id) values (82, 'Juice - Lemon', 980, 193);
insert into meal_plans (plan_id, foods, cost, student_id) values (83, 'Cranberries - Fresh', 558, 242);
insert into meal_plans (plan_id, foods, cost, student_id) values (84, 'Sugar - Crumb', 896, 214);
insert into meal_plans (plan_id, foods, cost, student_id) values (85, 'Seedlings - Buckwheat, Organic', 574, 79);
insert into meal_plans (plan_id, foods, cost, student_id) values (86, 'Hot Chocolate - Individual', 915, 186);
insert into meal_plans (plan_id, foods, cost, student_id) values (87, 'Potatoes - Idaho 80 Count', 898, 135);
insert into meal_plans (plan_id, foods, cost, student_id) values (88, 'Soup - Knorr, Country Bean', 615, 245);
insert into meal_plans (plan_id, foods, cost, student_id) values (89, 'Pork - Bacon, Sliced', 685, 14);
insert into meal_plans (plan_id, foods, cost, student_id) values (90, 'Mcgillicuddy Vanilla Schnap', 945, 193);
insert into meal_plans (plan_id, foods, cost, student_id) values (91, 'Gatorade - Fruit Punch', 536, 70);
insert into meal_plans (plan_id, foods, cost, student_id) values (92, 'Lemon Pepper', 507, 250);
insert into meal_plans (plan_id, foods, cost, student_id) values (93, 'Oil - Olive', 722, 153);
insert into meal_plans (plan_id, foods, cost, student_id) values (94, 'Wine - Prem Select Charddonany', 608, 152);
insert into meal_plans (plan_id, foods, cost, student_id) values (95, 'Squash - Pattypan, Yellow', 907, 159);
insert into meal_plans (plan_id, foods, cost, student_id) values (96, 'Arizona - Green Tea', 728, 135);
insert into meal_plans (plan_id, foods, cost, student_id) values (97, 'Beef - Inside Round', 561, 167);
insert into meal_plans (plan_id, foods, cost, student_id) values (98, 'Bar - Granola Trail Mix Fruit Nut', 519, 224);
insert into meal_plans (plan_id, foods, cost, student_id) values (99, 'Vinegar - Rice', 872, 192);
insert into meal_plans (plan_id, foods, cost, student_id) values (100, 'Bread - Pita, Mini', 932, 104);
insert into meal_plans (plan_id, foods, cost, student_id) values (101, 'Iced Tea - Lemon, 340ml', 905, 34);
insert into meal_plans (plan_id, foods, cost, student_id) values (102, 'Kippers - Smoked', 859, 161);
insert into meal_plans (plan_id, foods, cost, student_id) values (103, 'Cheese - Parmesan Grated', 963, 126);
insert into meal_plans (plan_id, foods, cost, student_id) values (104, 'Sloe Gin - Mcguinness', 769, 32);
insert into meal_plans (plan_id, foods, cost, student_id) values (105, 'Wine - White Cab Sauv.on', 750, 248);
insert into meal_plans (plan_id, foods, cost, student_id) values (106, 'Halibut - Fletches', 646, 88);
insert into meal_plans (plan_id, foods, cost, student_id) values (107, 'Bag - Clear 7 Lb', 779, 227);
insert into meal_plans (plan_id, foods, cost, student_id) values (108, 'Pie Pecan', 534, 185);
insert into meal_plans (plan_id, foods, cost, student_id) values (109, 'Smirnoff Green Apple Twist', 812, 31);
insert into meal_plans (plan_id, foods, cost, student_id) values (110, 'Beets - Pickled', 900, 28);
insert into meal_plans (plan_id, foods, cost, student_id) values (111, 'Vinegar - Red Wine', 824, 118);
insert into meal_plans (plan_id, foods, cost, student_id) values (112, 'Bacardi Breezer - Tropical', 997, 157);
insert into meal_plans (plan_id, foods, cost, student_id) values (113, 'Turnip - Wax', 981, 114);
insert into meal_plans (plan_id, foods, cost, student_id) values (114, 'Asparagus - Frozen', 519, 152);
insert into meal_plans (plan_id, foods, cost, student_id) values (115, 'Potatoes - Fingerling 4 Oz', 575, 34);
insert into meal_plans (plan_id, foods, cost, student_id) values (116, 'Jameson - Irish Whiskey', 720, 170);
insert into meal_plans (plan_id, foods, cost, student_id) values (117, 'Soupfoamcont12oz 112con', 827, 184);
insert into meal_plans (plan_id, foods, cost, student_id) values (118, 'Campari', 926, 76);
insert into meal_plans (plan_id, foods, cost, student_id) values (119, 'Wine - Stoneliegh Sauvignon', 671, 16);
insert into meal_plans (plan_id, foods, cost, student_id) values (120, 'Soup - Cream Of Broccoli', 948, 13);
insert into meal_plans (plan_id, foods, cost, student_id) values (121, 'Oven Mitt - 13 Inch', 887, 40);
insert into meal_plans (plan_id, foods, cost, student_id) values (122, 'Flour - Rye', 998, 11);
insert into meal_plans (plan_id, foods, cost, student_id) values (123, 'Tea - Decaf 1 Cup', 711, 247);
insert into meal_plans (plan_id, foods, cost, student_id) values (124, 'Bread - Olive', 851, 33);
insert into meal_plans (plan_id, foods, cost, student_id) values (125, 'Blackberries', 501, 69);
insert into meal_plans (plan_id, foods, cost, student_id) values (126, 'Bread - Corn Muffaletta', 795, 15);
insert into meal_plans (plan_id, foods, cost, student_id) values (127, 'Wood Chips - Regular', 680, 122);
insert into meal_plans (plan_id, foods, cost, student_id) values (128, 'Rice - Aborio', 647, 34);
insert into meal_plans (plan_id, foods, cost, student_id) values (129, 'Appetizer - Veg Assortment', 748, 91);
insert into meal_plans (plan_id, foods, cost, student_id) values (130, 'Remy Red Berry Infusion', 555, 242);
insert into meal_plans (plan_id, foods, cost, student_id) values (131, 'Goldschalger', 937, 17);
insert into meal_plans (plan_id, foods, cost, student_id) values (132, 'Dill Weed - Dry', 565, 220);
insert into meal_plans (plan_id, foods, cost, student_id) values (133, 'Carroway Seed', 580, 247);
insert into meal_plans (plan_id, foods, cost, student_id) values (134, 'Juice - Prune', 846, 82);
insert into meal_plans (plan_id, foods, cost, student_id) values (135, 'Lid Coffeecup 12oz D9542b', 620, 233);
insert into meal_plans (plan_id, foods, cost, student_id) values (136, 'Trout - Smoked', 568, 95);
insert into meal_plans (plan_id, foods, cost, student_id) values (137, 'Towels - Paper / Kraft', 947, 17);
insert into meal_plans (plan_id, foods, cost, student_id) values (138, 'Ice Cream - Turtles Stick Bar', 837, 113);
insert into meal_plans (plan_id, foods, cost, student_id) values (139, 'Ham Black Forest', 605, 87);
insert into meal_plans (plan_id, foods, cost, student_id) values (140, 'Shrimp - Black Tiger 16/20', 509, 166);
insert into meal_plans (plan_id, foods, cost, student_id) values (141, 'Glycerine', 788, 103);
insert into meal_plans (plan_id, foods, cost, student_id) values (142, 'Fond - Neutral', 745, 130);
insert into meal_plans (plan_id, foods, cost, student_id) values (143, 'Trout Rainbow Whole', 743, 127);
insert into meal_plans (plan_id, foods, cost, student_id) values (144, 'Wine - Trimbach Pinot Blanc', 916, 60);
insert into meal_plans (plan_id, foods, cost, student_id) values (145, 'Orange - Blood', 837, 96);
insert into meal_plans (plan_id, foods, cost, student_id) values (146, 'Salt - Sea', 819, 135);
insert into meal_plans (plan_id, foods, cost, student_id) values (147, 'Beer - Mill St Organic', 501, 214);
insert into meal_plans (plan_id, foods, cost, student_id) values (148, 'Rice - Sushi', 551, 88);
insert into meal_plans (plan_id, foods, cost, student_id) values (149, 'Pastry - Lemon Danish - Mini', 687, 3);
insert into meal_plans (plan_id, foods, cost, student_id) values (150, 'Bread - Frozen Basket Variety', 983, 205);
insert into meal_plans (plan_id, foods, cost, student_id) values (151, 'Muffin - Mix - Strawberry Rhubarb', 640, 110);
insert into meal_plans (plan_id, foods, cost, student_id) values (152, 'Snapple - Mango Maddness', 957, 31);
insert into meal_plans (plan_id, foods, cost, student_id) values (153, 'Coffee - Ristretto Coffee Capsule', 692, 48);
insert into meal_plans (plan_id, foods, cost, student_id) values (154, 'Cherries - Maraschino,jar', 848, 4);
insert into meal_plans (plan_id, foods, cost, student_id) values (155, 'Crush - Grape, 355 Ml', 967, 78);
insert into meal_plans (plan_id, foods, cost, student_id) values (156, 'Beer - Paulaner Hefeweisse', 641, 3);
insert into meal_plans (plan_id, foods, cost, student_id) values (157, 'Rappini - Andy Boy', 809, 35);
insert into meal_plans (plan_id, foods, cost, student_id) values (158, 'Pur Value', 978, 133);
insert into meal_plans (plan_id, foods, cost, student_id) values (159, 'Godiva White Chocolate', 736, 9);
insert into meal_plans (plan_id, foods, cost, student_id) values (160, 'Rosemary - Fresh', 717, 151);
insert into meal_plans (plan_id, foods, cost, student_id) values (161, 'Beans - Black Bean, Canned', 510, 219);
insert into meal_plans (plan_id, foods, cost, student_id) values (162, 'Bar Bran Honey Nut', 604, 229);
insert into meal_plans (plan_id, foods, cost, student_id) values (163, 'Wine - Rubyport', 593, 41);
insert into meal_plans (plan_id, foods, cost, student_id) values (164, 'Green Scrubbie Pad H.duty', 885, 203);
insert into meal_plans (plan_id, foods, cost, student_id) values (165, 'Pepper - Black, Whole', 945, 220);
insert into meal_plans (plan_id, foods, cost, student_id) values (166, 'Container - Hngd Cll Blk 7x7x3', 908, 115);
insert into meal_plans (plan_id, foods, cost, student_id) values (167, 'Cod - Black Whole Fillet', 968, 98);
insert into meal_plans (plan_id, foods, cost, student_id) values (168, 'Cheese - Bakers Cream Cheese', 815, 61);
insert into meal_plans (plan_id, foods, cost, student_id) values (169, 'Tomatoes - Yellow Hot House', 903, 157);
insert into meal_plans (plan_id, foods, cost, student_id) values (170, 'Juice - Ocean Spray Kiwi', 714, 76);
insert into meal_plans (plan_id, foods, cost, student_id) values (171, 'Soup - Campbells, Spinach Crm', 847, 124);
insert into meal_plans (plan_id, foods, cost, student_id) values (172, 'The Pop Shoppe Pinapple', 889, 7);
insert into meal_plans (plan_id, foods, cost, student_id) values (173, 'Swiss Chard', 784, 38);
insert into meal_plans (plan_id, foods, cost, student_id) values (174, 'Potatoes - Purple, Organic', 881, 63);
insert into meal_plans (plan_id, foods, cost, student_id) values (175, 'Cheese - Colby', 883, 211);
insert into meal_plans (plan_id, foods, cost, student_id) values (176, 'Island Oasis - Ice Cream Mix', 617, 192);
insert into meal_plans (plan_id, foods, cost, student_id) values (177, 'Artichoke - Hearts, Canned', 520, 72);
insert into meal_plans (plan_id, foods, cost, student_id) values (178, 'Potatoes - Pei 10 Oz', 861, 10);
insert into meal_plans (plan_id, foods, cost, student_id) values (179, 'Table Cloth 54x72 White', 988, 192);
insert into meal_plans (plan_id, foods, cost, student_id) values (180, 'Wine - Segura Viudas Aria Brut', 879, 212);
insert into meal_plans (plan_id, foods, cost, student_id) values (181, 'Goat - Leg', 678, 2);
insert into meal_plans (plan_id, foods, cost, student_id) values (182, 'Yogurt - Strawberry, 175 Gr', 929, 20);
insert into meal_plans (plan_id, foods, cost, student_id) values (183, 'Pail With Metal Handle 16l White', 757, 68);
insert into meal_plans (plan_id, foods, cost, student_id) values (184, 'Myers Planters Punch', 669, 241);
insert into meal_plans (plan_id, foods, cost, student_id) values (185, 'Roe - White Fish', 969, 36);
insert into meal_plans (plan_id, foods, cost, student_id) values (186, 'Wine - Pinot Noir Mondavi Coastal', 802, 43);
insert into meal_plans (plan_id, foods, cost, student_id) values (187, 'Chocolate - Dark Callets', 804, 111);
insert into meal_plans (plan_id, foods, cost, student_id) values (188, 'Beets', 594, 108);
insert into meal_plans (plan_id, foods, cost, student_id) values (189, 'Jam - Blackberry, 20 Ml Jar', 657, 100);
insert into meal_plans (plan_id, foods, cost, student_id) values (190, 'Flour - Teff', 984, 221);
insert into meal_plans (plan_id, foods, cost, student_id) values (191, 'Honey - Lavender', 571, 219);
insert into meal_plans (plan_id, foods, cost, student_id) values (192, 'Bread Base - Gold Formel', 960, 169);
insert into meal_plans (plan_id, foods, cost, student_id) values (193, 'Appetizer - Spring Roll, Veg', 872, 156);
insert into meal_plans (plan_id, foods, cost, student_id) values (194, 'Boogies', 770, 110);
insert into meal_plans (plan_id, foods, cost, student_id) values (195, 'Cheese - Victor Et Berthold', 912, 79);
insert into meal_plans (plan_id, foods, cost, student_id) values (196, 'Sauce - Roasted Red Pepper', 552, 135);
insert into meal_plans (plan_id, foods, cost, student_id) values (197, 'Chilli Paste, Ginger Garlic', 819, 51);
insert into meal_plans (plan_id, foods, cost, student_id) values (198, 'Lamb - Sausage Casings', 771, 17);
insert into meal_plans (plan_id, foods, cost, student_id) values (199, 'Juice - Apple 284ml', 546, 138);
insert into meal_plans (plan_id, foods, cost, student_id) values (200, 'Icecream - Dstk Super Cone', 817, 235);
insert into meal_plans (plan_id, foods, cost, student_id) values (201, 'Clementine', 995, 150);
insert into meal_plans (plan_id, foods, cost, student_id) values (202, 'Pork Loin Bine - In Frenched', 910, 9);
insert into meal_plans (plan_id, foods, cost, student_id) values (203, 'Oven Mitts 17 Inch', 784, 230);
insert into meal_plans (plan_id, foods, cost, student_id) values (204, 'Lettuce - Frisee', 956, 66);
insert into meal_plans (plan_id, foods, cost, student_id) values (205, 'Parasol Pick Stir Stick', 836, 123);
insert into meal_plans (plan_id, foods, cost, student_id) values (206, 'Sultanas', 730, 147);
insert into meal_plans (plan_id, foods, cost, student_id) values (207, 'Lamb - Ground', 612, 154);
insert into meal_plans (plan_id, foods, cost, student_id) values (208, 'Pepper - Green Thai', 797, 70);
insert into meal_plans (plan_id, foods, cost, student_id) values (209, 'Pickerel - Fillets', 540, 145);
insert into meal_plans (plan_id, foods, cost, student_id) values (210, 'Chinese Foods - Pepper Beef', 865, 189);
insert into meal_plans (plan_id, foods, cost, student_id) values (211, 'Beer - Corona', 742, 67);
insert into meal_plans (plan_id, foods, cost, student_id) values (212, 'Apricots Fresh', 866, 202);
insert into meal_plans (plan_id, foods, cost, student_id) values (213, 'Chervil - Fresh', 849, 86);
insert into meal_plans (plan_id, foods, cost, student_id) values (214, 'Salmon - Fillets', 874, 195);
insert into meal_plans (plan_id, foods, cost, student_id) values (215, 'Dill Weed - Dry', 753, 141);
insert into meal_plans (plan_id, foods, cost, student_id) values (216, 'Turkey Tenderloin Frozen', 912, 5);
insert into meal_plans (plan_id, foods, cost, student_id) values (217, 'Tray - Foam, Square 4 - S', 707, 32);
insert into meal_plans (plan_id, foods, cost, student_id) values (218, 'Cookie - Dough Variety', 673, 215);
insert into meal_plans (plan_id, foods, cost, student_id) values (219, 'Papayas', 707, 242);
insert into meal_plans (plan_id, foods, cost, student_id) values (220, 'Wine - Fontanafredda Barolo', 561, 184);
insert into meal_plans (plan_id, foods, cost, student_id) values (221, 'Potato - Sweet', 634, 112);
insert into meal_plans (plan_id, foods, cost, student_id) values (222, 'Chicken - Whole Fryers', 826, 131);
insert into meal_plans (plan_id, foods, cost, student_id) values (223, 'Lighter - Bbq', 655, 69);
insert into meal_plans (plan_id, foods, cost, student_id) values (224, 'Shrimp - Baby, Cold Water', 540, 51);
insert into meal_plans (plan_id, foods, cost, student_id) values (225, 'Chips Potato Swt Chilli Sour', 868, 117);
insert into meal_plans (plan_id, foods, cost, student_id) values (226, 'Pepper - Jalapeno', 585, 123);
insert into meal_plans (plan_id, foods, cost, student_id) values (227, 'Basil - Fresh', 864, 40);
insert into meal_plans (plan_id, foods, cost, student_id) values (228, 'Stainless Steel Cleaner Vision', 774, 107);
insert into meal_plans (plan_id, foods, cost, student_id) values (229, 'Wine - Tio Pepe Sherry Fino', 654, 4);
insert into meal_plans (plan_id, foods, cost, student_id) values (230, 'Milk - Chocolate 250 Ml', 942, 23);
insert into meal_plans (plan_id, foods, cost, student_id) values (231, 'Stock - Beef, White', 638, 226);
insert into meal_plans (plan_id, foods, cost, student_id) values (232, 'Appetizer - Seafood Assortment', 927, 210);
insert into meal_plans (plan_id, foods, cost, student_id) values (233, 'Bar Bran Honey Nut', 519, 189);
insert into meal_plans (plan_id, foods, cost, student_id) values (234, 'Crab Meat Claw Pasteurise', 573, 182);
insert into meal_plans (plan_id, foods, cost, student_id) values (235, 'Breakfast Quesadillas', 923, 204);
insert into meal_plans (plan_id, foods, cost, student_id) values (236, 'Island Oasis - Pina Colada', 600, 190);
insert into meal_plans (plan_id, foods, cost, student_id) values (237, 'Venison - Striploin', 740, 151);
insert into meal_plans (plan_id, foods, cost, student_id) values (238, 'Pasta - Angel Hair', 657, 85);
insert into meal_plans (plan_id, foods, cost, student_id) values (239, 'Sausage - Chorizo', 626, 224);
insert into meal_plans (plan_id, foods, cost, student_id) values (240, 'Barley - Pearl', 870, 71);
insert into meal_plans (plan_id, foods, cost, student_id) values (241, 'Bacardi Mojito', 616, 248);
insert into meal_plans (plan_id, foods, cost, student_id) values (242, 'Milk - Chocolate 500ml', 763, 42);
insert into meal_plans (plan_id, foods, cost, student_id) values (243, 'Bar Energy Chocchip', 599, 107);
insert into meal_plans (plan_id, foods, cost, student_id) values (244, 'Carrots - Mini Red Organic', 676, 247);
insert into meal_plans (plan_id, foods, cost, student_id) values (245, 'Shrimp - 16/20, Iqf, Shell On', 522, 134);
insert into meal_plans (plan_id, foods, cost, student_id) values (246, 'Yogurt - Plain', 857, 241);
insert into meal_plans (plan_id, foods, cost, student_id) values (247, 'Sage - Fresh', 591, 122);
insert into meal_plans (plan_id, foods, cost, student_id) values (248, 'Tomatoes - Orange', 934, 165);
insert into meal_plans (plan_id, foods, cost, student_id) values (249, 'Oil - Shortening - All - Purpose', 623, 213);
insert into meal_plans (plan_id, foods, cost, student_id) values (250, 'Spinach - Baby', 787, 51);
insert into meal_plans (plan_id, foods, cost, student_id) values (251, 'Onions - Red Pearl', 793, 216);
insert into meal_plans (plan_id, foods, cost, student_id) values (252, 'Lettuce - Arugula', 766, 134);
insert into meal_plans (plan_id, foods, cost, student_id) values (253, 'Thyme - Dried', 650, 148);
insert into meal_plans (plan_id, foods, cost, student_id) values (254, 'Sauce - Sesame Thai Dressing', 614, 150);
insert into meal_plans (plan_id, foods, cost, student_id) values (255, 'Lamb Rack Frenched Australian', 573, 29);
insert into meal_plans (plan_id, foods, cost, student_id) values (256, 'Gelatine Powder', 831, 166);
insert into meal_plans (plan_id, foods, cost, student_id) values (257, 'Wine - Riesling Dr. Pauly', 576, 181);
insert into meal_plans (plan_id, foods, cost, student_id) values (258, 'Truffle Cups Green', 634, 44);
insert into meal_plans (plan_id, foods, cost, student_id) values (259, 'Bread - Ciabatta Buns', 791, 71);
insert into meal_plans (plan_id, foods, cost, student_id) values (260, 'Cocoa Powder - Dutched', 844, 142);
insert into meal_plans (plan_id, foods, cost, student_id) values (261, 'Squid - Tubes / Tenticles 10/20', 960, 95);
insert into meal_plans (plan_id, foods, cost, student_id) values (262, 'Tortillas - Flour, 8', 874, 118);
insert into meal_plans (plan_id, foods, cost, student_id) values (263, 'Spring Roll Veg Mini', 520, 72);
insert into meal_plans (plan_id, foods, cost, student_id) values (264, 'Flounder - Fresh', 581, 208);
insert into meal_plans (plan_id, foods, cost, student_id) values (265, 'Bar Mix - Lime', 774, 8);
insert into meal_plans (plan_id, foods, cost, student_id) values (266, 'Plastic Wrap', 596, 221);
insert into meal_plans (plan_id, foods, cost, student_id) values (267, 'Ocean Spray - Ruby Red', 909, 12);
insert into meal_plans (plan_id, foods, cost, student_id) values (268, 'Kiwi', 936, 69);
insert into meal_plans (plan_id, foods, cost, student_id) values (269, 'Gelatine Leaves - Envelopes', 919, 118);
insert into meal_plans (plan_id, foods, cost, student_id) values (270, 'Tray - 12in Rnd Blk', 546, 222);
insert into meal_plans (plan_id, foods, cost, student_id) values (271, 'Cup - Paper 10oz 92959', 555, 83);
insert into meal_plans (plan_id, foods, cost, student_id) values (272, 'Bagels Poppyseed', 829, 85);
insert into meal_plans (plan_id, foods, cost, student_id) values (273, 'Placemat - Scallop, White', 653, 221);
insert into meal_plans (plan_id, foods, cost, student_id) values (274, 'Cheese - Cottage Cheese', 531, 17);
insert into meal_plans (plan_id, foods, cost, student_id) values (275, 'Bread - Mini Hamburger Bun', 865, 191);
insert into meal_plans (plan_id, foods, cost, student_id) values (276, 'Pail - 15l White, With Handle', 742, 171);
insert into meal_plans (plan_id, foods, cost, student_id) values (277, 'Lobster - Live', 515, 156);
insert into meal_plans (plan_id, foods, cost, student_id) values (278, 'Cake Circle, Foil, Scallop', 556, 222);
insert into meal_plans (plan_id, foods, cost, student_id) values (279, 'Chevril', 556, 89);
insert into meal_plans (plan_id, foods, cost, student_id) values (280, 'Sobe - Liz Blizz', 925, 191);
insert into meal_plans (plan_id, foods, cost, student_id) values (281, 'Pepper - Red, Finger Hot', 713, 205);
insert into meal_plans (plan_id, foods, cost, student_id) values (282, 'Juice - Clam, 46 Oz', 594, 92);
insert into meal_plans (plan_id, foods, cost, student_id) values (283, 'Wine - Magnotta - Bel Paese White', 693, 54);
insert into meal_plans (plan_id, foods, cost, student_id) values (284, 'Wine - Red, Black Opal Shiraz', 609, 111);
insert into meal_plans (plan_id, foods, cost, student_id) values (285, 'Pork - Backfat', 599, 27);
insert into meal_plans (plan_id, foods, cost, student_id) values (286, 'Versatainer Nc - 9388', 784, 180);
insert into meal_plans (plan_id, foods, cost, student_id) values (287, 'Muffin - Mix - Mango Sour Cherry', 793, 33);
insert into meal_plans (plan_id, foods, cost, student_id) values (288, 'Pepper - Red Chili', 794, 196);
insert into meal_plans (plan_id, foods, cost, student_id) values (289, 'Tortillas - Flour, 12', 699, 195);
insert into meal_plans (plan_id, foods, cost, student_id) values (290, 'Rum - Mount Gay Eclipes', 629, 9);
insert into meal_plans (plan_id, foods, cost, student_id) values (291, 'Fruit Salad Deluxe', 708, 86);
insert into meal_plans (plan_id, foods, cost, student_id) values (292, 'Wine - White, Riesling, Henry Of', 971, 144);
insert into meal_plans (plan_id, foods, cost, student_id) values (293, 'Bread Crumbs - Japanese Style', 889, 213);
insert into meal_plans (plan_id, foods, cost, student_id) values (294, 'Shrimp - Tiger 21/25', 615, 4);
insert into meal_plans (plan_id, foods, cost, student_id) values (295, 'Cheese - Grana Padano', 780, 7);
insert into meal_plans (plan_id, foods, cost, student_id) values (296, 'Sobe - Orange Carrot', 754, 31);
insert into meal_plans (plan_id, foods, cost, student_id) values (297, 'Maintenance Removal Charge', 644, 234);
insert into meal_plans (plan_id, foods, cost, student_id) values (298, 'Nut - Almond, Blanched, Sliced', 791, 240);
insert into meal_plans (plan_id, foods, cost, student_id) values (299, 'Foil Wrap', 506, 181);
insert into meal_plans (plan_id, foods, cost, student_id) values (300, 'Wine - Alsace Riesling Reserve', 535, 247);
insert into meal_plans (plan_id, foods, cost, student_id) values (301, 'Sauce Tomato Pouch', 958, 223);
insert into meal_plans (plan_id, foods, cost, student_id) values (302, 'Wine - Chardonnay South', 912, 183);
insert into meal_plans (plan_id, foods, cost, student_id) values (303, 'Bread - Pain Au Liat X12', 589, 206);
insert into meal_plans (plan_id, foods, cost, student_id) values (304, 'Wine - Magnotta - Cab Franc', 817, 49);
insert into meal_plans (plan_id, foods, cost, student_id) values (305, 'Water - Mineral, Carbonated', 859, 122);
insert into meal_plans (plan_id, foods, cost, student_id) values (306, 'V8 Splash Strawberry Banana', 994, 55);
insert into meal_plans (plan_id, foods, cost, student_id) values (307, 'Crawfish', 672, 227);
insert into meal_plans (plan_id, foods, cost, student_id) values (308, 'Jam - Raspberry,jar', 694, 68);
insert into meal_plans (plan_id, foods, cost, student_id) values (309, 'Juice - Pineapple, 48 Oz', 785, 101);
insert into meal_plans (plan_id, foods, cost, student_id) values (310, 'Cheese - Cheddar, Mild', 842, 90);
insert into meal_plans (plan_id, foods, cost, student_id) values (311, 'Butter - Salted', 732, 112);
insert into meal_plans (plan_id, foods, cost, student_id) values (312, 'Ice Cream - Strawberry', 856, 202);
insert into meal_plans (plan_id, foods, cost, student_id) values (313, 'Soup - Campbells, Classic Chix', 935, 81);
insert into meal_plans (plan_id, foods, cost, student_id) values (314, 'Tea - Honey Green Tea', 961, 30);
insert into meal_plans (plan_id, foods, cost, student_id) values (315, 'Pork Casing', 975, 129);
insert into meal_plans (plan_id, foods, cost, student_id) values (316, 'Beans - French', 629, 226);
insert into meal_plans (plan_id, foods, cost, student_id) values (317, 'Sour Puss Raspberry', 951, 111);
insert into meal_plans (plan_id, foods, cost, student_id) values (318, 'Swordfish Loin Portions', 979, 97);
insert into meal_plans (plan_id, foods, cost, student_id) values (319, 'Sole - Dover, Whole, Fresh', 663, 83);
insert into meal_plans (plan_id, foods, cost, student_id) values (320, 'Cheese - Swiss', 500, 194);
insert into meal_plans (plan_id, foods, cost, student_id) values (321, 'Tequila Rose Cream Liquor', 784, 8);
insert into meal_plans (plan_id, foods, cost, student_id) values (322, 'Tea - Apple Green Tea', 795, 106);
insert into meal_plans (plan_id, foods, cost, student_id) values (323, 'Scallops - Live In Shell', 681, 70);
insert into meal_plans (plan_id, foods, cost, student_id) values (324, 'Bar Mix - Lemon', 750, 218);
insert into meal_plans (plan_id, foods, cost, student_id) values (325, 'Cookie Trail Mix', 871, 111);
insert into meal_plans (plan_id, foods, cost, student_id) values (326, 'French Kiss Vanilla', 653, 158);
insert into meal_plans (plan_id, foods, cost, student_id) values (327, 'Easy Off Oven Cleaner', 538, 102);
insert into meal_plans (plan_id, foods, cost, student_id) values (328, 'Veal - Heart', 960, 173);
insert into meal_plans (plan_id, foods, cost, student_id) values (329, 'Appetizer - Tarragon Chicken', 609, 68);
insert into meal_plans (plan_id, foods, cost, student_id) values (330, 'Bread - Calabrese Baguette', 925, 188);
insert into meal_plans (plan_id, foods, cost, student_id) values (331, 'Mushroom - Porcini Frozen', 518, 201);
insert into meal_plans (plan_id, foods, cost, student_id) values (332, 'Bar Special K', 665, 142);
insert into meal_plans (plan_id, foods, cost, student_id) values (333, 'Bread - Kimel Stick Poly', 892, 52);
insert into meal_plans (plan_id, foods, cost, student_id) values (334, 'Teriyaki Sauce', 601, 214);
insert into meal_plans (plan_id, foods, cost, student_id) values (335, 'Curry Paste - Madras', 564, 52);
insert into meal_plans (plan_id, foods, cost, student_id) values (336, 'Lid Coffee Cup 8oz Blk', 515, 216);
insert into meal_plans (plan_id, foods, cost, student_id) values (337, 'Turkey - Whole, Fresh', 592, 201);
insert into meal_plans (plan_id, foods, cost, student_id) values (338, 'Octopus - Baby, Cleaned', 940, 3);
insert into meal_plans (plan_id, foods, cost, student_id) values (339, 'Table Cloth 62x120 Colour', 652, 1);
insert into meal_plans (plan_id, foods, cost, student_id) values (340, 'Juice - Grapefruit, 341 Ml', 610, 239);
insert into meal_plans (plan_id, foods, cost, student_id) values (341, 'Soup - Tomato Mush. Florentine', 810, 75);
insert into meal_plans (plan_id, foods, cost, student_id) values (342, 'Loaf Pan - 2 Lb, Foil', 519, 223);
insert into meal_plans (plan_id, foods, cost, student_id) values (343, 'Ocean Spray - Kiwi Strawberry', 798, 189);
insert into meal_plans (plan_id, foods, cost, student_id) values (344, 'Lamb - Racks, Frenched', 932, 210);
insert into meal_plans (plan_id, foods, cost, student_id) values (345, 'Almonds Ground Blanched', 815, 221);
insert into meal_plans (plan_id, foods, cost, student_id) values (346, 'Sherbet - Raspberry', 977, 250);
insert into meal_plans (plan_id, foods, cost, student_id) values (347, 'Remy Red', 868, 154);
insert into meal_plans (plan_id, foods, cost, student_id) values (348, 'Chip - Potato Dill Pickle', 586, 220);
insert into meal_plans (plan_id, foods, cost, student_id) values (349, 'Beans - Black Bean, Preserved', 824, 102);
insert into meal_plans (plan_id, foods, cost, student_id) values (350, 'Vinegar - Champagne', 645, 149);
insert into meal_plans (plan_id, foods, cost, student_id) values (351, 'Shrimp - 16 - 20 Cooked, Peeled', 697, 217);
insert into meal_plans (plan_id, foods, cost, student_id) values (352, 'Bread - Sticks, Thin, Plain', 641, 16);
insert into meal_plans (plan_id, foods, cost, student_id) values (353, 'Lobster - Cooked', 901, 88);
insert into meal_plans (plan_id, foods, cost, student_id) values (354, 'Lamb - Whole Head Off', 607, 44);
insert into meal_plans (plan_id, foods, cost, student_id) values (355, 'Fruit Salad Deluxe', 812, 188);
insert into meal_plans (plan_id, foods, cost, student_id) values (356, 'Curry Powder', 654, 20);
insert into meal_plans (plan_id, foods, cost, student_id) values (357, 'Bar Mix - Lemon', 901, 216);
insert into meal_plans (plan_id, foods, cost, student_id) values (358, 'Soup - Knorr, Chicken Noodle', 615, 90);
insert into meal_plans (plan_id, foods, cost, student_id) values (359, 'Wine - Red, Harrow Estates, Cab', 848, 150);
insert into meal_plans (plan_id, foods, cost, student_id) values (360, 'Sprouts - China Rose', 835, 56);
insert into meal_plans (plan_id, foods, cost, student_id) values (361, 'Instant Coffee', 867, 147);
insert into meal_plans (plan_id, foods, cost, student_id) values (362, 'Tray - 12in Rnd Blk', 639, 248);
insert into meal_plans (plan_id, foods, cost, student_id) values (363, 'Club Soda - Schweppes, 355 Ml', 1000, 109);
insert into meal_plans (plan_id, foods, cost, student_id) values (364, 'Container - Clear 16 Oz', 531, 8);
insert into meal_plans (plan_id, foods, cost, student_id) values (365, 'Wine - Trimbach Pinot Blanc', 630, 39);
insert into meal_plans (plan_id, foods, cost, student_id) values (366, 'Sole - Iqf', 910, 30);
insert into meal_plans (plan_id, foods, cost, student_id) values (367, 'Crab - Meat Combo', 656, 223);
insert into meal_plans (plan_id, foods, cost, student_id) values (368, 'Mahi Mahi', 662, 28);
insert into meal_plans (plan_id, foods, cost, student_id) values (369, 'Milk Powder', 582, 197);
insert into meal_plans (plan_id, foods, cost, student_id) values (370, 'Lentils - Green Le Puy', 835, 247);
insert into meal_plans (plan_id, foods, cost, student_id) values (371, 'Beer - True North Lager', 944, 14);
insert into meal_plans (plan_id, foods, cost, student_id) values (372, 'Chinese Lemon Pork', 983, 87);
insert into meal_plans (plan_id, foods, cost, student_id) values (373, 'Trout - Rainbow, Fresh', 910, 203);
insert into meal_plans (plan_id, foods, cost, student_id) values (374, 'Tomato - Plum With Basil', 882, 179);
insert into meal_plans (plan_id, foods, cost, student_id) values (375, 'Cookies - Fortune', 911, 80);
insert into meal_plans (plan_id, foods, cost, student_id) values (376, 'Pastry - Chocolate Chip Muffin', 908, 231);
insert into meal_plans (plan_id, foods, cost, student_id) values (377, 'Cheese - Montery Jack', 611, 188);
insert into meal_plans (plan_id, foods, cost, student_id) values (378, 'Cheese - Woolwich Goat, Log', 607, 60);
insert into meal_plans (plan_id, foods, cost, student_id) values (379, 'Mix - Cocktail Strawberry Daiquiri', 900, 87);
insert into meal_plans (plan_id, foods, cost, student_id) values (380, 'C - Plus, Orange', 886, 229);
insert into meal_plans (plan_id, foods, cost, student_id) values (381, 'Beef - Tenderloin - Aa', 934, 228);
insert into meal_plans (plan_id, foods, cost, student_id) values (382, 'Cookie - Oreo 100x2', 860, 9);
insert into meal_plans (plan_id, foods, cost, student_id) values (383, 'Bouillion - Fish', 793, 29);
insert into meal_plans (plan_id, foods, cost, student_id) values (384, 'Sugar - Cubes', 908, 149);
insert into meal_plans (plan_id, foods, cost, student_id) values (385, 'Calypso - Lemonade', 573, 165);
insert into meal_plans (plan_id, foods, cost, student_id) values (386, 'Sambuca - Opal Nera', 828, 146);
insert into meal_plans (plan_id, foods, cost, student_id) values (387, 'Iced Tea Concentrate', 985, 90);
insert into meal_plans (plan_id, foods, cost, student_id) values (388, 'Trout - Rainbow, Frozen', 675, 131);
insert into meal_plans (plan_id, foods, cost, student_id) values (389, 'Nantucket Orange Juice', 884, 118);
insert into meal_plans (plan_id, foods, cost, student_id) values (390, 'Cheese - Perron Cheddar', 757, 74);
insert into meal_plans (plan_id, foods, cost, student_id) values (391, 'Napkin - Beverage 1 Ply', 813, 164);
insert into meal_plans (plan_id, foods, cost, student_id) values (392, 'Pork - Chop, Frenched', 769, 29);
insert into meal_plans (plan_id, foods, cost, student_id) values (393, 'Wine - Peller Estates Late', 930, 135);
insert into meal_plans (plan_id, foods, cost, student_id) values (394, 'Chicken - Wings, Tip Off', 976, 140);
insert into meal_plans (plan_id, foods, cost, student_id) values (395, 'Pork - Suckling Pig', 855, 163);
insert into meal_plans (plan_id, foods, cost, student_id) values (396, 'Bread - Mini Hamburger Bun', 576, 206);
insert into meal_plans (plan_id, foods, cost, student_id) values (397, 'The Pop Shoppe - Grape', 738, 88);
insert into meal_plans (plan_id, foods, cost, student_id) values (398, 'Beef - Short Ribs', 950, 216);
insert into meal_plans (plan_id, foods, cost, student_id) values (399, 'Table Cloth 91x91 Colour', 630, 164);
insert into meal_plans (plan_id, foods, cost, student_id) values (400, 'Huck Towels White', 522, 98);
insert into meal_plans (plan_id, foods, cost, student_id) values (401, 'Appetizer - Southwestern', 705, 224);
insert into meal_plans (plan_id, foods, cost, student_id) values (402, 'Water - Aquafina Vitamin', 962, 166);
insert into meal_plans (plan_id, foods, cost, student_id) values (403, 'Sobe - Green Tea', 687, 73);
insert into meal_plans (plan_id, foods, cost, student_id) values (404, 'Carroway Seed', 559, 34);
insert into meal_plans (plan_id, foods, cost, student_id) values (405, 'Wine - White, Antinore Orvieto', 838, 237);
insert into meal_plans (plan_id, foods, cost, student_id) values (406, 'Creme De Menthe Green', 757, 132);
insert into meal_plans (plan_id, foods, cost, student_id) values (407, 'Crab - Claws, 26 - 30', 824, 119);
insert into meal_plans (plan_id, foods, cost, student_id) values (408, 'Cream - 35%', 615, 234);
insert into meal_plans (plan_id, foods, cost, student_id) values (409, 'Tuna - Bluefin', 757, 45);
insert into meal_plans (plan_id, foods, cost, student_id) values (410, 'Bread Country Roll', 987, 52);
insert into meal_plans (plan_id, foods, cost, student_id) values (411, 'Lettuce - Spring Mix', 922, 122);
insert into meal_plans (plan_id, foods, cost, student_id) values (412, 'Chicken Breast Halal', 992, 46);
insert into meal_plans (plan_id, foods, cost, student_id) values (413, 'Wine - Magnotta - Cab Sauv', 673, 54);
insert into meal_plans (plan_id, foods, cost, student_id) values (414, 'Walkers Special Old Whiskey', 616, 208);
insert into meal_plans (plan_id, foods, cost, student_id) values (415, 'Wine - Red, Cooking', 932, 155);
insert into meal_plans (plan_id, foods, cost, student_id) values (416, 'Curry Paste - Green Masala', 928, 34);
insert into meal_plans (plan_id, foods, cost, student_id) values (417, 'Appetizer - Mango Chevre', 998, 93);
insert into meal_plans (plan_id, foods, cost, student_id) values (418, 'Sage - Ground', 772, 44);
insert into meal_plans (plan_id, foods, cost, student_id) values (419, 'Beans - Fava Fresh', 529, 66);
insert into meal_plans (plan_id, foods, cost, student_id) values (420, 'Beef - Salted', 607, 7);
insert into meal_plans (plan_id, foods, cost, student_id) values (421, 'Lid Coffeecup 12oz D9542b', 734, 210);
insert into meal_plans (plan_id, foods, cost, student_id) values (422, 'Halibut - Fletches', 729, 188);
insert into meal_plans (plan_id, foods, cost, student_id) values (423, 'Eggplant - Regular', 689, 195);
insert into meal_plans (plan_id, foods, cost, student_id) values (424, 'Coffee Cup 8oz 5338cd', 921, 213);
insert into meal_plans (plan_id, foods, cost, student_id) values (425, 'Pepper - White, Ground', 864, 50);
insert into meal_plans (plan_id, foods, cost, student_id) values (426, 'Veal Inside - Provimi', 930, 121);
insert into meal_plans (plan_id, foods, cost, student_id) values (427, 'Catfish - Fillets', 564, 154);
insert into meal_plans (plan_id, foods, cost, student_id) values (428, 'Gatorade - Lemon Lime', 626, 114);
insert into meal_plans (plan_id, foods, cost, student_id) values (429, 'Mustard - Individual Pkg', 953, 120);
insert into meal_plans (plan_id, foods, cost, student_id) values (430, 'Chinese Foods - Pepper Beef', 959, 12);
insert into meal_plans (plan_id, foods, cost, student_id) values (431, 'Coriander - Seed', 540, 209);
insert into meal_plans (plan_id, foods, cost, student_id) values (432, 'Chocolate - Milk Coating', 743, 143);
insert into meal_plans (plan_id, foods, cost, student_id) values (433, 'Longos - Chicken Caeser Salad', 832, 213);
insert into meal_plans (plan_id, foods, cost, student_id) values (434, 'Soda Water - Club Soda, 355 Ml', 820, 208);
insert into meal_plans (plan_id, foods, cost, student_id) values (435, 'Veal - Striploin', 516, 15);
insert into meal_plans (plan_id, foods, cost, student_id) values (436, 'Flour - Teff', 854, 235);
insert into meal_plans (plan_id, foods, cost, student_id) values (437, 'Vinegar - Tarragon', 935, 5);
insert into meal_plans (plan_id, foods, cost, student_id) values (438, 'Bar Mix - Lemon', 609, 135);
insert into meal_plans (plan_id, foods, cost, student_id) values (439, 'Godiva White Chocolate', 904, 130);
insert into meal_plans (plan_id, foods, cost, student_id) values (440, 'Jameson - Irish Whiskey', 968, 14);
insert into meal_plans (plan_id, foods, cost, student_id) values (441, 'Squash - Pepper', 698, 208);
insert into meal_plans (plan_id, foods, cost, student_id) values (442, 'Wine La Vielle Ferme Cote Du', 634, 8);
insert into meal_plans (plan_id, foods, cost, student_id) values (443, 'Soup Bowl Clear 8oz92008', 685, 46);
insert into meal_plans (plan_id, foods, cost, student_id) values (444, 'Icecream - Dstk Cml And Fdg', 872, 116);
insert into meal_plans (plan_id, foods, cost, student_id) values (445, 'Pate - Liver', 759, 228);
insert into meal_plans (plan_id, foods, cost, student_id) values (446, 'Eel Fresh', 615, 208);
insert into meal_plans (plan_id, foods, cost, student_id) values (447, 'Chicken - Tenderloin', 626, 32);
insert into meal_plans (plan_id, foods, cost, student_id) values (448, 'Pasta - Angel Hair', 760, 111);
insert into meal_plans (plan_id, foods, cost, student_id) values (449, 'Tandoori Curry Paste', 770, 15);
insert into meal_plans (plan_id, foods, cost, student_id) values (450, 'Bread - Pain Au Liat X12', 934, 78);
insert into meal_plans (plan_id, foods, cost, student_id) values (451, 'Shopper Bag - S - 4', 908, 45);
insert into meal_plans (plan_id, foods, cost, student_id) values (452, 'Lamb - Shoulder, Boneless', 871, 23);
insert into meal_plans (plan_id, foods, cost, student_id) values (453, 'Pastrami', 770, 33);
insert into meal_plans (plan_id, foods, cost, student_id) values (454, 'Foam Dinner Plate', 794, 201);
insert into meal_plans (plan_id, foods, cost, student_id) values (455, 'Mikes Hard Lemonade', 847, 25);
insert into meal_plans (plan_id, foods, cost, student_id) values (456, 'Celery', 832, 159);
insert into meal_plans (plan_id, foods, cost, student_id) values (457, 'Cape Capensis - Fillet', 728, 86);
insert into meal_plans (plan_id, foods, cost, student_id) values (458, 'Beef Ground Medium', 888, 111);
insert into meal_plans (plan_id, foods, cost, student_id) values (459, 'Pears - Bosc', 804, 9);
insert into meal_plans (plan_id, foods, cost, student_id) values (460, 'Bay Leaf Ground', 632, 157);
insert into meal_plans (plan_id, foods, cost, student_id) values (461, 'Energy - Boo - Koo', 686, 250);
insert into meal_plans (plan_id, foods, cost, student_id) values (462, 'Pork - Ham, Virginia', 690, 17);
insert into meal_plans (plan_id, foods, cost, student_id) values (463, 'Veal - Provimi Inside', 959, 34);
insert into meal_plans (plan_id, foods, cost, student_id) values (464, 'Cocktail Napkin Blue', 683, 164);
insert into meal_plans (plan_id, foods, cost, student_id) values (465, 'Wine - Port Late Bottled Vintage', 589, 146);
insert into meal_plans (plan_id, foods, cost, student_id) values (466, 'Chef Hat 25cm', 833, 100);
insert into meal_plans (plan_id, foods, cost, student_id) values (467, 'Longos - Chicken Caeser Salad', 859, 166);
insert into meal_plans (plan_id, foods, cost, student_id) values (468, 'Wine - Port Late Bottled Vintage', 853, 98);
insert into meal_plans (plan_id, foods, cost, student_id) values (469, 'Nut - Pine Nuts, Whole', 700, 155);
insert into meal_plans (plan_id, foods, cost, student_id) values (470, 'Anchovy Paste - 56 G Tube', 799, 129);
insert into meal_plans (plan_id, foods, cost, student_id) values (471, 'Wine - Cava Aria Estate Brut', 511, 140);
insert into meal_plans (plan_id, foods, cost, student_id) values (472, 'Melon - Cantaloupe', 688, 112);
insert into meal_plans (plan_id, foods, cost, student_id) values (473, 'Veal - Brisket, Provimi,bnls', 942, 189);
insert into meal_plans (plan_id, foods, cost, student_id) values (474, 'Wine - Red, Lurton Merlot De', 802, 14);
insert into meal_plans (plan_id, foods, cost, student_id) values (475, 'Bag - Regular Kraft 20 Lb', 643, 53);
insert into meal_plans (plan_id, foods, cost, student_id) values (476, 'Cheese - Boursin, Garlic / Herbs', 507, 167);
insert into meal_plans (plan_id, foods, cost, student_id) values (477, 'Napkin - Beverge, White 2 - Ply', 685, 7);
insert into meal_plans (plan_id, foods, cost, student_id) values (478, 'Clams - Littleneck, Whole', 734, 217);
insert into meal_plans (plan_id, foods, cost, student_id) values (479, 'Juice - Apple, 341 Ml', 842, 87);
insert into meal_plans (plan_id, foods, cost, student_id) values (480, 'Sprouts - Alfalfa', 978, 165);
insert into meal_plans (plan_id, foods, cost, student_id) values (481, 'Spinach - Packaged', 905, 239);
insert into meal_plans (plan_id, foods, cost, student_id) values (482, 'Cake - Lemon Chiffon', 822, 64);
insert into meal_plans (plan_id, foods, cost, student_id) values (483, 'Cinnamon - Ground', 549, 204);
insert into meal_plans (plan_id, foods, cost, student_id) values (484, 'Wine - Ice Wine', 688, 156);
insert into meal_plans (plan_id, foods, cost, student_id) values (485, 'Oil - Truffle, White', 963, 181);
insert into meal_plans (plan_id, foods, cost, student_id) values (486, 'Chocolate - Semi Sweet', 853, 144);
insert into meal_plans (plan_id, foods, cost, student_id) values (487, 'Pepper - Green, Chili', 634, 138);
insert into meal_plans (plan_id, foods, cost, student_id) values (488, 'Melon - Cantaloupe', 979, 41);
insert into meal_plans (plan_id, foods, cost, student_id) values (489, 'Pork - Bacon, Double Smoked', 943, 132);
insert into meal_plans (plan_id, foods, cost, student_id) values (490, 'Garam Masala Powder', 714, 90);
insert into meal_plans (plan_id, foods, cost, student_id) values (491, 'Pasta - Rotini, Colour, Dry', 908, 30);
insert into meal_plans (plan_id, foods, cost, student_id) values (492, 'Chicken - Leg / Back Attach', 761, 94);
insert into meal_plans (plan_id, foods, cost, student_id) values (493, 'Mackerel Whole Fresh', 967, 99);
insert into meal_plans (plan_id, foods, cost, student_id) values (494, 'Water - Perrier', 804, 188);
insert into meal_plans (plan_id, foods, cost, student_id) values (495, 'Peach - Halves', 905, 120);
insert into meal_plans (plan_id, foods, cost, student_id) values (496, 'Bread - Italian Corn Meal Poly', 562, 233);
insert into meal_plans (plan_id, foods, cost, student_id) values (497, 'Compound - Mocha', 695, 234);
insert into meal_plans (plan_id, foods, cost, student_id) values (498, 'Propel Sport Drink', 751, 130);
insert into meal_plans (plan_id, foods, cost, student_id) values (499, 'Cheese - Swiss Sliced', 538, 173);
insert into meal_plans (plan_id, foods, cost, student_id) values (500, 'Bar - Granola Trail Mix Fruit Nut', 945, 176);
insert into meal_plans (plan_id, foods, cost, student_id) values (501, 'Longos - Lasagna Beef', 536, 102);
insert into meal_plans (plan_id, foods, cost, student_id) values (502, 'Rabbit - Saddles', 940, 121);
insert into meal_plans (plan_id, foods, cost, student_id) values (503, 'Milk - Condensed', 835, 12);
insert into meal_plans (plan_id, foods, cost, student_id) values (504, 'Peppercorns - Pink', 907, 168);
insert into meal_plans (plan_id, foods, cost, student_id) values (505, 'Ice Cream - Super Sandwich', 774, 187);
insert into meal_plans (plan_id, foods, cost, student_id) values (506, 'Wine - Riesling Dr. Pauly', 983, 132);
insert into meal_plans (plan_id, foods, cost, student_id) values (507, 'Bag Clear 10 Lb', 835, 32);
insert into meal_plans (plan_id, foods, cost, student_id) values (508, 'Chilli Paste, Sambal Oelek', 893, 65);
insert into meal_plans (plan_id, foods, cost, student_id) values (509, 'Shrimp - Black Tiger 16/20', 562, 203);
insert into meal_plans (plan_id, foods, cost, student_id) values (510, 'Spring Roll Wrappers', 871, 122);
insert into meal_plans (plan_id, foods, cost, student_id) values (511, 'Beef - Montreal Smoked Brisket', 776, 100);
insert into meal_plans (plan_id, foods, cost, student_id) values (512, 'Compound - Passion Fruit', 921, 191);
insert into meal_plans (plan_id, foods, cost, student_id) values (513, 'Bag Clear 10 Lb', 759, 99);
insert into meal_plans (plan_id, foods, cost, student_id) values (514, 'Beef - Diced', 546, 128);
insert into meal_plans (plan_id, foods, cost, student_id) values (515, 'Cup - 6oz, Foam', 793, 152);
insert into meal_plans (plan_id, foods, cost, student_id) values (516, 'Mudslide', 948, 193);
insert into meal_plans (plan_id, foods, cost, student_id) values (517, 'Tendrils - Baby Pea, Organic', 611, 242);
insert into meal_plans (plan_id, foods, cost, student_id) values (518, 'Aspic - Light', 925, 244);
insert into meal_plans (plan_id, foods, cost, student_id) values (519, 'Bowl 12 Oz - Showcase 92012', 553, 19);
insert into meal_plans (plan_id, foods, cost, student_id) values (520, 'Chips - Potato Jalapeno', 969, 222);
insert into meal_plans (plan_id, foods, cost, student_id) values (521, 'Kellogs Special K Cereal', 625, 118);
insert into meal_plans (plan_id, foods, cost, student_id) values (522, 'Initation Crab Meat', 805, 66);
insert into meal_plans (plan_id, foods, cost, student_id) values (523, 'Wine - Red, Gamay Noir', 744, 246);
insert into meal_plans (plan_id, foods, cost, student_id) values (524, 'Beef - Tenderloin - Aa', 618, 118);
insert into meal_plans (plan_id, foods, cost, student_id) values (525, 'Rice Paper', 684, 67);
insert into meal_plans (plan_id, foods, cost, student_id) values (526, 'Chicken - Whole Fryers', 624, 89);
insert into meal_plans (plan_id, foods, cost, student_id) values (527, 'Orange - Tangerine', 555, 101);
insert into meal_plans (plan_id, foods, cost, student_id) values (528, 'Southern Comfort', 561, 53);
insert into meal_plans (plan_id, foods, cost, student_id) values (529, 'Pur Source', 614, 178);
insert into meal_plans (plan_id, foods, cost, student_id) values (530, 'Mushroom - Enoki, Dry', 975, 206);
insert into meal_plans (plan_id, foods, cost, student_id) values (531, 'Sage - Fresh', 924, 208);
insert into meal_plans (plan_id, foods, cost, student_id) values (532, 'Compound - Rum', 869, 138);
insert into meal_plans (plan_id, foods, cost, student_id) values (533, 'Wine - Hardys Bankside Shiraz', 516, 245);
insert into meal_plans (plan_id, foods, cost, student_id) values (534, 'Tuna - Loin', 680, 203);
insert into meal_plans (plan_id, foods, cost, student_id) values (535, 'Wine - Crozes Hermitage E.', 740, 30);
insert into meal_plans (plan_id, foods, cost, student_id) values (536, 'Beef - Ground Medium', 694, 87);
insert into meal_plans (plan_id, foods, cost, student_id) values (537, 'Cilantro / Coriander - Fresh', 744, 113);
insert into meal_plans (plan_id, foods, cost, student_id) values (538, 'Cheese - Parmesan Cubes', 841, 206);
insert into meal_plans (plan_id, foods, cost, student_id) values (539, 'Wine - Casillero Del Diablo', 708, 147);
insert into meal_plans (plan_id, foods, cost, student_id) values (540, 'Soup - Knorr, Chicken Noodle', 565, 59);
insert into meal_plans (plan_id, foods, cost, student_id) values (541, 'Flour - Bran, Red', 736, 4);
insert into meal_plans (plan_id, foods, cost, student_id) values (542, 'Soup - French Onion, Dry', 842, 174);
insert into meal_plans (plan_id, foods, cost, student_id) values (543, 'Apple - Granny Smith', 711, 158);
insert into meal_plans (plan_id, foods, cost, student_id) values (544, 'Savory', 991, 146);
insert into meal_plans (plan_id, foods, cost, student_id) values (545, 'Sole - Fillet', 827, 116);
insert into meal_plans (plan_id, foods, cost, student_id) values (546, 'Coconut Milk - Unsweetened', 829, 42);
insert into meal_plans (plan_id, foods, cost, student_id) values (547, 'Pork - Bacon Cooked Slcd', 631, 78);
insert into meal_plans (plan_id, foods, cost, student_id) values (548, 'Appetizer - Mini Egg Roll, Shrimp', 964, 4);
insert into meal_plans (plan_id, foods, cost, student_id) values (549, 'Coffee Caramel Biscotti', 728, 162);
insert into meal_plans (plan_id, foods, cost, student_id) values (550, 'Scallops - 10/20', 800, 111);
insert into meal_plans (plan_id, foods, cost, student_id) values (551, 'Dried Figs', 570, 51);
insert into meal_plans (plan_id, foods, cost, student_id) values (552, 'Oil - Shortening - All - Purpose', 658, 69);
insert into meal_plans (plan_id, foods, cost, student_id) values (553, 'Flour Pastry Super Fine', 708, 133);
insert into meal_plans (plan_id, foods, cost, student_id) values (554, 'Jolt Cola - Electric Blue', 798, 178);
insert into meal_plans (plan_id, foods, cost, student_id) values (555, 'Chicken - Breast, 5 - 7 Oz', 945, 163);
insert into meal_plans (plan_id, foods, cost, student_id) values (556, 'Coffee - Cafe Moreno', 663, 167);
insert into meal_plans (plan_id, foods, cost, student_id) values (557, 'Ecolab - Hobart Washarm End Cap', 706, 172);
insert into meal_plans (plan_id, foods, cost, student_id) values (558, 'Cabbage - Savoy', 518, 203);
insert into meal_plans (plan_id, foods, cost, student_id) values (559, 'Spoon - Soup, Plastic', 751, 157);
insert into meal_plans (plan_id, foods, cost, student_id) values (560, 'Puff Pastry - Sheets', 670, 49);
insert into meal_plans (plan_id, foods, cost, student_id) values (561, 'Pineapple - Regular', 636, 71);
insert into meal_plans (plan_id, foods, cost, student_id) values (562, 'Lemons', 523, 136);
insert into meal_plans (plan_id, foods, cost, student_id) values (563, 'Lid Coffee Cup 8oz Blk', 908, 66);
insert into meal_plans (plan_id, foods, cost, student_id) values (564, 'Pork Loin Cutlets', 606, 203);
insert into meal_plans (plan_id, foods, cost, student_id) values (565, 'Oil - Pumpkinseed', 934, 2);
insert into meal_plans (plan_id, foods, cost, student_id) values (566, 'Wine - Chianti Classico Riserva', 725, 64);
insert into meal_plans (plan_id, foods, cost, student_id) values (567, 'Chilli Paste, Hot Sambal Oelek', 714, 244);
insert into meal_plans (plan_id, foods, cost, student_id) values (568, 'Wine - Domaine Boyar Royal', 988, 72);
insert into meal_plans (plan_id, foods, cost, student_id) values (569, 'Lentils - Green Le Puy', 754, 179);
insert into meal_plans (plan_id, foods, cost, student_id) values (570, 'Sprouts - Alfalfa', 561, 59);
insert into meal_plans (plan_id, foods, cost, student_id) values (571, 'Tuna - Fresh', 662, 34);
insert into meal_plans (plan_id, foods, cost, student_id) values (572, 'Wine - German Riesling', 724, 71);
insert into meal_plans (plan_id, foods, cost, student_id) values (573, 'Cheese - Bocconcini', 664, 189);
insert into meal_plans (plan_id, foods, cost, student_id) values (574, 'Table Cloth 90x90 White', 783, 39);
insert into meal_plans (plan_id, foods, cost, student_id) values (575, 'Lid - Translucent, 3.5 And 6 Oz', 643, 107);
insert into meal_plans (plan_id, foods, cost, student_id) values (576, 'Straw - Regular', 835, 18);
insert into meal_plans (plan_id, foods, cost, student_id) values (577, 'Mushroom - Enoki, Fresh', 825, 239);
insert into meal_plans (plan_id, foods, cost, student_id) values (578, 'Vermouth - Sweet, Cinzano', 571, 18);
insert into meal_plans (plan_id, foods, cost, student_id) values (579, 'Ice Cream Bar - Hageen Daz To', 766, 200);
insert into meal_plans (plan_id, foods, cost, student_id) values (580, 'Crab - Blue, Frozen', 742, 120);
insert into meal_plans (plan_id, foods, cost, student_id) values (581, 'Pork - Caul Fat', 753, 239);
insert into meal_plans (plan_id, foods, cost, student_id) values (582, 'Pastry - Key Limepoppy Seed Tea', 666, 225);
insert into meal_plans (plan_id, foods, cost, student_id) values (583, 'V8 - Berry Blend', 712, 73);
insert into meal_plans (plan_id, foods, cost, student_id) values (584, 'Aspic - Clear', 521, 178);
insert into meal_plans (plan_id, foods, cost, student_id) values (585, 'Pasta - Fettuccine, Dry', 976, 167);
insert into meal_plans (plan_id, foods, cost, student_id) values (586, 'Juice - Orange 1.89l', 723, 92);
insert into meal_plans (plan_id, foods, cost, student_id) values (587, 'Cheese - Montery Jack', 601, 141);
insert into meal_plans (plan_id, foods, cost, student_id) values (588, 'Shichimi Togarashi Peppeers', 902, 115);
insert into meal_plans (plan_id, foods, cost, student_id) values (589, 'Table Cloth 54x72 Colour', 878, 176);
insert into meal_plans (plan_id, foods, cost, student_id) values (590, 'Ice Cream Bar - Hageen Daz To', 597, 110);
insert into meal_plans (plan_id, foods, cost, student_id) values (591, 'Beef - Chuck, Boneless', 920, 162);
insert into meal_plans (plan_id, foods, cost, student_id) values (592, 'Island Oasis - Cappucino Mix', 615, 169);
insert into meal_plans (plan_id, foods, cost, student_id) values (593, 'Tray - Foam, Square 4 - S', 649, 135);
insert into meal_plans (plan_id, foods, cost, student_id) values (594, 'Cheese - Swiss Sliced', 855, 96);
insert into meal_plans (plan_id, foods, cost, student_id) values (595, 'Pail For Lid 1537', 527, 113);
insert into meal_plans (plan_id, foods, cost, student_id) values (596, 'Fireball Whisky', 604, 107);
insert into meal_plans (plan_id, foods, cost, student_id) values (597, 'Flavouring - Orange', 654, 219);
insert into meal_plans (plan_id, foods, cost, student_id) values (598, 'Cake - Cheese Cake 9 Inch', 829, 37);
insert into meal_plans (plan_id, foods, cost, student_id) values (599, 'Eggwhite Frozen', 803, 244);
insert into meal_plans (plan_id, foods, cost, student_id) values (600, 'Paper Cocktail Umberlla 80 - 180', 749, 42);

--сделано
insert into student_fees (fee_id, student_id, amount, status) values (1, 1, 1395414, true);
insert into student_fees (fee_id, student_id, amount, status) values (2, 2, 1115014, true);
insert into student_fees (fee_id, student_id, amount, status) values (3, 3, 1246908, false);
insert into student_fees (fee_id, student_id, amount, status) values (4, 4, 1496945, false);
insert into student_fees (fee_id, student_id, amount, status) values (5, 5, 1064577, true);
insert into student_fees (fee_id, student_id, amount, status) values (6, 6, 1045313, false);
insert into student_fees (fee_id, student_id, amount, status) values (7, 7, 1366306, true);
insert into student_fees (fee_id, student_id, amount, status) values (8, 8, 1376455, false);
insert into student_fees (fee_id, student_id, amount, status) values (9, 9, 1130403, true);
insert into student_fees (fee_id, student_id, amount, status) values (10, 10, 1038771, true);
insert into student_fees (fee_id, student_id, amount, status) values (11, 11, 1417327, false);
insert into student_fees (fee_id, student_id, amount, status) values (12, 12, 1227881, false);
insert into student_fees (fee_id, student_id, amount, status) values (13, 13, 1288027, false);
insert into student_fees (fee_id, student_id, amount, status) values (14, 14, 1330585, false);
insert into student_fees (fee_id, student_id, amount, status) values (15, 15, 1484999, true);
insert into student_fees (fee_id, student_id, amount, status) values (16, 16, 1156923, false);
insert into student_fees (fee_id, student_id, amount, status) values (17, 17, 1187738, false);
insert into student_fees (fee_id, student_id, amount, status) values (18, 18, 1048217, true);
insert into student_fees (fee_id, student_id, amount, status) values (19, 19, 1437495, true);
insert into student_fees (fee_id, student_id, amount, status) values (20, 20, 1038689, false);
insert into student_fees (fee_id, student_id, amount, status) values (21, 21, 1462698, true);
insert into student_fees (fee_id, student_id, amount, status) values (22, 22, 1385171, true);
insert into student_fees (fee_id, student_id, amount, status) values (23, 23, 1162141, false);
insert into student_fees (fee_id, student_id, amount, status) values (24, 24, 1013734, true);
insert into student_fees (fee_id, student_id, amount, status) values (25, 25, 1249064, true);
insert into student_fees (fee_id, student_id, amount, status) values (26, 26, 1066413, true);
insert into student_fees (fee_id, student_id, amount, status) values (27, 27, 1274654, false);
insert into student_fees (fee_id, student_id, amount, status) values (28, 28, 1274900, false);
insert into student_fees (fee_id, student_id, amount, status) values (29, 29, 1383189, false);
insert into student_fees (fee_id, student_id, amount, status) values (30, 30, 1013632, true);
insert into student_fees (fee_id, student_id, amount, status) values (31, 31, 1359310, false);
insert into student_fees (fee_id, student_id, amount, status) values (32, 32, 1232223, true);
insert into student_fees (fee_id, student_id, amount, status) values (33, 33, 1052362, true);
insert into student_fees (fee_id, student_id, amount, status) values (34, 34, 1282982, false);
insert into student_fees (fee_id, student_id, amount, status) values (35, 35, 1147627, false);
insert into student_fees (fee_id, student_id, amount, status) values (36, 36, 1271104, true);
insert into student_fees (fee_id, student_id, amount, status) values (37, 37, 1168668, false);
insert into student_fees (fee_id, student_id, amount, status) values (38, 38, 1420033, true);
insert into student_fees (fee_id, student_id, amount, status) values (39, 39, 1073035, true);
insert into student_fees (fee_id, student_id, amount, status) values (40, 40, 1380625, false);
insert into student_fees (fee_id, student_id, amount, status) values (41, 41, 1376443, false);
insert into student_fees (fee_id, student_id, amount, status) values (42, 42, 1481545, true);
insert into student_fees (fee_id, student_id, amount, status) values (43, 43, 1435261, true);
insert into student_fees (fee_id, student_id, amount, status) values (44, 44, 1430740, true);
insert into student_fees (fee_id, student_id, amount, status) values (45, 45, 1138353, false);
insert into student_fees (fee_id, student_id, amount, status) values (46, 46, 1086408, true);
insert into student_fees (fee_id, student_id, amount, status) values (47, 47, 1445429, true);
insert into student_fees (fee_id, student_id, amount, status) values (48, 48, 1105032, false);
insert into student_fees (fee_id, student_id, amount, status) values (49, 49, 1220468, false);
insert into student_fees (fee_id, student_id, amount, status) values (50, 50, 1373028, true);
insert into student_fees (fee_id, student_id, amount, status) values (51, 51, 1394199, true);
insert into student_fees (fee_id, student_id, amount, status) values (52, 52, 1349728, true);
insert into student_fees (fee_id, student_id, amount, status) values (53, 53, 1081253, false);
insert into student_fees (fee_id, student_id, amount, status) values (54, 54, 1245441, true);
insert into student_fees (fee_id, student_id, amount, status) values (55, 55, 1376303, false);
insert into student_fees (fee_id, student_id, amount, status) values (56, 56, 1254111, true);
insert into student_fees (fee_id, student_id, amount, status) values (57, 57, 1367509, false);
insert into student_fees (fee_id, student_id, amount, status) values (58, 58, 1499505, true);
insert into student_fees (fee_id, student_id, amount, status) values (59, 59, 1078635, false);
insert into student_fees (fee_id, student_id, amount, status) values (60, 60, 1363369, false);
insert into student_fees (fee_id, student_id, amount, status) values (61, 61, 1256523, false);
insert into student_fees (fee_id, student_id, amount, status) values (62, 62, 1180101, false);
insert into student_fees (fee_id, student_id, amount, status) values (63, 63, 1102700, false);
insert into student_fees (fee_id, student_id, amount, status) values (64, 64, 1230497, true);
insert into student_fees (fee_id, student_id, amount, status) values (65, 65, 1372625, true);
insert into student_fees (fee_id, student_id, amount, status) values (66, 66, 1351259, false);
insert into student_fees (fee_id, student_id, amount, status) values (67, 67, 1286656, true);
insert into student_fees (fee_id, student_id, amount, status) values (68, 68, 1078328, true);
insert into student_fees (fee_id, student_id, amount, status) values (69, 69, 1474802, true);
insert into student_fees (fee_id, student_id, amount, status) values (70, 70, 1499950, true);
insert into student_fees (fee_id, student_id, amount, status) values (71, 71, 1298495, true);
insert into student_fees (fee_id, student_id, amount, status) values (72, 72, 1292634, false);
insert into student_fees (fee_id, student_id, amount, status) values (73, 73, 1457649, false);
insert into student_fees (fee_id, student_id, amount, status) values (74, 74, 1436407, true);
insert into student_fees (fee_id, student_id, amount, status) values (75, 75, 1433499, false);
insert into student_fees (fee_id, student_id, amount, status) values (76, 76, 1474674, true);
insert into student_fees (fee_id, student_id, amount, status) values (77, 77, 1214568, false);
insert into student_fees (fee_id, student_id, amount, status) values (78, 78, 1282526, true);
insert into student_fees (fee_id, student_id, amount, status) values (79, 79, 1378838, false);
insert into student_fees (fee_id, student_id, amount, status) values (80, 80, 1311122, true);
insert into student_fees (fee_id, student_id, amount, status) values (81, 81, 1159973, true);
insert into student_fees (fee_id, student_id, amount, status) values (82, 82, 1372488, true);
insert into student_fees (fee_id, student_id, amount, status) values (83, 83, 1386869, false);
insert into student_fees (fee_id, student_id, amount, status) values (84, 84, 1108818, true);
insert into student_fees (fee_id, student_id, amount, status) values (85, 85, 1384479, false);
insert into student_fees (fee_id, student_id, amount, status) values (86, 86, 1452431, true);
insert into student_fees (fee_id, student_id, amount, status) values (87, 87, 1379065, true);
insert into student_fees (fee_id, student_id, amount, status) values (88, 88, 1121770, true);
insert into student_fees (fee_id, student_id, amount, status) values (89, 89, 1479280, true);
insert into student_fees (fee_id, student_id, amount, status) values (90, 90, 1360382, true);
insert into student_fees (fee_id, student_id, amount, status) values (91, 91, 1376397, true);
insert into student_fees (fee_id, student_id, amount, status) values (92, 92, 1469287, false);
insert into student_fees (fee_id, student_id, amount, status) values (93, 93, 1287765, false);
insert into student_fees (fee_id, student_id, amount, status) values (94, 94, 1315190, false);
insert into student_fees (fee_id, student_id, amount, status) values (95, 95, 1214098, true);
insert into student_fees (fee_id, student_id, amount, status) values (96, 96, 1401195, true);
insert into student_fees (fee_id, student_id, amount, status) values (97, 97, 1383680, true);
insert into student_fees (fee_id, student_id, amount, status) values (98, 98, 1046808, false);
insert into student_fees (fee_id, student_id, amount, status) values (99, 99, 1428271, false);
insert into student_fees (fee_id, student_id, amount, status) values (100, 100, 1105516, true);
insert into student_fees (fee_id, student_id, amount, status) values (101, 101, 1294330, false);
insert into student_fees (fee_id, student_id, amount, status) values (102, 102, 1061801, true);
insert into student_fees (fee_id, student_id, amount, status) values (103, 103, 1149272, true);
insert into student_fees (fee_id, student_id, amount, status) values (104, 104, 1487481, true);
insert into student_fees (fee_id, student_id, amount, status) values (105, 105, 1142303, true);
insert into student_fees (fee_id, student_id, amount, status) values (106, 106, 1416720, true);
insert into student_fees (fee_id, student_id, amount, status) values (107, 107, 1478220, false);
insert into student_fees (fee_id, student_id, amount, status) values (108, 108, 1313134, true);
insert into student_fees (fee_id, student_id, amount, status) values (109, 109, 1080443, true);
insert into student_fees (fee_id, student_id, amount, status) values (110, 110, 1291547, false);
insert into student_fees (fee_id, student_id, amount, status) values (111, 111, 1252596, true);
insert into student_fees (fee_id, student_id, amount, status) values (112, 112, 1024366, true);
insert into student_fees (fee_id, student_id, amount, status) values (113, 113, 1120737, false);
insert into student_fees (fee_id, student_id, amount, status) values (114, 114, 1036102, true);
insert into student_fees (fee_id, student_id, amount, status) values (115, 115, 1027030, true);
insert into student_fees (fee_id, student_id, amount, status) values (116, 116, 1026932, false);
insert into student_fees (fee_id, student_id, amount, status) values (117, 117, 1473148, false);
insert into student_fees (fee_id, student_id, amount, status) values (118, 118, 1078938, false);
insert into student_fees (fee_id, student_id, amount, status) values (119, 119, 1046503, false);
insert into student_fees (fee_id, student_id, amount, status) values (120, 120, 1106572, false);
insert into student_fees (fee_id, student_id, amount, status) values (121, 121, 1013507, false);
insert into student_fees (fee_id, student_id, amount, status) values (122, 122, 1015003, false);
insert into student_fees (fee_id, student_id, amount, status) values (123, 123, 1018054, false);
insert into student_fees (fee_id, student_id, amount, status) values (124, 124, 1056485, false);
insert into student_fees (fee_id, student_id, amount, status) values (125, 125, 1152430, true);
insert into student_fees (fee_id, student_id, amount, status) values (126, 126, 1121683, true);
insert into student_fees (fee_id, student_id, amount, status) values (127, 127, 1480343, true);
insert into student_fees (fee_id, student_id, amount, status) values (128, 128, 1327642, true);
insert into student_fees (fee_id, student_id, amount, status) values (129, 129, 1348494, false);
insert into student_fees (fee_id, student_id, amount, status) values (130, 130, 1172430, false);
insert into student_fees (fee_id, student_id, amount, status) values (131, 131, 1274226, false);
insert into student_fees (fee_id, student_id, amount, status) values (132, 132, 1299355, true);
insert into student_fees (fee_id, student_id, amount, status) values (133, 133, 1397256, false);
insert into student_fees (fee_id, student_id, amount, status) values (134, 134, 1097399, false);
insert into student_fees (fee_id, student_id, amount, status) values (135, 135, 1395685, false);
insert into student_fees (fee_id, student_id, amount, status) values (136, 136, 1325793, true);
insert into student_fees (fee_id, student_id, amount, status) values (137, 137, 1131468, true);
insert into student_fees (fee_id, student_id, amount, status) values (138, 138, 1152774, true);
insert into student_fees (fee_id, student_id, amount, status) values (139, 139, 1154986, true);
insert into student_fees (fee_id, student_id, amount, status) values (140, 140, 1016137, false);
insert into student_fees (fee_id, student_id, amount, status) values (141, 141, 1408420, true);
insert into student_fees (fee_id, student_id, amount, status) values (142, 142, 1430307, true);
insert into student_fees (fee_id, student_id, amount, status) values (143, 143, 1022072, true);
insert into student_fees (fee_id, student_id, amount, status) values (144, 144, 1196212, false);
insert into student_fees (fee_id, student_id, amount, status) values (145, 145, 1371469, true);
insert into student_fees (fee_id, student_id, amount, status) values (146, 146, 1174839, false);
insert into student_fees (fee_id, student_id, amount, status) values (147, 147, 1426619, false);
insert into student_fees (fee_id, student_id, amount, status) values (148, 148, 1347234, false);
insert into student_fees (fee_id, student_id, amount, status) values (149, 149, 1340356, true);
insert into student_fees (fee_id, student_id, amount, status) values (150, 150, 1211744, true);
insert into student_fees (fee_id, student_id, amount, status) values (151, 151, 1161998, false);
insert into student_fees (fee_id, student_id, amount, status) values (152, 152, 1152980, false);
insert into student_fees (fee_id, student_id, amount, status) values (153, 153, 1400473, true);
insert into student_fees (fee_id, student_id, amount, status) values (154, 154, 1380269, true);
insert into student_fees (fee_id, student_id, amount, status) values (155, 155, 1228014, true);
insert into student_fees (fee_id, student_id, amount, status) values (156, 156, 1474371, false);
insert into student_fees (fee_id, student_id, amount, status) values (157, 157, 1120704, false);
insert into student_fees (fee_id, student_id, amount, status) values (158, 158, 1206714, false);
insert into student_fees (fee_id, student_id, amount, status) values (159, 159, 1382946, true);
insert into student_fees (fee_id, student_id, amount, status) values (160, 160, 1282055, false);
insert into student_fees (fee_id, student_id, amount, status) values (161, 161, 1273018, true);
insert into student_fees (fee_id, student_id, amount, status) values (162, 162, 1422077, true);
insert into student_fees (fee_id, student_id, amount, status) values (163, 163, 1109049, true);
insert into student_fees (fee_id, student_id, amount, status) values (164, 164, 1268058, false);
insert into student_fees (fee_id, student_id, amount, status) values (165, 165, 1280889, true);
insert into student_fees (fee_id, student_id, amount, status) values (166, 166, 1030759, true);
insert into student_fees (fee_id, student_id, amount, status) values (167, 167, 1177385, true);
insert into student_fees (fee_id, student_id, amount, status) values (168, 168, 1464371, false);
insert into student_fees (fee_id, student_id, amount, status) values (169, 169, 1229695, true);
insert into student_fees (fee_id, student_id, amount, status) values (170, 170, 1224713, true);
insert into student_fees (fee_id, student_id, amount, status) values (171, 171, 1321250, true);
insert into student_fees (fee_id, student_id, amount, status) values (172, 172, 1159806, false);
insert into student_fees (fee_id, student_id, amount, status) values (173, 173, 1091671, true);
insert into student_fees (fee_id, student_id, amount, status) values (174, 174, 1188841, true);
insert into student_fees (fee_id, student_id, amount, status) values (175, 175, 1475441, true);
insert into student_fees (fee_id, student_id, amount, status) values (176, 176, 1113401, false);
insert into student_fees (fee_id, student_id, amount, status) values (177, 177, 1461681, true);
insert into student_fees (fee_id, student_id, amount, status) values (178, 178, 1292997, false);
insert into student_fees (fee_id, student_id, amount, status) values (179, 179, 1256480, true);
insert into student_fees (fee_id, student_id, amount, status) values (180, 180, 1490621, true);
insert into student_fees (fee_id, student_id, amount, status) values (181, 181, 1454336, false);
insert into student_fees (fee_id, student_id, amount, status) values (182, 182, 1223004, true);
insert into student_fees (fee_id, student_id, amount, status) values (183, 183, 1468268, true);
insert into student_fees (fee_id, student_id, amount, status) values (184, 184, 1202957, false);
insert into student_fees (fee_id, student_id, amount, status) values (185, 185, 1328927, true);
insert into student_fees (fee_id, student_id, amount, status) values (186, 186, 1241846, true);
insert into student_fees (fee_id, student_id, amount, status) values (187, 187, 1058189, true);
insert into student_fees (fee_id, student_id, amount, status) values (188, 188, 1311334, false);
insert into student_fees (fee_id, student_id, amount, status) values (189, 189, 1070461, true);
insert into student_fees (fee_id, student_id, amount, status) values (190, 190, 1213360, true);
insert into student_fees (fee_id, student_id, amount, status) values (191, 191, 1015487, false);
insert into student_fees (fee_id, student_id, amount, status) values (192, 192, 1378053, true);
insert into student_fees (fee_id, student_id, amount, status) values (193, 193, 1382335, false);
insert into student_fees (fee_id, student_id, amount, status) values (194, 194, 1042176, false);
insert into student_fees (fee_id, student_id, amount, status) values (195, 195, 1337321, false);
insert into student_fees (fee_id, student_id, amount, status) values (196, 196, 1065739, true);
insert into student_fees (fee_id, student_id, amount, status) values (197, 197, 1175229, false);
insert into student_fees (fee_id, student_id, amount, status) values (198, 198, 1322663, false);
insert into student_fees (fee_id, student_id, amount, status) values (199, 199, 1074488, true);
insert into student_fees (fee_id, student_id, amount, status) values (200, 200, 1328409, false);
insert into student_fees (fee_id, student_id, amount, status) values (201, 201, 1428868, true);
insert into student_fees (fee_id, student_id, amount, status) values (202, 202, 1333912, true);
insert into student_fees (fee_id, student_id, amount, status) values (203, 203, 1227797, false);
insert into student_fees (fee_id, student_id, amount, status) values (204, 204, 1490536, false);
insert into student_fees (fee_id, student_id, amount, status) values (205, 205, 1077571, true);
insert into student_fees (fee_id, student_id, amount, status) values (206, 206, 1167533, true);
insert into student_fees (fee_id, student_id, amount, status) values (207, 207, 1315355, false);
insert into student_fees (fee_id, student_id, amount, status) values (208, 208, 1444526, true);
insert into student_fees (fee_id, student_id, amount, status) values (209, 209, 1430344, false);
insert into student_fees (fee_id, student_id, amount, status) values (210, 210, 1030195, true);
insert into student_fees (fee_id, student_id, amount, status) values (211, 211, 1372569, true);
insert into student_fees (fee_id, student_id, amount, status) values (212, 212, 1438311, false);
insert into student_fees (fee_id, student_id, amount, status) values (213, 213, 1491168, false);
insert into student_fees (fee_id, student_id, amount, status) values (214, 214, 1316573, false);
insert into student_fees (fee_id, student_id, amount, status) values (215, 215, 1267586, false);
insert into student_fees (fee_id, student_id, amount, status) values (216, 216, 1406268, true);
insert into student_fees (fee_id, student_id, amount, status) values (217, 217, 1013088, true);
insert into student_fees (fee_id, student_id, amount, status) values (218, 218, 1276808, true);
insert into student_fees (fee_id, student_id, amount, status) values (219, 219, 1409462, true);
insert into student_fees (fee_id, student_id, amount, status) values (220, 220, 1133205, false);
insert into student_fees (fee_id, student_id, amount, status) values (221, 221, 1474693, false);
insert into student_fees (fee_id, student_id, amount, status) values (222, 222, 1169391, true);
insert into student_fees (fee_id, student_id, amount, status) values (223, 223, 1308636, false);
insert into student_fees (fee_id, student_id, amount, status) values (224, 224, 1107047, false);
insert into student_fees (fee_id, student_id, amount, status) values (225, 225, 1398534, true);
insert into student_fees (fee_id, student_id, amount, status) values (226, 226, 1159521, true);
insert into student_fees (fee_id, student_id, amount, status) values (227, 227, 1002196, true);
insert into student_fees (fee_id, student_id, amount, status) values (228, 228, 1266894, true);
insert into student_fees (fee_id, student_id, amount, status) values (229, 229, 1398067, true);
insert into student_fees (fee_id, student_id, amount, status) values (230, 230, 1415235, false);
insert into student_fees (fee_id, student_id, amount, status) values (231, 231, 1128216, true);
insert into student_fees (fee_id, student_id, amount, status) values (232, 232, 1469977, true);
insert into student_fees (fee_id, student_id, amount, status) values (233, 233, 1143397, false);
insert into student_fees (fee_id, student_id, amount, status) values (234, 234, 1180212, true);
insert into student_fees (fee_id, student_id, amount, status) values (235, 235, 1160985, true);
insert into student_fees (fee_id, student_id, amount, status) values (236, 236, 1333533, true);
insert into student_fees (fee_id, student_id, amount, status) values (237, 237, 1385617, true);
insert into student_fees (fee_id, student_id, amount, status) values (238, 238, 1439341, true);
insert into student_fees (fee_id, student_id, amount, status) values (239, 239, 1206110, true);
insert into student_fees (fee_id, student_id, amount, status) values (240, 240, 1111185, false);
insert into student_fees (fee_id, student_id, amount, status) values (241, 241, 1358951, true);
insert into student_fees (fee_id, student_id, amount, status) values (242, 242, 1400017, false);
insert into student_fees (fee_id, student_id, amount, status) values (243, 243, 1142990, true);
insert into student_fees (fee_id, student_id, amount, status) values (244, 244, 1067634, true);
insert into student_fees (fee_id, student_id, amount, status) values (245, 245, 1069723, false);
insert into student_fees (fee_id, student_id, amount, status) values (246, 246, 1435471, true);
insert into student_fees (fee_id, student_id, amount, status) values (247, 247, 1018999, false);
insert into student_fees (fee_id, student_id, amount, status) values (248, 248, 1265827, true);
insert into student_fees (fee_id, student_id, amount, status) values (249, 249, 1456599, true);
insert into student_fees (fee_id, student_id, amount, status) values (250, 250, 1312852, false);

--сделано
insert into library (recourse_id, title, checkout_date, due_date) values (1, 'Volkswagen', '2023-08-10', '2023-09-03');
insert into library (recourse_id, title, checkout_date, due_date) values (2, 'GMC', '2023-11-01', '2024-02-12');
insert into library (recourse_id, title, checkout_date, due_date) values (3, 'Chevrolet', '2023-07-16', '2023-09-23');
insert into library (recourse_id, title, checkout_date, due_date) values (4, 'Mercedes-Benz', '2023-08-18', '2023-10-01');
insert into library (recourse_id, title, checkout_date, due_date) values (5, 'GMC', '2023-09-06', '2023-09-08');
insert into library (recourse_id, title, checkout_date, due_date) values (6, 'Subaru', '2023-09-29', '2024-01-21');
insert into library (recourse_id, title, checkout_date, due_date) values (7, 'Buick', '2023-10-22', '2024-02-24');
insert into library (recourse_id, title, checkout_date, due_date) values (8, 'Maserati', '2023-06-16', '2023-09-28');
insert into library (recourse_id, title, checkout_date, due_date) values (9, 'Toyota', '2023-04-03', '2023-10-21');
insert into library (recourse_id, title, checkout_date, due_date) values (10, 'Nissan', '2023-09-29', '2024-02-24');

--сделано
insert into health_services (service_id, student_id, visit_date, duration) values (1, 90, '2023-11-24', 91);
insert into health_services (service_id, student_id, visit_date, duration) values (2, 173, '2023-11-03', 117);
insert into health_services (service_id, student_id, visit_date, duration) values (3, 67, '2023-09-29', 85);
insert into health_services (service_id, student_id, visit_date, duration) values (4, 14, '2023-09-11', 96);
insert into health_services (service_id, student_id, visit_date, duration) values (5, 224, '2023-10-10', 77);
insert into health_services (service_id, student_id, visit_date, duration) values (6, 153, '2023-11-05', 32);
insert into health_services (service_id, student_id, visit_date, duration) values (7, 224, '2023-09-19', 31);
insert into health_services (service_id, student_id, visit_date, duration) values (8, 3, '2023-11-20', 34);
insert into health_services (service_id, student_id, visit_date, duration) values (9, 23, '2023-10-10', 108);
insert into health_services (service_id, student_id, visit_date, duration) values (10, 218, '2023-11-15', 97);
insert into health_services (service_id, student_id, visit_date, duration) values (11, 40, '2023-09-02', 97);
insert into health_services (service_id, student_id, visit_date, duration) values (12, 126, '2023-12-02', 86);
insert into health_services (service_id, student_id, visit_date, duration) values (13, 48, '2023-09-15', 100);
insert into health_services (service_id, student_id, visit_date, duration) values (14, 160, '2023-09-22', 119);
insert into health_services (service_id, student_id, visit_date, duration) values (15, 148, '2023-11-19', 39);
insert into health_services (service_id, student_id, visit_date, duration) values (16, 183, '2023-10-16', 106);
insert into health_services (service_id, student_id, visit_date, duration) values (17, 8, '2023-10-19', 115);
insert into health_services (service_id, student_id, visit_date, duration) values (18, 241, '2023-10-31', 40);
insert into health_services (service_id, student_id, visit_date, duration) values (19, 160, '2023-11-23', 119);
insert into health_services (service_id, student_id, visit_date, duration) values (20, 40, '2023-09-08', 71);
insert into health_services (service_id, student_id, visit_date, duration) values (21, 100, '2023-09-08', 106);
insert into health_services (service_id, student_id, visit_date, duration) values (22, 27, '2023-09-07', 103);
insert into health_services (service_id, student_id, visit_date, duration) values (23, 84, '2023-10-07', 111);
insert into health_services (service_id, student_id, visit_date, duration) values (24, 158, '2023-09-16', 67);
insert into health_services (service_id, student_id, visit_date, duration) values (25, 53, '2023-09-14', 53);
insert into health_services (service_id, student_id, visit_date, duration) values (26, 91, '2023-10-29', 45);
insert into health_services (service_id, student_id, visit_date, duration) values (27, 166, '2023-11-11', 94);
insert into health_services (service_id, student_id, visit_date, duration) values (28, 85, '2023-09-01', 41);
insert into health_services (service_id, student_id, visit_date, duration) values (29, 1, '2023-11-08', 56);
insert into health_services (service_id, student_id, visit_date, duration) values (30, 2, '2023-10-06', 120);
insert into health_services (service_id, student_id, visit_date, duration) values (31, 93, '2023-10-04', 31);
insert into health_services (service_id, student_id, visit_date, duration) values (32, 146, '2023-11-16', 67);
insert into health_services (service_id, student_id, visit_date, duration) values (33, 117, '2023-10-04', 75);
insert into health_services (service_id, student_id, visit_date, duration) values (34, 128, '2023-10-05', 65);
insert into health_services (service_id, student_id, visit_date, duration) values (35, 166, '2023-09-11', 99);
insert into health_services (service_id, student_id, visit_date, duration) values (36, 161, '2023-11-10', 34);
insert into health_services (service_id, student_id, visit_date, duration) values (37, 164, '2023-09-15', 89);
insert into health_services (service_id, student_id, visit_date, duration) values (38, 1, '2023-11-09', 105);
insert into health_services (service_id, student_id, visit_date, duration) values (39, 97, '2023-10-30', 102);
insert into health_services (service_id, student_id, visit_date, duration) values (40, 61, '2023-10-27', 113);
insert into health_services (service_id, student_id, visit_date, duration) values (41, 34, '2023-09-03', 73);
insert into health_services (service_id, student_id, visit_date, duration) values (42, 195, '2023-10-25', 55);
insert into health_services (service_id, student_id, visit_date, duration) values (43, 9, '2023-09-08', 106);
insert into health_services (service_id, student_id, visit_date, duration) values (44, 56, '2023-09-30', 120);
insert into health_services (service_id, student_id, visit_date, duration) values (45, 62, '2023-11-24', 102);
insert into health_services (service_id, student_id, visit_date, duration) values (46, 213, '2023-09-11', 49);
insert into health_services (service_id, student_id, visit_date, duration) values (47, 95, '2023-10-15', 81);
insert into health_services (service_id, student_id, visit_date, duration) values (48, 33, '2023-10-11', 56);
insert into health_services (service_id, student_id, visit_date, duration) values (49, 181, '2023-10-07', 104);
insert into health_services (service_id, student_id, visit_date, duration) values (50, 192, '2023-09-14', 54);
insert into health_services (service_id, student_id, visit_date, duration) values (51, 79, '2023-09-28', 107);
insert into health_services (service_id, student_id, visit_date, duration) values (52, 17, '2023-11-02', 84);
insert into health_services (service_id, student_id, visit_date, duration) values (53, 170, '2023-09-30', 35);
insert into health_services (service_id, student_id, visit_date, duration) values (54, 68, '2023-12-02', 85);
insert into health_services (service_id, student_id, visit_date, duration) values (55, 7, '2023-11-07', 88);
insert into health_services (service_id, student_id, visit_date, duration) values (56, 108, '2023-11-05', 76);
insert into health_services (service_id, student_id, visit_date, duration) values (57, 88, '2023-11-14', 90);
insert into health_services (service_id, student_id, visit_date, duration) values (58, 241, '2023-11-26', 94);
insert into health_services (service_id, student_id, visit_date, duration) values (59, 81, '2023-11-25', 114);
insert into health_services (service_id, student_id, visit_date, duration) values (60, 144, '2023-11-02', 73);
insert into health_services (service_id, student_id, visit_date, duration) values (61, 193, '2023-11-23', 38);
insert into health_services (service_id, student_id, visit_date, duration) values (62, 96, '2023-09-12', 34);
insert into health_services (service_id, student_id, visit_date, duration) values (63, 63, '2023-09-20', 106);
insert into health_services (service_id, student_id, visit_date, duration) values (64, 160, '2023-10-19', 54);
insert into health_services (service_id, student_id, visit_date, duration) values (65, 3, '2023-11-16', 43);
insert into health_services (service_id, student_id, visit_date, duration) values (66, 6, '2023-10-27', 102);
insert into health_services (service_id, student_id, visit_date, duration) values (67, 115, '2023-09-19', 70);
insert into health_services (service_id, student_id, visit_date, duration) values (68, 116, '2023-10-11', 85);
insert into health_services (service_id, student_id, visit_date, duration) values (69, 181, '2023-09-15', 93);
insert into health_services (service_id, student_id, visit_date, duration) values (70, 43, '2023-10-24', 118);
insert into health_services (service_id, student_id, visit_date, duration) values (71, 232, '2023-10-03', 102);
insert into health_services (service_id, student_id, visit_date, duration) values (72, 62, '2023-10-09', 108);
insert into health_services (service_id, student_id, visit_date, duration) values (73, 70, '2023-10-07', 77);
insert into health_services (service_id, student_id, visit_date, duration) values (74, 197, '2023-11-25', 76);
insert into health_services (service_id, student_id, visit_date, duration) values (75, 122, '2023-10-12', 83);
insert into health_services (service_id, student_id, visit_date, duration) values (76, 205, '2023-09-09', 90);
insert into health_services (service_id, student_id, visit_date, duration) values (77, 237, '2023-11-20', 113);
insert into health_services (service_id, student_id, visit_date, duration) values (78, 88, '2023-09-16', 112);
insert into health_services (service_id, student_id, visit_date, duration) values (79, 100, '2023-11-26', 100);
insert into health_services (service_id, student_id, visit_date, duration) values (80, 200, '2023-11-08', 120);
insert into health_services (service_id, student_id, visit_date, duration) values (81, 233, '2023-11-15', 40);
insert into health_services (service_id, student_id, visit_date, duration) values (82, 213, '2023-09-17', 51);
insert into health_services (service_id, student_id, visit_date, duration) values (83, 186, '2023-10-14', 105);
insert into health_services (service_id, student_id, visit_date, duration) values (84, 30, '2023-11-16', 100);
insert into health_services (service_id, student_id, visit_date, duration) values (85, 179, '2023-11-08', 31);
insert into health_services (service_id, student_id, visit_date, duration) values (86, 6, '2023-11-26', 110);
insert into health_services (service_id, student_id, visit_date, duration) values (87, 233, '2023-10-20', 88);
insert into health_services (service_id, student_id, visit_date, duration) values (88, 123, '2023-09-29', 104);
insert into health_services (service_id, student_id, visit_date, duration) values (89, 81, '2023-09-15', 113);
insert into health_services (service_id, student_id, visit_date, duration) values (90, 121, '2023-10-31', 30);
insert into health_services (service_id, student_id, visit_date, duration) values (91, 95, '2023-10-31', 86);
insert into health_services (service_id, student_id, visit_date, duration) values (92, 191, '2023-09-01', 55);
insert into health_services (service_id, student_id, visit_date, duration) values (93, 59, '2023-10-01', 61);
insert into health_services (service_id, student_id, visit_date, duration) values (94, 135, '2023-09-27', 60);
insert into health_services (service_id, student_id, visit_date, duration) values (95, 115, '2023-11-01', 85);
insert into health_services (service_id, student_id, visit_date, duration) values (96, 221, '2023-11-12', 77);
insert into health_services (service_id, student_id, visit_date, duration) values (97, 2, '2023-10-28', 46);
insert into health_services (service_id, student_id, visit_date, duration) values (98, 71, '2023-10-06', 75);
insert into health_services (service_id, student_id, visit_date, duration) values (99, 140, '2023-10-21', 52);
insert into health_services (service_id, student_id, visit_date, duration) values (100, 149, '2023-10-19', 114);

--сделано
insert into student_achievements (achievement_id, student_id, achievements) values (1, 195, 'Embedded SQL');
insert into student_achievements (achievement_id, student_id, achievements) values (2, 184, 'Sony HDV');
insert into student_achievements (achievement_id, student_id, achievements) values (3, 172, 'Gyrotonic');
insert into student_achievements (achievement_id, student_id, achievements) values (4, 93, 'OEIC');
insert into student_achievements (achievement_id, student_id, achievements) values (5, 191, 'RSVP');
insert into student_achievements (achievement_id, student_id, achievements) values (6, 233, 'UF/DF');
insert into student_achievements (achievement_id, student_id, achievements) values (7, 130, 'ZeroMQ');
insert into student_achievements (achievement_id, student_id, achievements) values (8, 158, 'PGP');
insert into student_achievements (achievement_id, student_id, achievements) values (9, 143, 'BSR Advance');
insert into student_achievements (achievement_id, student_id, achievements) values (10, 184, 'Ionic Liquids');
insert into student_achievements (achievement_id, student_id, achievements) values (11, 13, 'Knowledge Representation');
insert into student_achievements (achievement_id, student_id, achievements) values (12, 121, 'MXG');
insert into student_achievements (achievement_id, student_id, achievements) values (13, 224, 'QPSK');
insert into student_achievements (achievement_id, student_id, achievements) values (14, 35, 'International Real Estate');
insert into student_achievements (achievement_id, student_id, achievements) values (15, 103, 'WAN');
insert into student_achievements (achievement_id, student_id, achievements) values (16, 140, 'Home Equity Loans');
insert into student_achievements (achievement_id, student_id, achievements) values (17, 149, 'Strategic Planning');
insert into student_achievements (achievement_id, student_id, achievements) values (18, 54, 'NYSE');
insert into student_achievements (achievement_id, student_id, achievements) values (19, 164, 'CMMS');
insert into student_achievements (achievement_id, student_id, achievements) values (20, 56, 'IVR');
insert into student_achievements (achievement_id, student_id, achievements) values (21, 189, 'PVTsim');
insert into student_achievements (achievement_id, student_id, achievements) values (22, 28, 'CTAs');
insert into student_achievements (achievement_id, student_id, achievements) values (23, 121, 'Smart GWT');
insert into student_achievements (achievement_id, student_id, achievements) values (24, 7, 'ELISA');
insert into student_achievements (achievement_id, student_id, achievements) values (25, 196, 'Demand Generation');
insert into student_achievements (achievement_id, student_id, achievements) values (26, 113, 'Nutritional Counseling');
insert into student_achievements (achievement_id, student_id, achievements) values (27, 42, 'TSCA');
insert into student_achievements (achievement_id, student_id, achievements) values (28, 27, 'CCIE R&amp;S');
insert into student_achievements (achievement_id, student_id, achievements) values (29, 246, 'TLC');
insert into student_achievements (achievement_id, student_id, achievements) values (30, 24, 'Russian');
insert into student_achievements (achievement_id, student_id, achievements) values (31, 223, 'JAX-RPC');
insert into student_achievements (achievement_id, student_id, achievements) values (32, 224, 'KPI Implementation');
insert into student_achievements (achievement_id, student_id, achievements) values (33, 143, 'Wastewater Treatment');
insert into student_achievements (achievement_id, student_id, achievements) values (34, 229, 'Prototype.js');
insert into student_achievements (achievement_id, student_id, achievements) values (35, 183, 'MHP');
insert into student_achievements (achievement_id, student_id, achievements) values (36, 167, 'Portraits');
insert into student_achievements (achievement_id, student_id, achievements) values (37, 183, 'Kurdish');
insert into student_achievements (achievement_id, student_id, achievements) values (38, 52, 'JSON');
insert into student_achievements (achievement_id, student_id, achievements) values (39, 14, 'UIX');
insert into student_achievements (achievement_id, student_id, achievements) values (40, 196, 'Geological Mapping');
insert into student_achievements (achievement_id, student_id, achievements) values (41, 40, 'Flexo');
insert into student_achievements (achievement_id, student_id, achievements) values (42, 93, 'SFI');
insert into student_achievements (achievement_id, student_id, achievements) values (43, 169, 'Offshoring');
insert into student_achievements (achievement_id, student_id, achievements) values (44, 8, 'Food Quality');
insert into student_achievements (achievement_id, student_id, achievements) values (45, 199, 'Executive Management');
insert into student_achievements (achievement_id, student_id, achievements) values (46, 100, 'TWS');
insert into student_achievements (achievement_id, student_id, achievements) values (47, 183, 'Wyse');
insert into student_achievements (achievement_id, student_id, achievements) values (48, 58, 'RTI');
insert into student_achievements (achievement_id, student_id, achievements) values (49, 249, 'TCP');
insert into student_achievements (achievement_id, student_id, achievements) values (50, 140, 'VLAN');
insert into student_achievements (achievement_id, student_id, achievements) values (51, 163, 'DDoS');
insert into student_achievements (achievement_id, student_id, achievements) values (52, 223, 'Mobile Games');
insert into student_achievements (achievement_id, student_id, achievements) values (53, 102, 'Overcome Objections');
insert into student_achievements (achievement_id, student_id, achievements) values (54, 131, 'Data Structures');
insert into student_achievements (achievement_id, student_id, achievements) values (55, 148, 'Hair Care');
insert into student_achievements (achievement_id, student_id, achievements) values (56, 24, 'TVCs');
insert into student_achievements (achievement_id, student_id, achievements) values (57, 218, 'UML');
insert into student_achievements (achievement_id, student_id, achievements) values (58, 169, 'CTRM');
insert into student_achievements (achievement_id, student_id, achievements) values (59, 158, 'Green Belt');
insert into student_achievements (achievement_id, student_id, achievements) values (60, 99, 'OOP');
insert into student_achievements (achievement_id, student_id, achievements) values (61, 118, 'ATR-FTIR');
insert into student_achievements (achievement_id, student_id, achievements) values (62, 234, 'Xactly');
insert into student_achievements (achievement_id, student_id, achievements) values (63, 97, 'Bluetooth');
insert into student_achievements (achievement_id, student_id, achievements) values (64, 191, 'PIX');
insert into student_achievements (achievement_id, student_id, achievements) values (65, 113, 'GDS systems');
insert into student_achievements (achievement_id, student_id, achievements) values (66, 161, 'Railway');
insert into student_achievements (achievement_id, student_id, achievements) values (67, 95, 'HCS 2000');
insert into student_achievements (achievement_id, student_id, achievements) values (68, 76, 'Defect Life Cycle');
insert into student_achievements (achievement_id, student_id, achievements) values (69, 131, 'LEED AP');
insert into student_achievements (achievement_id, student_id, achievements) values (70, 159, 'WBS');
insert into student_achievements (achievement_id, student_id, achievements) values (71, 184, 'GFAAS');
insert into student_achievements (achievement_id, student_id, achievements) values (72, 171, 'Vital Signs');
insert into student_achievements (achievement_id, student_id, achievements) values (73, 161, 'UPS Shipping');
insert into student_achievements (achievement_id, student_id, achievements) values (74, 246, 'RTK');
insert into student_achievements (achievement_id, student_id, achievements) values (75, 174, 'BSSAP');
insert into student_achievements (achievement_id, student_id, achievements) values (76, 141, 'CDM Co-ordinator');
insert into student_achievements (achievement_id, student_id, achievements) values (77, 210, 'RSS');
insert into student_achievements (achievement_id, student_id, achievements) values (78, 112, 'Social Services');
insert into student_achievements (achievement_id, student_id, achievements) values (79, 81, 'NVU');
insert into student_achievements (achievement_id, student_id, achievements) values (80, 227, 'Dell KACE');
insert into student_achievements (achievement_id, student_id, achievements) values (81, 91, 'Management');
insert into student_achievements (achievement_id, student_id, achievements) values (82, 199, 'Equity Capital Markets');
insert into student_achievements (achievement_id, student_id, achievements) values (83, 8, 'High Availability Clustering');
insert into student_achievements (achievement_id, student_id, achievements) values (84, 78, 'NI Multisim');
insert into student_achievements (achievement_id, student_id, achievements) values (85, 56, 'Yields');
insert into student_achievements (achievement_id, student_id, achievements) values (86, 188, 'Nutritional Counseling');
insert into student_achievements (achievement_id, student_id, achievements) values (87, 237, 'DCM');
insert into student_achievements (achievement_id, student_id, achievements) values (88, 187, 'NRSWA');
insert into student_achievements (achievement_id, student_id, achievements) values (89, 243, 'Change Management');
insert into student_achievements (achievement_id, student_id, achievements) values (90, 182, 'Enterprise Risk Management');
insert into student_achievements (achievement_id, student_id, achievements) values (91, 35, 'Product Management');
insert into student_achievements (achievement_id, student_id, achievements) values (92, 91, 'XaaS');
insert into student_achievements (achievement_id, student_id, achievements) values (93, 51, 'XenClient');
insert into student_achievements (achievement_id, student_id, achievements) values (94, 238, 'Microsoft Exchange');
insert into student_achievements (achievement_id, student_id, achievements) values (95, 9, 'WSPG');
insert into student_achievements (achievement_id, student_id, achievements) values (96, 34, 'Alternative Investments');
insert into student_achievements (achievement_id, student_id, achievements) values (97, 91, 'Rhinoplasty');
insert into student_achievements (achievement_id, student_id, achievements) values (98, 244, 'PDM');
insert into student_achievements (achievement_id, student_id, achievements) values (99, 50, 'Water Features');
insert into student_achievements (achievement_id, student_id, achievements) values (100, 118, 'DL1');

--сделано
insert into internships (intership_id, student_id, company, start_date, end_date) values (1, 130, 'Flashdog', '2023-06-29', '2023-10-07');
insert into internships (intership_id, student_id, company, start_date, end_date) values (2, 33, 'Edgepulse', '2023-06-07', '2023-08-17');
insert into internships (intership_id, student_id, company, start_date, end_date) values (3, 70, 'Bubblebox', '2023-06-26', '2023-10-22');
insert into internships (intership_id, student_id, company, start_date, end_date) values (4, 45, 'Rooxo', '2023-06-16', '2023-10-22');
insert into internships (intership_id, student_id, company, start_date, end_date) values (5, 41, 'Babbleset', '2023-06-02', '2023-09-11');
insert into internships (intership_id, student_id, company, start_date, end_date) values (6, 239, 'Fivespan', '2023-06-17', '2023-10-11');
insert into internships (intership_id, student_id, company, start_date, end_date) values (7, 197, 'Oloo', '2023-06-26', '2023-11-09');
insert into internships (intership_id, student_id, company, start_date, end_date) values (8, 34, 'Skinix', '2023-06-28', '2023-09-29');
insert into internships (intership_id, student_id, company, start_date, end_date) values (9, 181, 'Thoughtblab', '2023-06-28', '2023-10-07');
insert into internships (intership_id, student_id, company, start_date, end_date) values (10, 60, 'Feedspan', '2023-06-16', '2023-11-28');
insert into internships (intership_id, student_id, company, start_date, end_date) values (11, 68, 'Livetube', '2023-06-05', '2023-11-12');
insert into internships (intership_id, student_id, company, start_date, end_date) values (12, 77, 'Wordware', '2023-06-16', '2023-11-05');
insert into internships (intership_id, student_id, company, start_date, end_date) values (13, 122, 'Youbridge', '2023-06-12', '2023-10-29');
insert into internships (intership_id, student_id, company, start_date, end_date) values (14, 128, 'Zoombox', '2023-06-12', '2023-09-08');
insert into internships (intership_id, student_id, company, start_date, end_date) values (15, 6, 'Yakitri', '2023-06-04', '2023-09-03');
insert into internships (intership_id, student_id, company, start_date, end_date) values (16, 167, 'InnoZ', '2023-06-20', '2023-11-04');
insert into internships (intership_id, student_id, company, start_date, end_date) values (17, 35, 'Feedmix', '2023-06-06', '2023-09-10');
insert into internships (intership_id, student_id, company, start_date, end_date) values (18, 176, 'Youbridge', '2023-06-18', '2023-11-19');
insert into internships (intership_id, student_id, company, start_date, end_date) values (19, 12, 'Skibox', '2023-06-20', '2023-10-28');
insert into internships (intership_id, student_id, company, start_date, end_date) values (20, 125, 'Skyble', '2023-06-10', '2023-09-09');
insert into internships (intership_id, student_id, company, start_date, end_date) values (21, 121, 'Topiclounge', '2023-06-17', '2023-09-18');
insert into internships (intership_id, student_id, company, start_date, end_date) values (22, 60, 'Flashset', '2023-06-26', '2023-11-03');
insert into internships (intership_id, student_id, company, start_date, end_date) values (23, 240, 'Voonyx', '2023-06-28', '2023-10-21');
insert into internships (intership_id, student_id, company, start_date, end_date) values (24, 53, 'Skidoo', '2023-06-20', '2023-08-12');
insert into internships (intership_id, student_id, company, start_date, end_date) values (25, 108, 'Avaveo', '2023-06-23', '2023-11-20');
insert into internships (intership_id, student_id, company, start_date, end_date) values (26, 196, 'Pixope', '2023-06-10', '2023-10-07');
insert into internships (intership_id, student_id, company, start_date, end_date) values (27, 9, 'Eadel', '2023-06-18', '2023-09-20');
insert into internships (intership_id, student_id, company, start_date, end_date) values (28, 52, 'Mynte', '2023-06-07', '2023-11-10');
insert into internships (intership_id, student_id, company, start_date, end_date) values (29, 119, 'Zoovu', '2023-06-21', '2023-11-13');
insert into internships (intership_id, student_id, company, start_date, end_date) values (30, 137, 'Abatz', '2023-06-29', '2023-11-29');
insert into internships (intership_id, student_id, company, start_date, end_date) values (31, 53, 'Tazzy', '2023-06-02', '2023-09-04');
insert into internships (intership_id, student_id, company, start_date, end_date) values (32, 11, 'Twinte', '2023-06-12', '2023-08-14');
insert into internships (intership_id, student_id, company, start_date, end_date) values (33, 213, 'Yambee', '2023-06-05', '2023-11-29');
insert into internships (intership_id, student_id, company, start_date, end_date) values (34, 86, 'Feednation', '2023-06-01', '2023-08-25');
insert into internships (intership_id, student_id, company, start_date, end_date) values (35, 134, 'Vitz', '2023-06-23', '2023-11-07');
insert into internships (intership_id, student_id, company, start_date, end_date) values (36, 132, 'Lazz', '2023-06-11', '2023-08-24');
insert into internships (intership_id, student_id, company, start_date, end_date) values (37, 157, 'Livefish', '2023-06-14', '2023-11-10');
insert into internships (intership_id, student_id, company, start_date, end_date) values (38, 71, 'Latz', '2023-06-11', '2023-11-27');
insert into internships (intership_id, student_id, company, start_date, end_date) values (39, 130, 'Ooba', '2023-06-18', '2023-08-03');
insert into internships (intership_id, student_id, company, start_date, end_date) values (40, 244, 'Leenti', '2023-06-28', '2023-08-01');
insert into internships (intership_id, student_id, company, start_date, end_date) values (41, 54, 'Realblab', '2023-06-03', '2023-08-15');
insert into internships (intership_id, student_id, company, start_date, end_date) values (42, 155, 'Lazzy', '2023-06-12', '2023-09-13');
insert into internships (intership_id, student_id, company, start_date, end_date) values (43, 236, 'Tavu', '2023-06-24', '2023-10-20');
insert into internships (intership_id, student_id, company, start_date, end_date) values (44, 204, 'Gabtype', '2023-06-01', '2023-11-11');
insert into internships (intership_id, student_id, company, start_date, end_date) values (45, 86, 'Voonyx', '2023-06-28', '2023-09-13');
insert into internships (intership_id, student_id, company, start_date, end_date) values (46, 246, 'Flipopia', '2023-06-12', '2023-11-21');
insert into internships (intership_id, student_id, company, start_date, end_date) values (47, 145, 'Browsebug', '2023-06-01', '2023-08-17');
insert into internships (intership_id, student_id, company, start_date, end_date) values (48, 139, 'Voolia', '2023-06-04', '2023-11-22');
insert into internships (intership_id, student_id, company, start_date, end_date) values (49, 177, 'Janyx', '2023-06-13', '2023-09-17');
insert into internships (intership_id, student_id, company, start_date, end_date) values (50, 143, 'Jabbersphere', '2023-06-21', '2023-10-06');
insert into internships (intership_id, student_id, company, start_date, end_date) values (51, 155, 'Buzzdog', '2023-06-10', '2023-10-20');
insert into internships (intership_id, student_id, company, start_date, end_date) values (52, 190, 'Devpulse', '2023-06-25', '2023-09-14');
insert into internships (intership_id, student_id, company, start_date, end_date) values (53, 221, 'Leenti', '2023-06-06', '2023-08-01');
insert into internships (intership_id, student_id, company, start_date, end_date) values (54, 244, 'Rhynyx', '2023-06-24', '2023-09-11');
insert into internships (intership_id, student_id, company, start_date, end_date) values (55, 10, 'Twitterbridge', '2023-06-20', '2023-10-14');
insert into internships (intership_id, student_id, company, start_date, end_date) values (56, 131, 'Bluezoom', '2023-06-23', '2023-10-01');
insert into internships (intership_id, student_id, company, start_date, end_date) values (57, 124, 'Jetpulse', '2023-06-27', '2023-10-05');
insert into internships (intership_id, student_id, company, start_date, end_date) values (58, 194, 'Flipbug', '2023-06-29', '2023-08-16');
insert into internships (intership_id, student_id, company, start_date, end_date) values (59, 33, 'JumpXS', '2023-06-14', '2023-11-24');
insert into internships (intership_id, student_id, company, start_date, end_date) values (60, 20, 'Mudo', '2023-06-03', '2023-08-31');
insert into internships (intership_id, student_id, company, start_date, end_date) values (61, 21, 'Dabjam', '2023-06-08', '2023-08-23');
insert into internships (intership_id, student_id, company, start_date, end_date) values (62, 217, 'Fivespan', '2023-06-20', '2023-11-10');
insert into internships (intership_id, student_id, company, start_date, end_date) values (63, 48, 'Linkbridge', '2023-06-18', '2023-08-18');
insert into internships (intership_id, student_id, company, start_date, end_date) values (64, 248, 'Blognation', '2023-06-21', '2023-11-08');
insert into internships (intership_id, student_id, company, start_date, end_date) values (65, 163, 'Shuffledrive', '2023-06-17', '2023-10-21');
insert into internships (intership_id, student_id, company, start_date, end_date) values (66, 80, 'Aibox', '2023-06-14', '2023-11-23');
insert into internships (intership_id, student_id, company, start_date, end_date) values (67, 196, 'Quatz', '2023-06-03', '2023-08-22');
insert into internships (intership_id, student_id, company, start_date, end_date) values (68, 17, 'Tagcat', '2023-06-11', '2023-10-30');
insert into internships (intership_id, student_id, company, start_date, end_date) values (69, 27, 'Aibox', '2023-06-10', '2023-10-25');
insert into internships (intership_id, student_id, company, start_date, end_date) values (70, 51, 'Leexo', '2023-06-11', '2023-08-24');
insert into internships (intership_id, student_id, company, start_date, end_date) values (71, 219, 'Zoonoodle', '2023-06-17', '2023-10-31');
insert into internships (intership_id, student_id, company, start_date, end_date) values (72, 207, 'Myworks', '2023-06-16', '2023-09-23');
insert into internships (intership_id, student_id, company, start_date, end_date) values (73, 54, 'Kazu', '2023-06-08', '2023-10-07');
insert into internships (intership_id, student_id, company, start_date, end_date) values (74, 212, 'Vimbo', '2023-06-20', '2023-08-29');
insert into internships (intership_id, student_id, company, start_date, end_date) values (75, 244, 'BlogXS', '2023-06-03', '2023-08-22');
insert into internships (intership_id, student_id, company, start_date, end_date) values (76, 37, 'Flipopia', '2023-06-21', '2023-09-10');
insert into internships (intership_id, student_id, company, start_date, end_date) values (77, 135, 'Kare', '2023-06-07', '2023-08-26');
insert into internships (intership_id, student_id, company, start_date, end_date) values (78, 16, 'Plambee', '2023-06-20', '2023-09-21');
insert into internships (intership_id, student_id, company, start_date, end_date) values (79, 67, 'Reallinks', '2023-06-05', '2023-11-24');
insert into internships (intership_id, student_id, company, start_date, end_date) values (80, 5, 'Lajo', '2023-06-08', '2023-09-04');
insert into internships (intership_id, student_id, company, start_date, end_date) values (81, 29, 'Divavu', '2023-06-29', '2023-08-23');
insert into internships (intership_id, student_id, company, start_date, end_date) values (82, 215, 'Livefish', '2023-06-12', '2023-11-22');
insert into internships (intership_id, student_id, company, start_date, end_date) values (83, 236, 'Topicblab', '2023-06-09', '2023-11-10');
insert into internships (intership_id, student_id, company, start_date, end_date) values (84, 111, 'Bluezoom', '2023-06-08', '2023-08-26');
insert into internships (intership_id, student_id, company, start_date, end_date) values (85, 82, 'Kwideo', '2023-06-21', '2023-09-15');
insert into internships (intership_id, student_id, company, start_date, end_date) values (86, 123, 'Yakijo', '2023-06-24', '2023-08-06');
insert into internships (intership_id, student_id, company, start_date, end_date) values (87, 173, 'Gigashots', '2023-06-11', '2023-10-21');
insert into internships (intership_id, student_id, company, start_date, end_date) values (88, 194, 'Zoozzy', '2023-06-11', '2023-09-16');
insert into internships (intership_id, student_id, company, start_date, end_date) values (89, 212, 'Skinix', '2023-06-06', '2023-08-03');
insert into internships (intership_id, student_id, company, start_date, end_date) values (90, 44, 'Browsetype', '2023-06-20', '2023-09-07');
insert into internships (intership_id, student_id, company, start_date, end_date) values (91, 161, 'Yoveo', '2023-06-09', '2023-09-01');
insert into internships (intership_id, student_id, company, start_date, end_date) values (92, 248, 'Buzzdog', '2023-06-12', '2023-08-18');
insert into internships (intership_id, student_id, company, start_date, end_date) values (93, 145, 'Linkbuzz', '2023-06-12', '2023-08-04');
insert into internships (intership_id, student_id, company, start_date, end_date) values (94, 37, 'Bubblemix', '2023-06-18', '2023-08-28');
insert into internships (intership_id, student_id, company, start_date, end_date) values (95, 117, 'Buzzster', '2023-06-25', '2023-10-24');
insert into internships (intership_id, student_id, company, start_date, end_date) values (96, 22, 'Quimm', '2023-06-19', '2023-09-06');
insert into internships (intership_id, student_id, company, start_date, end_date) values (97, 112, 'Voolith', '2023-06-28', '2023-11-12');
insert into internships (intership_id, student_id, company, start_date, end_date) values (98, 108, 'Twitterwire', '2023-06-06', '2023-10-07');
insert into internships (intership_id, student_id, company, start_date, end_date) values (99, 198, 'Topicblab', '2023-06-03', '2023-08-12');
insert into internships (intership_id, student_id, company, start_date, end_date) values (100, 175, 'Shuffledrive', '2023-06-01', '2023-09-27');

--сделано
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (1, 44, 'Russia', '2023-06-12', '2023-08-26');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (2, 42, 'Spain', '2023-06-02', '2023-10-30');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (3, 215, 'Russia', '2023-06-21', '2023-08-27');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (4, 73, 'Russia', '2023-06-20', '2023-10-31');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (5, 160, 'Russia', '2023-06-11', '2023-11-27');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (6, 166, 'Russia', '2023-06-18', '2023-10-11');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (7, 30, 'France', '2023-06-18', '2023-08-25');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (8, 140, 'Russia', '2023-06-12', '2023-09-27');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (9, 100, 'Russia', '2023-06-15', '2023-08-16');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (10, 3, 'Russia', '2023-06-06', '2023-10-05');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (11, 245, 'Russia', '2023-06-03', '2023-08-10');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (12, 250, 'Russia', '2023-06-19', '2023-11-23');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (13, 117, 'France', '2023-06-25', '2023-09-20');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (14, 31, 'Russia', '2023-06-28', '2023-11-01');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (15, 69, 'France', '2023-06-17', '2023-11-29');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (16, 34, 'Russia', '2023-06-10', '2023-11-28');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (17, 62, 'France', '2023-06-24', '2023-08-23');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (18, 210, 'France', '2023-06-09', '2023-10-03');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (19, 152, 'Argentina', '2023-06-14', '2023-09-18');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (20, 83, 'France', '2023-06-26', '2023-08-31');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (21, 113, 'Russia', '2023-06-23', '2023-08-15');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (22, 103, 'Kazakhstan', '2023-06-13', '2023-09-17');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (23, 139, 'Russia', '2023-06-13', '2023-09-10');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (24, 17, 'Argentina', '2023-06-27', '2023-08-27');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (25, 196, 'Russia', '2023-06-29', '2023-09-10');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (26, 62, 'France', '2023-06-01', '2023-10-18');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (27, 59, 'France', '2023-06-14', '2023-09-19');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (28, 169, 'France', '2023-06-05', '2023-09-30');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (29, 26, 'Russia', '2023-06-03', '2023-11-11');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (30, 7, 'Russia', '2023-06-10', '2023-09-17');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (31, 215, 'France', '2023-06-14', '2023-11-13');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (32, 4, 'France', '2023-06-27', '2023-10-27');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (33, 146, 'Russia', '2023-06-06', '2023-10-28');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (34, 103, 'Russia', '2023-06-07', '2023-11-28');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (35, 88, 'Russia', '2023-06-24', '2023-09-10');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (36, 6, 'Russia', '2023-06-26', '2023-09-18');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (37, 250, 'Russia', '2023-06-24', '2023-11-04');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (38, 31, 'Germany', '2023-06-03', '2023-11-26');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (39, 176, 'Argentina', '2023-06-02', '2023-09-18');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (40, 116, 'France', '2023-06-07', '2023-08-28');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (41, 65, 'Russia', '2023-06-16', '2023-08-30');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (42, 195, 'Spain', '2023-06-16', '2023-09-12');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (43, 153, 'France', '2023-06-12', '2023-11-26');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (44, 51, 'Kazakhstan', '2023-06-16', '2023-09-20');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (45, 123, 'Russia', '2023-06-11', '2023-09-27');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (46, 120, 'Argentina', '2023-06-26', '2023-09-09');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (47, 117, 'France', '2023-06-19', '2023-10-10');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (48, 203, 'France', '2023-06-09', '2023-08-08');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (49, 7, 'Russia', '2023-06-01', '2023-11-27');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (50, 188, 'France', '2023-06-05', '2023-11-12');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (51, 53, 'France', '2023-06-05', '2023-09-26');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (52, 25, 'Russia', '2023-06-27', '2023-11-11');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (53, 24, 'Russia', '2023-06-03', '2023-09-13');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (54, 222, 'Russia', '2023-06-10', '2023-10-04');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (55, 5, 'Russia', '2023-06-03', '2023-10-06');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (56, 157, 'Russia', '2023-06-24', '2023-09-30');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (57, 74, 'Russia', '2023-06-27', '2023-10-04');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (58, 217, 'France', '2023-06-08', '2023-11-11');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (59, 46, 'Spain', '2023-06-29', '2023-08-17');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (60, 153, 'France', '2023-06-11', '2023-08-07');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (61, 161, 'Russia', '2023-06-25', '2023-10-27');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (62, 37, 'Russia', '2023-06-17', '2023-09-19');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (63, 30, 'France', '2023-06-28', '2023-10-19');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (64, 168, 'Argentina', '2023-06-27', '2023-11-22');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (65, 236, 'Russia', '2023-06-11', '2023-08-09');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (66, 17, 'France', '2023-06-24', '2023-09-21');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (67, 230, 'Kazakhstan', '2023-06-14', '2023-10-30');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (68, 74, 'France', '2023-06-07', '2023-11-03');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (69, 46, 'France', '2023-06-21', '2023-08-08');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (70, 64, 'Russia', '2023-06-21', '2023-09-07');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (71, 200, 'France', '2023-06-02', '2023-08-22');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (72, 122, 'France', '2023-06-06', '2023-10-18');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (73, 186, 'Germany', '2023-06-01', '2023-11-18');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (74, 218, 'Russia', '2023-06-09', '2023-09-08');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (75, 70, 'Russia', '2023-06-14', '2023-10-23');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (76, 90, 'France', '2023-06-21', '2023-10-04');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (77, 142, 'Argentina', '2023-06-08', '2023-08-20');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (78, 19, 'Argentina', '2023-06-09', '2023-11-14');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (79, 99, 'France', '2023-06-08', '2023-09-28');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (80, 192, 'France', '2023-06-29', '2023-08-30');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (81, 69, 'Russia', '2023-06-06', '2023-08-04');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (82, 197, 'Russia', '2023-06-12', '2023-09-29');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (83, 178, 'Russia', '2023-06-25', '2023-10-30');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (84, 162, 'Russia', '2023-06-06', '2023-10-08');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (85, 11, 'Russia', '2023-06-19', '2023-08-22');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (86, 246, 'Russia', '2023-06-03', '2023-10-18');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (87, 5, 'France', '2023-06-08', '2023-08-22');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (88, 46, 'Russia', '2023-06-25', '2023-08-22');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (89, 108, 'Russia', '2023-06-25', '2023-10-02');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (90, 203, 'Russia', '2023-06-26', '2023-10-25');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (91, 30, 'Argentina', '2023-06-09', '2023-08-01');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (92, 222, 'Germany', '2023-06-11', '2023-11-13');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (93, 23, 'Russia', '2023-06-13', '2023-08-04');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (94, 160, 'Russia', '2023-06-14', '2023-11-28');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (95, 202, 'Russia', '2023-06-05', '2023-08-06');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (96, 228, 'Russia', '2023-06-15', '2023-11-08');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (97, 86, 'Russia', '2023-06-16', '2023-08-18');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (98, 87, 'Argentina', '2023-06-17', '2023-08-30');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (99, 155, 'France', '2023-06-12', '2023-09-30');
insert into study_abroad (program_id, student_id, county, start_date, end_date) values (100, 121, 'Argentina', '2023-06-20', '2023-09-23');


--сделано
insert into student_events (event_id, event_name, event_date, location) values (1, 'Herpestes javanicus', '2024-02-11', '25 Commercial Drive');
insert into student_events (event_id, event_name, event_date, location) values (2, 'Ramphastos tucanus', '2023-06-10', '0 Helena Point');
insert into student_events (event_id, event_name, event_date, location) values (3, 'Anhinga rufa', '2023-10-14', '202 Shasta Court');
insert into student_events (event_id, event_name, event_date, location) values (4, 'Semnopithecus entellus', '2023-06-11', '2 Coolidge Hill');
insert into student_events (event_id, event_name, event_date, location) values (5, 'Ovis ammon', '2023-06-02', '311 Dennis Park');
insert into student_events (event_id, event_name, event_date, location) values (6, 'Himantopus himantopus', '2023-10-25', '0802 Butterfield Terrace');
insert into student_events (event_id, event_name, event_date, location) values (7, 'unavailable', '2023-10-28', '5101 Tomscot Place');
insert into student_events (event_id, event_name, event_date, location) values (8, 'Papio cynocephalus', '2023-10-14', '85785 Ramsey Point');
insert into student_events (event_id, event_name, event_date, location) values (9, 'Morelia spilotes variegata', '2023-12-06', '30 Briar Crest Point');
insert into student_events (event_id, event_name, event_date, location) values (10, 'Eurocephalus anguitimens', '2023-11-08', '2832 Magdeline Avenue');
insert into student_events (event_id, event_name, event_date, location) values (11, 'Spermophilus armatus', '2023-09-25', '30 Shelley Hill');
insert into student_events (event_id, event_name, event_date, location) values (12, 'unavailable', '2023-12-10', '457 Blue Bill Park Circle');
insert into student_events (event_id, event_name, event_date, location) values (13, 'Pycnonotus nigricans', '2023-12-10', '10527 Kedzie Hill');
insert into student_events (event_id, event_name, event_date, location) values (14, 'Philetairus socius', '2023-10-10', '49030 Sommers Junction');
insert into student_events (event_id, event_name, event_date, location) values (15, 'Butorides striatus', '2023-07-26', '614 Reinke Lane');
insert into student_events (event_id, event_name, event_date, location) values (16, 'Estrilda erythronotos', '2024-02-15', '058 Northland Street');
insert into student_events (event_id, event_name, event_date, location) values (17, 'Choloepus hoffmani', '2023-10-20', '93773 Sunbrook Trail');
insert into student_events (event_id, event_name, event_date, location) values (18, 'Delphinus delphis', '2024-01-03', '849 Burning Wood Road');
insert into student_events (event_id, event_name, event_date, location) values (19, 'Cochlearius cochlearius', '2023-12-10', '64 Coleman Parkway');
insert into student_events (event_id, event_name, event_date, location) values (20, 'Boa constrictor mexicana', '2024-02-15', '302 Pierstorff Plaza');
insert into student_events (event_id, event_name, event_date, location) values (21, 'Gyps bengalensis', '2023-07-10', '75621 Emmet Park');
insert into student_events (event_id, event_name, event_date, location) values (22, 'Ara chloroptera', '2023-07-29', '4 Schiller Hill');
insert into student_events (event_id, event_name, event_date, location) values (23, 'Crotaphytus collaris', '2023-07-01', '564 Carpenter Drive');
insert into student_events (event_id, event_name, event_date, location) values (24, 'Eutamias minimus', '2024-01-25', '0923 Eliot Alley');
insert into student_events (event_id, event_name, event_date, location) values (25, 'Nasua narica', '2023-08-30', '47672 Merry Lane');
insert into student_events (event_id, event_name, event_date, location) values (26, 'Propithecus verreauxi', '2023-06-11', '38 Graceland Lane');
insert into student_events (event_id, event_name, event_date, location) values (27, 'Pavo cristatus', '2024-02-13', '3 Little Fleur Parkway');
insert into student_events (event_id, event_name, event_date, location) values (28, 'Thylogale stigmatica', '2024-01-31', '45 Chinook Way');
insert into student_events (event_id, event_name, event_date, location) values (29, 'Graspus graspus', '2023-08-11', '6778 Kensington Lane');
insert into student_events (event_id, event_name, event_date, location) values (30, 'Uraeginthus granatina', '2023-06-09', '231 Blackbird Terrace');
insert into student_events (event_id, event_name, event_date, location) values (31, 'Pteronura brasiliensis', '2023-07-03', '0813 Manley Trail');
insert into student_events (event_id, event_name, event_date, location) values (32, 'Ursus maritimus', '2024-01-07', '3 Claremont Road');
insert into student_events (event_id, event_name, event_date, location) values (33, 'unavailable', '2023-10-14', '943 Tennessee Alley');
insert into student_events (event_id, event_name, event_date, location) values (34, 'unavailable', '2023-06-27', '6509 Bowman Alley');
insert into student_events (event_id, event_name, event_date, location) values (35, 'Bradypus tridactylus', '2023-09-19', '406 Iowa Lane');
insert into student_events (event_id, event_name, event_date, location) values (36, 'unavailable', '2023-11-24', '31 Mayer Trail');
insert into student_events (event_id, event_name, event_date, location) values (37, 'Ciconia ciconia', '2023-11-13', '8747 Darwin Plaza');
insert into student_events (event_id, event_name, event_date, location) values (38, 'Cercopithecus aethiops', '2023-12-25', '7 Monterey Hill');
insert into student_events (event_id, event_name, event_date, location) values (39, 'Damaliscus lunatus', '2023-10-02', '36 Stoughton Place');
insert into student_events (event_id, event_name, event_date, location) values (40, 'Carduelis pinus', '2023-12-01', '50 North Way');
insert into student_events (event_id, event_name, event_date, location) values (41, 'Cervus canadensis', '2023-07-17', '940 Gateway Terrace');
insert into student_events (event_id, event_name, event_date, location) values (42, 'Ovibos moschatus', '2023-09-11', '888 Macpherson Circle');
insert into student_events (event_id, event_name, event_date, location) values (43, 'Dasyurus maculatus', '2023-06-15', '69752 Eagle Crest Terrace');
insert into student_events (event_id, event_name, event_date, location) values (44, 'Dromaeus novaehollandiae', '2023-09-28', '6 Stone Corner Plaza');
insert into student_events (event_id, event_name, event_date, location) values (45, 'Sarcophilus harrisii', '2023-09-17', '4 Little Fleur Junction');
insert into student_events (event_id, event_name, event_date, location) values (46, 'Dasyurus viverrinus', '2023-07-24', '9674 Anzinger Drive');
insert into student_events (event_id, event_name, event_date, location) values (47, 'Charadrius tricollaris', '2023-09-29', '0 Coleman Way');
insert into student_events (event_id, event_name, event_date, location) values (48, 'Amphibolurus barbatus', '2023-08-24', '1 Elka Street');
insert into student_events (event_id, event_name, event_date, location) values (49, 'unavailable', '2023-07-05', '303 Columbus Crossing');
insert into student_events (event_id, event_name, event_date, location) values (50, 'Hippotragus niger', '2023-12-31', '25560 Hintze Pass');
insert into student_events (event_id, event_name, event_date, location) values (51, 'Ramphastos tucanus', '2023-09-28', '105 Melody Trail');
insert into student_events (event_id, event_name, event_date, location) values (52, 'Phacochoerus aethiopus', '2023-09-09', '7 Mifflin Pass');
insert into student_events (event_id, event_name, event_date, location) values (53, 'Pseudocheirus peregrinus', '2023-12-18', '263 Oak Terrace');
insert into student_events (event_id, event_name, event_date, location) values (54, 'Marmota flaviventris', '2023-06-28', '0528 Veith Point');
insert into student_events (event_id, event_name, event_date, location) values (55, 'Alectura lathami', '2023-12-13', '13 Morrow Hill');
insert into student_events (event_id, event_name, event_date, location) values (56, 'Camelus dromedarius', '2023-08-15', '6 Blackbird Way');
insert into student_events (event_id, event_name, event_date, location) values (57, 'Myiarchus tuberculifer', '2024-01-29', '738 Warner Crossing');
insert into student_events (event_id, event_name, event_date, location) values (58, 'Varanus sp.', '2024-02-14', '32 Center Way');
insert into student_events (event_id, event_name, event_date, location) values (59, 'Pelecanus conspicillatus', '2024-01-21', '6862 Orin Center');
insert into student_events (event_id, event_name, event_date, location) values (60, 'Papilio canadensis', '2023-10-26', '8 Lakewood Gardens Crossing');
insert into student_events (event_id, event_name, event_date, location) values (61, 'Bubalornis niger', '2023-08-04', '097 Basil Drive');
insert into student_events (event_id, event_name, event_date, location) values (62, 'Psophia viridis', '2023-11-19', '6 Golf View Lane');
insert into student_events (event_id, event_name, event_date, location) values (63, 'Nycticorax nycticorax', '2023-12-08', '413 Harbort Crossing');
insert into student_events (event_id, event_name, event_date, location) values (64, 'Crocodylus niloticus', '2023-12-03', '957 Pierstorff Parkway');
insert into student_events (event_id, event_name, event_date, location) values (65, 'Gyps fulvus', '2023-06-05', '71134 Carberry Parkway');
insert into student_events (event_id, event_name, event_date, location) values (66, 'Chlamydosaurus kingii', '2024-01-03', '9 Ridge Oak Place');
insert into student_events (event_id, event_name, event_date, location) values (67, 'Eubalaena australis', '2023-10-31', '0 Oak Court');
insert into student_events (event_id, event_name, event_date, location) values (68, 'Phalacrocorax carbo', '2023-10-24', '922 Armistice Avenue');
insert into student_events (event_id, event_name, event_date, location) values (69, 'Paradoxurus hermaphroditus', '2024-02-26', '5 Cordelia Lane');
insert into student_events (event_id, event_name, event_date, location) values (70, 'Dendrocitta vagabunda', '2023-07-05', '469 Linden Avenue');
insert into student_events (event_id, event_name, event_date, location) values (71, 'Iguana iguana', '2024-02-16', '5 Manley Pass');
insert into student_events (event_id, event_name, event_date, location) values (72, 'Felis concolor', '2023-08-26', '62585 Loomis Alley');
insert into student_events (event_id, event_name, event_date, location) values (73, 'Salvadora hexalepis', '2023-12-07', '29 Northview Road');
insert into student_events (event_id, event_name, event_date, location) values (74, 'Perameles nasuta', '2023-10-05', '167 Bobwhite Plaza');
insert into student_events (event_id, event_name, event_date, location) values (75, 'Acrobates pygmaeus', '2023-06-08', '68 Florence Trail');
insert into student_events (event_id, event_name, event_date, location) values (76, 'Balearica pavonina', '2023-12-09', '6377 Sundown Parkway');
insert into student_events (event_id, event_name, event_date, location) values (77, 'Pseudoleistes virescens', '2023-10-21', '2275 Mcguire Drive');
insert into student_events (event_id, event_name, event_date, location) values (78, 'Globicephala melas', '2023-12-12', '11 Pawling Crossing');
insert into student_events (event_id, event_name, event_date, location) values (79, 'Tayassu pecari', '2024-01-10', '8 Bay Plaza');
insert into student_events (event_id, event_name, event_date, location) values (80, 'Hystrix cristata', '2023-12-14', '47834 Butternut Place');
insert into student_events (event_id, event_name, event_date, location) values (81, 'Meles meles', '2023-06-11', '459 Warrior Hill');
insert into student_events (event_id, event_name, event_date, location) values (82, 'Uraeginthus granatina', '2023-11-12', '0068 Hansons Circle');
insert into student_events (event_id, event_name, event_date, location) values (83, 'Neophron percnopterus', '2023-09-24', '013 Derek Court');
insert into student_events (event_id, event_name, event_date, location) values (84, 'Alcelaphus buselaphus cokii', '2024-02-26', '8526 Dahle Crossing');
insert into student_events (event_id, event_name, event_date, location) values (85, 'Macropus rufogriseus', '2023-08-16', '562 Twin Pines Park');
insert into student_events (event_id, event_name, event_date, location) values (86, 'Chlamydosaurus kingii', '2023-11-11', '776 Arizona Center');
insert into student_events (event_id, event_name, event_date, location) values (87, 'Eudyptula minor', '2023-10-07', '5 Mosinee Crossing');
insert into student_events (event_id, event_name, event_date, location) values (88, 'Dasyurus maculatus', '2023-06-24', '3908 Blaine Circle');
insert into student_events (event_id, event_name, event_date, location) values (89, 'Oryx gazella', '2023-12-31', '727 Kensington Alley');
insert into student_events (event_id, event_name, event_date, location) values (90, 'Castor canadensis', '2023-07-22', '90 Dunning Trail');
insert into student_events (event_id, event_name, event_date, location) values (91, 'Macropus agilis', '2023-09-16', '066 Dorton Alley');
insert into student_events (event_id, event_name, event_date, location) values (92, 'Myotis lucifugus', '2023-10-06', '1 Schurz Parkway');
insert into student_events (event_id, event_name, event_date, location) values (93, 'Casmerodius albus', '2023-11-16', '366 Kingsford Circle');
insert into student_events (event_id, event_name, event_date, location) values (94, 'Antidorcas marsupialis', '2023-07-16', '9156 Elgar Street');
insert into student_events (event_id, event_name, event_date, location) values (95, 'Delphinus delphis', '2023-06-21', '78 North Hill');
insert into student_events (event_id, event_name, event_date, location) values (96, 'Pycnonotus barbatus', '2024-01-13', '35606 Northview Crossing');
insert into student_events (event_id, event_name, event_date, location) values (97, 'Tringa glareola', '2023-10-19', '61475 Hanover Parkway');
insert into student_events (event_id, event_name, event_date, location) values (98, 'Castor fiber', '2023-12-11', '8 Crowley Lane');
insert into student_events (event_id, event_name, event_date, location) values (99, 'Coracias caudata', '2023-06-03', '06 Everett Hill');
insert into student_events (event_id, event_name, event_date, location) values (100, 'Deroptyus accipitrinus', '2023-08-12', '35455 International Place');

--сделано
insert into graduations (graduation_id, student_id, graduation_date) values (1, 1, '2023-04-14');
insert into graduations (graduation_id, student_id, graduation_date) values (2, 2, '2022-04-01');
insert into graduations (graduation_id, student_id, graduation_date) values (3, 3, '2023-03-17');
insert into graduations (graduation_id, student_id, graduation_date) values (4, 4, '2022-05-25');
insert into graduations (graduation_id, student_id, graduation_date) values (5, 5, '2021-08-20');
insert into graduations (graduation_id, student_id, graduation_date) values (6, 6, '2021-01-02');
insert into graduations (graduation_id, student_id, graduation_date) values (7, 7, '2021-03-13');
insert into graduations (graduation_id, student_id, graduation_date) values (8, 8, '2021-05-24');
insert into graduations (graduation_id, student_id, graduation_date) values (9, 9, '2022-05-04');
insert into graduations (graduation_id, student_id, graduation_date) values (10, 10, '2021-06-24');
insert into graduations (graduation_id, student_id, graduation_date) values (11, 11, '2021-04-27');
insert into graduations (graduation_id, student_id, graduation_date) values (12, 12, '2022-09-28');
insert into graduations (graduation_id, student_id, graduation_date) values (13, 13, '2022-09-20');
insert into graduations (graduation_id, student_id, graduation_date) values (14, 14, '2020-08-27');
insert into graduations (graduation_id, student_id, graduation_date) values (15, 15, '2023-06-25');
insert into graduations (graduation_id, student_id, graduation_date) values (16, 16, '2023-04-08');
insert into graduations (graduation_id, student_id, graduation_date) values (17, 17, '2022-08-23');
insert into graduations (graduation_id, student_id, graduation_date) values (18, 18, '2021-06-02');
insert into graduations (graduation_id, student_id, graduation_date) values (19, 19, '2022-06-26');
insert into graduations (graduation_id, student_id, graduation_date) values (20, 20, '2022-08-04');
insert into graduations (graduation_id, student_id, graduation_date) values (21, 21, '2021-10-28');
insert into graduations (graduation_id, student_id, graduation_date) values (22, 22, '2022-07-03');
insert into graduations (graduation_id, student_id, graduation_date) values (23, 23, '2021-07-17');
insert into graduations (graduation_id, student_id, graduation_date) values (24, 24, '2022-02-01');
insert into graduations (graduation_id, student_id, graduation_date) values (25, 25, '2022-12-23');
insert into graduations (graduation_id, student_id, graduation_date) values (26, 26, '2021-08-18');
insert into graduations (graduation_id, student_id, graduation_date) values (27, 27, '2022-06-25');
insert into graduations (graduation_id, student_id, graduation_date) values (28, 28, '2023-01-05');
insert into graduations (graduation_id, student_id, graduation_date) values (29, 29, '2022-09-12');
insert into graduations (graduation_id, student_id, graduation_date) values (30, 30, '2021-07-01');
insert into graduations (graduation_id, student_id, graduation_date) values (31, 31, '2022-08-04');
insert into graduations (graduation_id, student_id, graduation_date) values (32, 32, '2023-04-20');
insert into graduations (graduation_id, student_id, graduation_date) values (33, 33, '2023-04-22');
insert into graduations (graduation_id, student_id, graduation_date) values (34, 34, '2022-04-20');
insert into graduations (graduation_id, student_id, graduation_date) values (35, 35, '2022-01-24');
insert into graduations (graduation_id, student_id, graduation_date) values (36, 36, '2022-10-16');
insert into graduations (graduation_id, student_id, graduation_date) values (37, 37, '2021-10-29');
insert into graduations (graduation_id, student_id, graduation_date) values (38, 38, '2021-05-23');
insert into graduations (graduation_id, student_id, graduation_date) values (39, 39, '2021-11-12');
insert into graduations (graduation_id, student_id, graduation_date) values (40, 40, '2023-05-15');
insert into graduations (graduation_id, student_id, graduation_date) values (41, 41, '2023-02-03');
insert into graduations (graduation_id, student_id, graduation_date) values (42, 42, '2022-11-08');
insert into graduations (graduation_id, student_id, graduation_date) values (43, 43, '2021-08-31');
insert into graduations (graduation_id, student_id, graduation_date) values (44, 44, '2022-08-26');
insert into graduations (graduation_id, student_id, graduation_date) values (45, 45, '2020-08-21');
insert into graduations (graduation_id, student_id, graduation_date) values (46, 46, '2020-09-15');
insert into graduations (graduation_id, student_id, graduation_date) values (47, 47, '2021-05-28');
insert into graduations (graduation_id, student_id, graduation_date) values (48, 48, '2021-11-16');
insert into graduations (graduation_id, student_id, graduation_date) values (49, 49, '2023-02-08');
insert into graduations (graduation_id, student_id, graduation_date) values (50, 50, '2022-07-20');

--сделано
INSERT INTO admissions (admission_id, student_id, admission_date, advisor_id) VALUES
(1, 1, '2016-08-27', 2),
(2, 2, '2016-08-02', 16),
(3, 3, '2016-08-04', 10),
(4, 4, '2016-08-15', 15),
(5, 5, '2016-08-06', 11),
(6, 6, '2016-08-19', 11),
(7, 7, '2016-08-18', 9),
(8, 8, '2016-08-26', 4),
(9, 9, '2016-08-22', 4),
(10, 10, '2016-08-09', 1),
(11, 11, '2017-08-07', 6),
(12, 12, '2017-08-03', 3),
(13, 13, '2017-08-09', 11),
(14, 14, '2017-08-10', 15),
(15, 15, '2017-08-31', 3),
(16, 16, '2017-08-25', 2),
(17, 17, '2017-08-15', 9),
(18, 18, '2017-08-22', 11),
(19, 19, '2017-08-13', 11),
(20, 20, '2017-08-17', 5),
(21, 21, '2018-08-02', 8),
(22, 22, '2018-08-23', 6),
(23, 23, '2018-08-08', 3),
(24, 24, '2018-08-07', 5),
(25, 25, '2018-08-25', 9),
(26, 26, '2018-08-16', 2),
(27, 27, '2018-08-25', 6),
(28, 28, '2018-08-22', 8),
(29, 29, '2018-08-12', 4),
(30, 30, '2018-08-09', 7),
(31, 31, '2019-08-17', 2),
(32, 32, '2019-08-18', 16),
(33, 33, '2019-08-24', 1),
(34, 34, '2019-08-11', 8),
(35, 35, '2019-08-12', 5),
(36, 36, '2019-08-09', 7),
(37, 37, '2019-08-04', 8),
(38, 38, '2019-08-04', 6),
(39, 39, '2019-08-07', 8),
(40, 40, '2019-08-11', 4),
(41, 41, '2020-08-18', 16),
(42, 42, '2020-08-02', 15),
(43, 43, '2020-08-15', 2),
(44, 44, '2020-08-18', 9),
(45, 45, '2020-08-22', 16),
(46, 46, '2020-08-30', 11),
(47, 47, '2020-08-05', 3),
(48, 48, '2020-08-17', 5),
(49, 49, '2020-08-01', 12),
(50, 50, '2020-08-12', 2),
(51, 51, '2021-08-05', 9),
(52, 52, '2021-08-22', 12),
(53, 53, '2021-08-07', 13),
(54, 54, '2021-08-17', 11),
(55, 55, '2021-08-25', 15),
(56, 56, '2021-08-14', 8),
(57, 57, '2021-08-18', 10),
(58, 58, '2021-08-14', 2),
(59, 59, '2021-08-21', 9),
(60, 60, '2021-08-04', 4),
(61, 61, '2022-08-31', 11),
(62, 62, '2022-08-05', 11),
(63, 63, '2022-08-06', 4),
(64, 64, '2022-08-25', 13),
(65, 65, '2022-08-20', 12),
(66, 66, '2022-08-23', 5),
(67, 67, '2022-08-17', 2),
(68, 68, '2022-08-14', 1),
(69, 69, '2022-08-02', 2),
(70, 70, '2022-08-07', 5),
(71, 71, '2016-08-06', 2),
(72, 72, '2016-08-13', 13),
(73, 73, '2016-08-11', 16),
(74, 74, '2016-08-07', 10),
(75, 75, '2016-08-30', 3),
(76, 76, '2016-08-20', 10),
(77, 77, '2016-08-13', 2),
(78, 78, '2016-08-03', 4),
(79, 79, '2016-08-26', 9),
(80, 80, '2016-08-02', 15),
(81, 81, '2017-08-28', 5),
(82, 82, '2017-08-14', 4),
(83, 83, '2017-08-22', 2),
(84, 84, '2017-08-25', 10),
(85, 85, '2017-08-21', 7),
(86, 86, '2017-08-01', 1),
(87, 87, '2017-08-31', 5),
(88, 88, '2017-08-25', 5),
(89, 89, '2017-08-02', 16),
(90, 90, '2017-08-23', 10),
(91, 91, '2018-08-03', 7),
(92, 92, '2018-08-08', 4),
(93, 93, '2018-08-08', 16),
(94, 94, '2018-08-01', 16),
(95, 95, '2018-08-20', 3),
(96, 96, '2018-08-17', 7),
(97, 97, '2018-08-14', 10),
(98, 98, '2018-08-08', 4),
(99, 99, '2018-08-17', 4),
(100, 100, '2018-08-03', 6),
(101, 101, '2019-08-21', 15),
(102, 102, '2019-08-24', 10),
(103, 103, '2019-08-25', 8),
(104, 104, '2019-08-26', 9),
(105, 105, '2019-08-18', 16),
(106, 106, '2019-08-18', 4),
(107, 107, '2019-08-20', 11),
(108, 108, '2019-08-31', 2),
(109, 109, '2019-08-02', 5),
(110, 110, '2019-08-08', 1),
(111, 111, '2020-08-11', 5),
(112, 112, '2020-08-15', 1),
(113, 113, '2020-08-03', 10),
(114, 114, '2020-08-31', 2),
(115, 115, '2020-08-23', 13),
(116, 116, '2020-08-23', 10),
(117, 117, '2020-08-18', 11),
(118, 118, '2020-08-26', 15),
(119, 119, '2020-08-03', 16),
(120, 120, '2020-08-24', 10),
(121, 121, '2021-08-07', 16),
(122, 122, '2021-08-19', 4),
(123, 123, '2021-08-21', 13),
(124, 124, '2021-08-31', 11),
(125, 125, '2021-08-05', 8),
(126, 126, '2021-08-13', 7),
(127, 127, '2021-08-20', 3),
(128, 128, '2021-08-15', 11),
(129, 129, '2021-08-29', 6),
(130, 130, '2021-08-23', 3),
(131, 131, '2022-08-16', 8),
(132, 132, '2022-08-05', 15),
(133, 133, '2022-08-06', 4),
(134, 134, '2022-08-25', 12),
(135, 135, '2022-08-06', 11),
(136, 136, '2022-08-12', 8),
(137, 137, '2022-08-23', 10),
(138, 138, '2022-08-07', 16),
(139, 139, '2022-08-22', 6),
(140, 140, '2022-08-26', 8),
(141, 141, '2016-08-07', 8),
(142, 142, '2016-08-08', 16),
(143, 143, '2016-08-21', 10),
(144, 144, '2016-08-26', 5),
(145, 145, '2016-08-20', 7),
(146, 146, '2016-08-19', 9),
(147, 147, '2016-08-05', 8),
(148, 148, '2016-08-04', 14),
(149, 149, '2016-08-14', 10),
(150, 150, '2016-08-20', 7),
(151, 151, '2017-08-30', 12),
(152, 152, '2017-08-15', 1),
(153, 153, '2017-08-12', 5),
(154, 154, '2017-08-22', 14),
(155, 155, '2017-08-22', 8),
(156, 156, '2017-08-02', 7),
(157, 157, '2017-08-20', 7),
(158, 158, '2017-08-18', 8),
(159, 159, '2017-08-13', 5),
(160, 160, '2017-08-08', 1),
(161, 161, '2018-08-31', 13),
(162, 162, '2018-08-17', 3),
(163, 163, '2018-08-27', 6),
(164, 164, '2018-08-28', 7),
(165, 165, '2018-08-28', 12),
(166, 166, '2018-08-23', 8),
(167, 167, '2018-08-19', 15),
(168, 168, '2018-08-20', 10),
(169, 169, '2018-08-18', 7),
(170, 170, '2018-08-22', 6),
(171, 171, '2019-08-07', 10),
(172, 172, '2019-08-12', 6),
(173, 173, '2019-08-28', 10),
(174, 174, '2019-08-23', 7),
(175, 175, '2019-08-20', 6),
(176, 176, '2019-08-04', 14),
(177, 177, '2019-08-16', 11),
(178, 178, '2019-08-14', 16),
(179, 179, '2019-08-16', 2),
(180, 180, '2019-08-12', 13),
(181, 181, '2020-08-29', 3),
(182, 182, '2020-08-02', 11),
(183, 183, '2020-08-16', 1),
(184, 184, '2020-08-31', 6),
(185, 185, '2020-08-22', 7),
(186, 186, '2020-08-08', 2),
(187, 187, '2020-08-14', 3),
(188, 188, '2020-08-09', 14),
(189, 189, '2020-08-23', 10),
(190, 190, '2020-08-10', 10),
(191, 191, '2021-08-07', 7),
(192, 192, '2021-08-04', 14),
(193, 193, '2021-08-25', 4),
(194, 194, '2021-08-18', 5),
(195, 195, '2021-08-31', 2),
(196, 196, '2021-08-02', 2),
(197, 197, '2021-08-11', 16),
(198, 198, '2021-08-22', 12),
(199, 199, '2021-08-05', 11),
(200, 200, '2021-08-15', 12),
(201, 201, '2022-08-27', 13),
(202, 202, '2022-08-30', 1),
(203, 203, '2022-08-29', 11),
(204, 204, '2022-08-20', 12),
(205, 205, '2022-08-21', 14),
(206, 206, '2022-08-17', 5),
(207, 207, '2022-08-02', 5),
(208, 208, '2022-08-29', 15),
(209, 209, '2022-08-12', 6),
(210, 210, '2022-08-13', 14),
(211, 211, '2016-08-21', NULL),
(212, 212, '2016-08-11', NULL),
(213, 213, '2016-08-29', NULL),
(214, 214, '2016-08-24', NULL),
(215, 215, '2016-08-22', NULL),
(216, 216, '2016-08-29', NULL),
(217, 217, '2016-08-02', NULL),
(218, 218, '2016-08-31', NULL),
(219, 219, '2016-08-31', NULL),
(220, 220, '2016-08-20', NULL),
(221, 221, '2017-08-29', NULL),
(222, 222, '2017-08-15', NULL),
(223, 223, '2017-08-10', NULL),
(224, 224, '2017-08-31', NULL),
(225, 225, '2017-08-18', NULL),
(226, 226, '2017-08-10', NULL),
(227, 227, '2017-08-29', NULL),
(228, 228, '2017-08-11', NULL),
(229, 229, '2017-08-14', NULL),
(230, 230, '2017-08-03', NULL),
(231, 231, '2018-08-14', NULL),
(232, 232, '2018-08-07', NULL),
(233, 233, '2018-08-25', NULL),
(234, 234, '2018-08-09', NULL),
(235, 235, '2018-08-11', NULL),
(236, 236, '2018-08-28', NULL),
(237, 237, '2018-08-17', NULL),
(238, 238, '2018-08-19', NULL),
(239, 239, '2018-08-23', NULL),
(240, 240, '2018-08-26', NULL);








--сделано
INSERT INTO enrollments (enrollment_id, student_id, instructor_id, group_id,enrollment_date)
VALUES
(1, 208, 9, NULL, '2018-01-14'),
(2, 43, 26, 2, '2017-04-24'),
(3, 121, 36, 1, '2019-06-12'),
(4, 147, 9, NULL, '2017-09-01'),
(5, 109, 19, 1, '2019-02-24'),
(6, 9, 37, 4, '2023-01-03'),
(7, 206, 32, NULL, '2022-06-07'),
(8, 15, 27, 4, '2022-11-12'),
(9, 101, 34, 4, '2019-03-23'),
(10, 193, 17, NULL, '2020-09-20'),
(11, 71, 8, 1, '2016-09-14'),
(12, 172, 47, 3, '2021-05-10'),
(13, 146, 40, NULL, '2019-01-28'),
(14, 206, 15, 2, '2023-12-14'),
(15, 30, 1, 1, '2021-05-18'),
(16, 127, 7, NULL, '2023-08-08'),
(17, 225, 23, 2, '2017-10-08'),
(18, 36, 8, 4, '2020-11-20'),
(19, 1, 15, NULL, '2022-01-10'),
(20, 9, 30, 4, '2019-07-02'),
(21, 133, 39, 3, '2016-05-12'),
(22, 221, 9, NULL, '2018-01-25'),
(23, 42, 40, 1, '2022-12-27'),
(24, 219, 30, 2, '2016-07-24'),
(25, 155, 18, NULL, '2023-05-24'),
(26, 94, 7, 4, '2021-02-12'),
(27, 27, 44, 4, '2022-03-27'),
(28, 217, 32, NULL, '2022-09-03'),
(29, 230, 32, 2, '2023-01-05'),
(30, 210, 8, 1, '2020-08-02'),
(31, 48, 6, NULL, '2018-03-28'),
(32, 66, 15, 2, '2021-05-06'),
(33, 171, 13, 1, '2016-04-12'),
(34, 98, 29, NULL, '2018-01-16'),
(35, 154, 49, 4, '2019-05-02'),
(36, 107, 23, 3, '2018-07-21'),
(37, 162, 1, NULL, '2019-09-25'),
(38, 116, 17, 1, '2023-02-06'),
(39, 107, 32, 3, '2022-11-13'),
(40, 209, 1, NULL, '2023-12-02'),
(41, 199, 40, 1, '2023-02-12'),
(42, 47, 9, 1, '2021-12-11'),
(43, 168, 37, NULL, '2018-09-25'),
(44, 87, 47, 3, '2018-01-19'),
(45, 90, 32, 3, '2022-08-04'),
(46, 139, 38, NULL, '2022-09-23'),
(47, 56, 47, 3, '2019-06-28'),
(48, 138, 47, 2, '2019-01-10'),
(49, 71, 50, NULL, '2023-08-20'),
(50, 122, 29, 3, '2019-10-28'),
(51, 128, 40, 1, '2020-03-16'),
(52, 227, 33, NULL, '2016-01-26'),
(53, 217, 40, 2, '2019-10-13'),
(54, 94, 17, 2, '2020-12-22'),
(55, 241, 10, NULL, '2022-11-11'),
(56, 141, 34, 4, '2018-07-12'),
(57, 133, 35, 2, '2018-08-23'),
(58, 26, 28, NULL, '2021-06-24'),
(59, 152, 1, 4, '2020-10-06'),
(60, 87, 40, 4, '2023-09-24'),
(61, 227, 10, NULL, '2022-02-08'),
(62, 39, 17, 4, '2021-12-21'),
(63, 131, 19, 2, '2017-12-12'),
(64, 221, 23, NULL, '2016-09-18'),
(65, 2, 47, 2, '2021-10-24'),
(66, 167, 16, 4, '2023-05-24'),
(67, 245, 39, NULL, '2022-02-08'),
(68, 108, 28, 2, '2019-06-25'),
(69, 69, 45, 4, '2017-12-16'),
(70, 139, 5, NULL, '2019-05-01'),
(71, 207, 32, 4, '2016-06-07'),
(72, 43, 7, 4, '2017-10-12'),
(73, 169, 16, NULL, '2017-01-04'),
(74, 73, 14, 4, '2020-09-15'),
(75, 223, 7, 1, '2021-10-24'),
(76, 112, 38, NULL, '2023-05-04'),
(77, 170, 47, 4, '2023-03-26'),
(78, 64, 44, 4, '2017-08-13'),
(79, 65, 31, NULL, '2020-01-22'),
(80, 236, 20, 4, '2022-07-28'),
(81, 77, 16, 4, '2018-02-09'),
(82, 142, 6, NULL, '2022-11-05'),
(83, 223, 8, 2, '2020-06-26'),
(84, 123, 28, 4, '2021-09-22'),
(85, 154, 26, NULL, '2020-11-27'),
(86, 129, 18, 4, '2018-02-12'),
(87, 107, 11, 3, '2017-11-27'),
(88, 155, 17, NULL, '2020-11-20'),
(89, 198, 28, 3, '2020-03-24'),
(90, 49, 21, 2, '2017-01-12'),
(91, 111, 49, NULL, '2021-05-25'),
(92, 91, 27, 3, '2016-05-24'),
(93, 78, 40, 1, '2019-03-01'),
(94, 120, 11, NULL, '2018-11-14'),
(95, 150, 39, 3, '2019-04-28'),
(96, 124, 25, 1, '2020-09-09'),
(97, 89, 13, NULL, '2016-04-23'),
(98, 101, 33, 3, '2016-07-14'),
(99, 250, 23, 2, '2020-12-19'),
(100, 97, 32, NULL, '2021-09-04'),
(101, 131, 46, 3, '2021-06-26'),
(102, 16, 40, 1, '2019-02-14'),
(103, 28, 11, NULL, '2020-07-01'),
(104, 164, 4, 1, '2019-12-12'),
(105, 92, 23, 2, '2018-12-22'),
(106, 238, 21, NULL, '2022-09-12'),
(107, 146, 33, 3, '2019-04-27'),
(108, 84, 42, 3, '2020-05-04'),
(109, 68, 39, NULL, '2023-05-10'),
(110, 172, 50, 4, '2016-10-12'),
(111, 173, 16, 3, '2022-01-28'),
(112, 230, 23, NULL, '2018-02-12'),
(113, 148, 27, 4, '2020-08-09'),
(114, 164, 26, 2, '2021-11-27'),
(115, 79, 43, NULL, '2022-07-09'),
(116, 157, 8, 2, '2018-12-21'),
(117, 3, 10, 1, '2020-03-24'),
(118, 7, 42, NULL, '2021-03-11'),
(119, 242, 48, 2, '2022-04-07'),
(120, 245, 36, 2, '2022-03-02'),
(121, 176, 31, NULL, '2019-09-07'),
(122, 42, 38, 2, '2018-06-06'),
(123, 215, 39, 4, '2016-11-21'),
(124, 122, 48, NULL, '2018-06-12'),
(125, 168, 14, 2, '2022-03-12'),
(126, 226, 6, 1, '2019-01-07'),
(127, 202, 12, NULL, '2023-12-12'),
(128, 102, 29, 1, '2016-05-27'),
(129, 157, 33, 4, '2017-01-11'),
(130, 173, 27, NULL, '2022-12-21'),
(131, 90, 46, 1, '2019-08-01'),
(132, 161, 42, NULL, '2016-04-25'),
(133, 147, 19, 3, '2023-10-20'),
(134, 250, 34, 2, '2018-01-03'),
(135, 207, 48, NULL, '2021-11-04'),
(136, 233, 13, 3, '2016-11-26'),
(137, 234, 43, 3, '2020-04-10'),
(138, 86, 1, NULL, '2019-05-11'),
(139, 89, 4, 1, '2018-03-15'),
(140, 1, 8, 2, '2021-07-24'),
(141, 132, 41, NULL, '2020-11-12'),
(142, 212, 3, 1, '2019-10-10'),
(143, 53, 10, 4, '2023-01-08'),
(144, 32, 34, NULL, '2021-09-10'),
(145, 91, 13, 2, '2017-05-07'),
(146, 215, 11, 4, '2019-06-11'),
(147, 160, 25, NULL, '2016-05-26'),
(148, 236, 21, 4, '2017-11-22'),
(149, 203, 13, 1, '2019-07-24'),
(150, 63, 9, NULL, '2022-03-12'),
(151, 32, 20, 2, '2016-09-23'),
(152, 59, 5, 4, '2017-08-20'),
(153, 154, 46, NULL, '2022-06-25'),
(154, 9, 3, 4, '2021-10-28'),
(155, 56, 49, 4, '2020-08-26'),
(156, 84, 12, NULL, '2023-03-25'),
(157, 43, 8, 2, '2017-01-14'),
(158, 231, 42, 3, '2020-07-08'),
(159, 148, 35, NULL, '2021-11-16'),
(160, 25, 20, 4, '2016-02-18'),
(161, 28, 15, 4, '2023-12-09'),
(162, 80, 29, NULL, '2021-09-23'),
(163, 62, 45, 4, '2016-10-04'),
(164, 12, 33, 2, '2016-10-23'),
(165, 133, 38, NULL, '2016-01-11'),
(166, 31, 17, 3, '2018-09-13'),
(167, 227, 21, 1, '2023-07-07'),
(168, 133, 4, NULL, '2021-04-21'),
(169, 110, 18, 4, '2023-09-26'),
(170, 65, 21, 3, '2021-07-02'),
(171, 70, 50, NULL, '2016-05-17'),
(172, 72, 25, 3, '2018-05-16'),
(173, 57, 27, 2, '2020-10-05'),
(174, 13, 33, NULL, '2018-10-21'),
(175, 149, 39, 4, '2019-04-23'),
(176, 234, 45, 1, '2019-02-26'),
(177, 20, 25, NULL, '2017-06-16'),
(178, 25, 48, 1, '2017-10-26'),
(179, 100, 37, 2, '2022-02-07'),
(180, 208, 46, NULL, '2021-02-11'),
(181, 119, 36, 4, '2022-09-17'),
(182, 166, 3, 4, '2023-04-24'),
(183, 227, 43, NULL, '2019-07-28'),
(184, 69, 35, 1, '2021-09-23'),
(185, 222, 20, 4, '2023-05-21'),
(186, 125, 7, NULL, '2020-07-24'),
(187, 161, 34, 2, '2022-06-20'),
(188, 46, 9, 4, '2022-02-09'),
(189, 60, 20, NULL, '2019-03-22'),
(190, 18, 15, 2, '2021-03-12'),
(191, 23, 43, 4, '2017-09-12'),
(192, 167, 47, NULL, '2022-11-07'),
(193, 176, 22, 1, '2021-02-14'),
(194, 15, 2, 3, '2017-04-18'),
(195, 27, 21, NULL, '2018-12-24'),
(196, 117, 6, 1, '2023-08-11'),
(197, 179, 35, 2, '2021-02-23'),
(198, 11, 47, NULL, '2021-11-20'),
(199, 138, 1, 3, '2018-11-09'),
(200, 161, 4, 4, '2017-10-01'),
(201, 69, 24, NULL, '2022-09-26'),
(202, 191, 13, 1, '2018-06-26'),
(203, 28, 20, 4, '2022-07-18'),
(204, 174, 2, NULL, '2020-02-03'),
(205, 207, 29, 4, '2016-04-11'),
(206, 185, 21, 1, '2020-03-03'),
(207, 122, 40, NULL, '2016-05-05'),
(208, 29, 25, 2, '2016-02-08'),
(209, 226, 27, 1, '2021-05-09'),
(210, 250, 35, NULL, '2019-12-16'),
(211, 105, 9, 1, '2020-12-27'),
(212, 78, 45, 2, '2023-02-22'),
(213, 90, 45, NULL, '2021-05-08'),
(214, 39, 17, 3, '2019-10-16'),
(215, 51, 21, 3, '2021-05-20'),
(216, 5, 46, NULL, '2016-11-09'),
(217, 237, 28, 1, '2020-02-10'),
(218, 228, 39, 4, '2022-01-04'),
(219, 202, 43, NULL, '2016-09-13'),
(220, 95, 31, 1, '2020-01-02'),
(221, 2, 28, 2, '2017-01-18'),
(222, 16, 39, NULL, '2023-09-01'),
(223, 217, 13, 2, '2022-12-28'),
(224, 188, 2, 1, '2018-03-18'),
(225, 104, 20, NULL, '2016-03-05'),
(226, 212, 32, 2, '2023-05-17'),
(227, 208, 32, 2, '2021-10-08'),
(228, 66, 25, NULL, '2021-01-09'),
(229, 199, 48, 3, '2023-06-04'),
(230, 120, 14, 1, '2018-06-22'),
(231, 1, 30, NULL, '2021-12-19'),
(232, 145, 9, 4, '2018-11-03'),
(233, 216, 46, 3, '2018-08-12'),
(234, 108, 37, NULL, '2017-07-02'),
(235, 108, 41, 1, '2021-02-03'),
(236, 74, 47, 1, '2021-11-03'),
(237, 15, 47, NULL, '2016-01-07'),
(238, 126, 49, 3, '2023-05-02'),
(239, 219, 36, 4, '2021-06-22'),
(240, 151, 17, NULL, '2019-02-16'),
(241, 163, 49, 3, '2021-12-20'),
(242, 105, 33, 3, '2022-03-23'),
(243, 192, 22, NULL, '2019-06-18'),
(244, 8, 17, 1, '2016-12-27'),
(245, 5, 26, 1, '2017-01-24'),
(246, 11, 24, NULL, '2017-06-05'),
(247, 172, 11, 1, '2017-12-26'),
(248, 122, 24, 2, '2016-12-16'),
(249, 87, 44, NULL, '2022-02-24'),
(250, 4, 6, 3, '2018-05-16'),
(251, 130, 47, 3, '2019-08-05'),
(252, 104, 45, NULL, '2016-12-14'),
(253, 97, 45, 4, '2020-01-17'),
(254, 49, 29, 2, '2020-12-02'),
(255, 75, 14, NULL, '2019-11-14'),
(256, 215, 19, 1, '2020-11-11'),
(257, 17, 38, 1, '2022-11-20'),
(258, 33, 21, NULL, '2023-11-24'),
(259, 97, 1, 3, '2023-08-15'),
(260, 206, 41, 2, '2016-01-21'),
(261, 234, 41, NULL, '2020-09-23'),
(262, 87, 19, 2, '2017-03-09'),
(263, 109, 1, 2, '2016-05-07'),
(264, 76, 3, NULL, '2018-04-08'),
(265, 78, 10, 2, '2017-01-10'),
(266, 186, 48, 1, '2018-10-14'),
(267, 59, 35, NULL, '2019-10-14'),
(268, 198, 15, 2, '2020-04-18'),
(269, 130, 34, 2, '2021-12-07'),
(270, 11, 8, NULL, '2021-06-20'),
(271, 34, 27, 1, '2018-07-22'),
(272, 183, 28, 3, '2021-10-14'),
(273, 212, 49, NULL, '2018-09-04'),
(274, 26, 47, 3, '2020-12-14'),
(275, 34, 16, 4, '2018-01-17'),
(276, 63, 44, NULL, '2022-07-26'),
(277, 180, 44, 2, '2016-11-13'),
(278, 152, 26, 1, '2018-08-26'),
(279, 241, 33, NULL, '2020-08-04'),
(280, 114, 3, 2, '2023-12-18'),
(281, 47, 2, 2, '2020-01-07'),
(282, 125, 41, NULL, '2016-06-08'),
(283, 212, 50, 2, '2022-12-16'),
(284, 148, 25, 2, '2018-10-07'),
(285, 238, 17, NULL, '2019-03-08'),
(286, 89, 18, 2, '2019-01-02'),
(287, 226, 48, 4, '2017-03-12'),
(288, 250, 18, NULL, '2021-07-14'),
(289, 215, 34, 4, '2017-05-21'),
(290, 201, 12, 3, '2018-03-27'),
(291, 214, 6, NULL, '2018-11-08'),
(292, 242, 7, 1, '2018-05-15'),
(293, 249, 36, 1, '2022-06-26'),
(294, 139, 28, NULL, '2019-09-04'),
(295, 142, 46, 3, '2020-12-22'),
(296, 79, 37, 1, '2016-09-27'),
(297, 187, 42, NULL, '2021-09-14'),
(298, 50, 2, 2, '2021-10-22'),
(299, 63, 34, 3, '2018-06-09'),
(300, 229, 32, NULL, '2017-04-19'),
(301, 13, 32, 2, '2022-10-25'),
(302, 189, 21, 2, '2021-07-07'),
(303, 86, 5, NULL, '2023-02-01'),
(304, 20, 25, 3, '2020-09-10'),
(305, 114, 41, 1, '2019-04-01'),
(306, 220, 37, NULL, '2019-11-13'),
(307, 102, 7, 1, '2017-08-18'),
(308, 174, 26, 2, '2019-01-23'),
(309, 152, 25, NULL, '2020-11-27'),
(310, 186, 35, 3, '2020-07-19'),
(311, 159, 39, 2, '2023-08-09'),
(312, 222, 19, NULL, '2020-05-14'),
(313, 102, 44, 2, '2021-10-12'),
(314, 63, 10, 3, '2016-06-08'),
(315, 45, 10, NULL, '2017-01-06'),
(316, 137, 31, 3, '2018-04-03'),
(317, 70, 39, 4, '2022-09-20'),
(318, 131, 33, NULL, '2020-12-07'),
(319, 86, 27, 4, '2022-11-13'),
(320, 76, 2, 2, '2019-10-23'),
(321, 145, 22, NULL, '2016-02-02'),
(322, 87, 21, 2, '2023-01-06'),
(323, 105, 25, 1, '2021-11-09'),
(324, 30, 2, NULL, '2018-05-11'),
(325, 213, 8, 3, '2020-06-27'),
(326, 24, 49, 3, '2023-09-11'),
(327, 73, 19, NULL, '2023-06-05'),
(328, 244, 44, 1, '2020-01-12'),
(329, 68, 18, 1, '2021-03-27'),
(330, 244, 43, NULL, '2019-04-02'),
(331, 153, 45, 1, '2017-11-10'),
(332, 18, 26, 3, '2021-08-17'),
(333, 249, 23, NULL, '2019-07-28'),
(334, 241, 10, 3, '2023-11-10'),
(335, 129, 48, 1, '2021-08-11'),
(336, 181, 50, NULL, '2018-08-05'),
(337, 196, 31, 1, '2016-10-08'),
(338, 37, 40, 4, '2022-04-17'),
(339, 155, 7, NULL, '2016-01-27'),
(340, 164, 10, 1, '2022-11-11'),
(341, 178, 17, 3, '2021-10-02'),
(342, 160, 39, NULL, '2017-12-28'),
(343, 240, 17, 1, '2019-09-13'),
(344, 231, 12, 2, '2016-09-28'),
(345, 8, 34, NULL, '2020-06-05'),
(346, 180, 7, 2, '2019-06-20'),
(347, 11, 18, 2, '2020-10-15'),
(348, 98, 43, NULL, '2017-10-13'),
(349, 74, 42, 4, '2021-04-21'),
(350, 229, 24, 1, '2023-04-04'),
(351, 164, 28, NULL, '2020-01-13'),
(352, 245, 34, 2, '2016-09-11'),
(353, 174, 25, 4, '2019-01-05'),
(354, 15, 12, NULL, '2022-08-13'),
(355, 154, 41, 4, '2017-04-09'),
(356, 25, 30, 2, '2016-05-18'),
(357, 130, 44, NULL, '2022-04-20'),
(358, 189, 14, 3, '2021-11-26'),
(359, 107, 39, 2, '2019-10-03'),
(360, 10, 46, NULL, '2023-08-11'),
(361, 96, 45, 1, '2017-12-17'),
(362, 86, 26, 1, '2018-08-14'),
(363, 76, 35, NULL, '2017-01-27'),
(364, 115, 19, 4, '2023-07-18'),
(365, 228, 47, 3, '2020-02-28'),
(366, 213, 44, NULL, '2020-04-01'),
(367, 9, 16, 3, '2019-04-17'),
(368, 209, 25, 3, '2022-11-21'),
(369, 119, 16, NULL, '2017-07-15'),
(370, 151, 20, 1, '2018-10-12'),
(371, 22, 31, 4, '2016-09-10'),
(372, 102, 42, NULL, '2016-12-20'),
(373, 7, 6, 2, '2017-12-22'),
(374, 43, 4, 4, '2016-02-09'),
(375, 49, 32, NULL, '2023-07-21'),
(376, 250, 16, 2, '2017-08-16'),
(377, 38, 3, 2, '2022-08-24'),
(378, 122, 45, NULL, '2016-09-16'),
(379, 9, 38, 3, '2016-04-15'),
(380, 148, 19, 4, '2022-03-09'),
(381, 193, 29, NULL, '2016-07-16'),
(382, 207, 4, 4, '2021-06-25'),
(383, 43, 27, 2, '2018-06-12'),
(384, 207, 2, NULL, '2020-11-12'),
(385, 7, 21, 4, '2019-07-21'),
(386, 18, 47, 2, '2016-09-21'),
(387, 31, 18, NULL, '2020-05-25'),
(388, 72, 15, 1, '2021-08-10'),
(389, 87, 17, 1, '2021-01-23'),
(390, 133, 35, NULL, '2021-02-09'),
(391, 249, 48, 4, '2023-10-15'),
(392, 132, 48, 1, '2016-08-04'),
(393, 167, 33, NULL, '2018-04-12'),
(394, 147, 25, 3, '2020-05-18'),
(395, 97, 44, 3, '2017-03-27'),
(396, 149, 37, NULL, '2023-06-26'),
(397, 176, 6, 4, '2018-11-25'),
(398, 86, 44, 2, '2019-07-12'),
(399, 115, 20, NULL, '2017-08-09'),
(400, 38, 2, 3, '2017-05-24'),
(401, 133, 4, 2, '2023-06-23'),
(402, 248, 17, NULL, '2016-09-03'),
(403, 249, 24, 2, '2023-03-09'),
(404, 236, 24, 2, '2023-05-20'),
(405, 158, 38, NULL, '2018-12-04'),
(406, 67, 24, 2, '2018-02-18'),
(407, 191, 2, 2, '2020-01-27'),
(408, 203, 30, NULL, '2017-03-14'),
(409, 225, 17, 4, '2021-01-20'),
(410, 27, 2, 1, '2023-09-09'),
(411, 194, 16, NULL, '2020-03-07'),
(412, 245, 44, 4, '2017-12-03'),
(413, 27, 33, 3, '2016-08-24'),
(414, 20, 19, NULL, '2021-10-15'),
(415, 108, 48, 3, '2017-09-18'),
(416, 216, 16, 2, '2021-01-08'),
(417, 35, 28, NULL, '2022-12-26'),
(418, 65, 50, 1, '2020-03-28'),
(419, 196, 34, 1, '2016-03-19'),
(420, 26, 27, NULL, '2023-11-21'),
(421, 217, 23, 1, '2016-05-03'),
(422, 53, 7, 4, '2023-11-04'),
(423, 134, 44, NULL, '2020-10-23'),
(424, 33, 24, 1, '2023-03-27'),
(425, 218, 18, 3, '2023-02-01'),
(426, 145, 2, NULL, '2017-04-07'),
(427, 168, 33, 3, '2017-02-18'),
(428, 189, 29, 1, '2021-01-11'),
(429, 208, 35, NULL, '2019-04-11'),
(430, 33, 33, 3, '2020-03-24'),
(431, 190, 32, 3, '2016-01-25'),
(432, 233, 48, NULL, '2017-07-05'),
(433, 201, 41, 4, '2017-08-21'),
(434, 36, 16, 1, '2017-07-19'),
(435, 63, 6, NULL, '2023-09-03'),
(436, 75, 33, 4, '2021-01-18'),
(437, 155, 14, 1, '2023-03-10'),
(438, 45, 40, NULL, '2021-04-19'),
(439, 173, 21, 3, '2016-04-01'),
(440, 169, 22, 2, '2016-10-22'),
(441, 31, 4, NULL, '2016-12-20'),
(442, 91, 6, 4, '2017-11-17'),
(443, 131, 50, 3, '2016-02-26'),
(444, 84, 22, NULL, '2019-04-08'),
(445, 233, 40, 1, '2020-12-08'),
(446, 86, 10, 2, '2023-03-16'),
(447, 46, 21, NULL, '2023-12-27'),
(448, 196, 9, 2, '2021-03-18'),
(449, 226, 25, 4, '2022-11-08'),
(450, 45, 18, NULL, '2018-11-08'),
(451, 28, 21, 2, '2020-01-12'),
(452, 154, 4, 1, '2016-09-14'),
(453, 11, 19, NULL, '2023-11-28'),
(454, 125, 36, 4, '2020-06-11'),
(455, 160, 3, 2, '2016-03-27'),
(456, 50, 22, NULL, '2020-05-24'),
(457, 136, 45, 1, '2016-07-10'),
(458, 250, 17, 1, '2023-09-24'),
(459, 154, 13, NULL, '2017-06-05'),
(460, 240, 49, 1, '2018-07-06'),
(461, 92, 16, 1, '2018-03-27'),
(462, 230, 23, NULL, '2023-09-19'),
(463, 67, 1, 3, '2023-10-08'),
(464, 233, 18, 3, '2016-05-03'),
(465, 232, 36, NULL, '2023-01-08'),
(466, 115, 15, 1, '2020-06-03'),
(467, 145, 15, 1, '2016-08-04'),
(468, 162, 18, NULL, '2017-02-10'),
(469, 181, 40, 2, '2016-09-22'),
(470, 200, 20, 3, '2019-08-01'),
(471, 120, 2, NULL, '2021-04-13'),
(472, 193, 50, 2, '2020-04-13'),
(473, 161, 5, 4, '2023-11-22'),
(474, 63, 10, 1, '2020-02-15'),
(475, 86, 9, 1, '2018-05-18'),
(476, 14, 13, NULL, '2020-02-14'),
(477, 177, 43, 2, '2020-09-10'),
(478, 159, 40, 4, '2022-11-28'),
(479, 217, 1, NULL, '2019-08-22'),
(480, 99, 49, 2, '2019-01-24'),
(481, 171, 19, 1, '2018-01-08'),
(482, 44, 1, 4, '2016-11-05'),
(483, 218, 37, 3, '2018-08-10'),
(484, 118, 26, NULL, '2019-02-23'),
(485, 37, 37, 2, '2021-01-09'),
(486, 213, 30, 1, '2023-11-12'),
(487, 42, 12, NULL, '2021-07-25'),
(488, 182, 28, 2, '2016-07-05'),
(489, 250, 30, 1, '2017-10-26'),
(490, 134, 1, NULL, '2020-05-24'),
(491, 25, 19, 4, '2020-05-03'),
(492, 220, 1, 2, '2021-12-11'),
(493, 157, 21, NULL, '2022-04-10'),
(494, 106, 4, 2, '2021-10-04'),
(495, 72, 34, 4, '2017-12-28'),
(496, 48, 34, NULL, '2018-10-07'),
(497, 73, 30, 1, '2016-11-12'),
(498, 160, 37, 1, '2020-02-20'),
(499, 107, 42, NULL, '2021-01-06'),
(500, 43, 4, 1, '2019-09-02'),
(501, 212, 26, 3, '2018-08-25'),
(502, 170, 23, NULL, '2023-10-09'),
(503, 52, 14, 3, '2018-12-22'),
(504, 229, 16, 2, '2018-11-07'),
(505, 130, 46, NULL, '2017-02-08'),
(506, 48, 7, 1, '2016-08-07'),
(507, 218, 47, 4, '2017-03-05'),
(508, 225, 16, NULL, '2018-06-03'),
(509, 128, 9, 4, '2021-04-03'),
(510, 173, 28, 1, '2023-09-16'),
(511, 47, 8, NULL, '2019-05-12'),
(512, 85, 27, 3, '2020-08-27'),
(513, 68, 5, 3, '2021-08-13'),
(514, 225, 34, NULL, '2021-01-06'),
(515, 130, 10, 4, '2017-08-22'),
(516, 71, 24, 4, '2020-08-11'),
(517, 209, 49, NULL, '2019-12-06'),
(518, 107, 17, 4, '2017-09-05'),
(519, 229, 39, 3, '2023-01-05'),
(520, 161, 34, NULL, '2019-06-09'),
(521, 222, 19, 2, '2018-11-15'),
(522, 208, 42, 1, '2022-02-07'),
(523, 171, 6, NULL, '2018-09-13'),
(524, 110, 36, 3, '2021-02-15'),
(525, 56, 25, 2, '2021-03-15'),
(526, 21, 42, NULL, '2016-02-08'),
(527, 68, 11, 4, '2016-06-21'),
(528, 112, 47, 1, '2017-04-26'),
(529, 166, 45, NULL, '2017-07-27'),
(530, 211, 21, 3, '2020-09-20'),
(531, 151, 3, 1, '2023-12-24'),
(532, 186, 47, NULL, '2022-11-24'),
(533, 174, 25, 1, '2023-01-24'),
(534, 165, 47, 1, '2023-04-04'),
(535, 27, 13, NULL, '2018-03-10'),
(536, 182, 25, 1, '2018-01-08'),
(537, 115, 27, 1, '2021-03-20'),
(538, 171, 39, NULL, '2020-08-01'),
(539, 168, 8, 4, '2017-06-06'),
(540, 180, 5, 4, '2019-08-09'),
(541, 18, 29, NULL, '2021-05-06'),
(542, 52, 31, 1, '2017-06-08'),
(543, 29, 48, 1, '2016-01-06'),
(544, 36, 44, NULL, '2017-09-07'),
(545, 118, 45, 2, '2018-12-28'),
(546, 156, 5, 4, '2017-10-01'),
(547, 145, 44, NULL, '2021-02-26'),
(548, 105, 30, 4, '2016-03-18'),
(549, 75, 3, 3, '2016-07-07'),
(550, 185, 14, NULL, '2017-03-17'),
(551, 31, 36, 3, '2021-02-01'),
(552, 28, 47, 4, '2016-12-07'),
(553, 236, 7, NULL, '2019-12-26'),
(554, 5, 14, 1, '2021-04-25'),
(555, 206, 36, 4, '2021-08-28'),
(556, 107, 33, NULL, '2023-12-26'),
(557, 57, 30, 4, '2020-10-15'),
(558, 231, 45, 1, '2018-11-17'),
(559, 139, 11, NULL, '2019-10-03'),
(560, 5, 16, 1, '2019-04-23'),
(561, 191, 8, 3, '2018-07-18'),
(562, 148, 49, NULL, '2019-08-02'),
(563, 33, 35, 4, '2021-06-03'),
(564, 96, 3, 1, '2019-07-22'),
(565, 237, 35, NULL, '2021-10-22'),
(566, 30, 22, 1, '2023-01-05'),
(567, 201, 30, 2, '2022-01-23'),
(568, 33, 16, NULL, '2021-10-25'),
(569, 238, 15, 1, '2023-11-14'),
(570, 239, 16, NULL, '2022-09-15'),
(571, 99, 44, 2, '2023-03-27'),
(572, 250, 1, 4, '2020-06-20'),
(573, 137, 6, NULL, '2018-06-18'),
(574, 15, 29, 1, '2017-02-12'),
(575, 223, 7, 3, '2016-04-08'),
(576, 35, 27, NULL, '2023-05-17'),
(577, 167, 27, 2, '2019-11-07'),
(578, 240, 30, 1, '2021-07-20'),
(579, 37, 32, NULL, '2022-12-06'),
(580, 79, 15, 1, '2022-06-22'),
(581, 52, 26, 3, '2016-08-07'),
(582, 61, 41, NULL, '2023-05-07'),
(583, 215, 1, 1, '2016-11-04'),
(584, 240, 43, 3, '2020-10-09'),
(585, 43, 9, NULL, '2018-04-17'),
(586, 33, 45, 1, '2020-01-28'),
(587, 86, 21, 4, '2019-09-10'),
(588, 87, 7, NULL, '2020-02-15'),
(589, 69, 11, 1, '2018-03-04'),
(590, 104, 30, 4, '2018-05-02'),
(591, 56, 8, NULL, '2023-01-23'),
(592, 103, 21, 1, '2019-09-07'),
(593, 128, 31, 3, '2016-11-23'),
(594, 25, 4, NULL, '2023-10-24'),
(595, 24, 46, 2, '2017-09-04'),
(596, 106, 8, 1, '2019-12-03');


--сделано
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (1, 'Hélène', 'Angèle', '2022-12-27', NULL, 9);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (2, 'Agnès', 'Mégane', '2020-03-29', 'OSHA 30-Hour', 19);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (3, 'Lèi', 'Eugénie', '2020-05-15', 'IAD', 19);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (4, 'Mahélie', 'Méghane', '2021-05-30', 'GDI+', 18);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (5, 'Aí', 'Sélène', '2023-07-15', NULL, 3);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (6, 'Lóng', 'Görel', '2022-11-05', 'UV coating', 10);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (7, 'Cinéma', 'Torbjörn', '2022-10-14', 'Finite Element Analysis', 3);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (8, 'Anaé', 'Cinéma', '2020-08-28', 'FPC 1', 4);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (9, 'Nélie', 'Göran', '2022-09-27', 'Control Systems Design', 17);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (10, 'Stévina', 'Sòng', '2022-08-12', 'FQL', 14);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (11, 'Agnès', 'Personnalisée', '2018-02-14', 'Creative Direction', 16);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (12, 'Zoé', 'Géraldine', '2018-09-18', 'Juvenile Justice', 16);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (13, 'Loïc', 'Intéressant', '2019-12-19', NULL, 11);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (14, 'Desirée', 'Bécassine', '2023-06-16', 'Youth Leadership', 7);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (15, 'Michèle', 'Ruì', '2017-07-16', 'Broadband', 9);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (16, 'Naëlle', 'Alizée', '2022-08-15', 'Characterization', 16);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (17, 'Anaïs', 'Agnès', '2017-12-26', NULL, 5);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (18, 'Cunégonde', 'Andrée', '2018-12-22', 'DQL', 14);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (19, 'Yè', 'Camélia', '2022-09-03', 'Brokers', 3);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (20, 'Pélagie', 'Göran', '2022-05-06', 'DSI', 19);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (21, 'Chloé', 'Marie-hélène', '2021-09-09', 'Architectural Drawings', 9);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (22, 'Léane', 'Andréa', '2021-05-18', 'Non-profit Volunteering', 13);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (23, 'Mylène', 'Léane', '2019-05-19', 'Videography', 17);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (24, 'Daphnée', 'Marlène', '2020-09-22', NULL, 1);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (25, 'Geneviève', 'Lài', '2019-10-13', 'Healthcare', 9);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (26, 'Céline', 'Maëlle', '2020-07-11', 'RLC', 6);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (27, 'Mà', 'Nélie', '2020-12-14', 'Software Engineering', 11);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (28, 'Amélie', 'Sélène', '2020-08-19', 'LSAT', 20);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (29, 'Méline', 'Tú', '2017-10-04', 'Branding', 18);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (30, 'Lorène', 'Gwenaëlle', '2023-03-21', 'SSL Certificates', 13);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (31, 'Mårten', 'Léonore', '2020-05-10', 'Cognitive Psychology', 9);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (32, 'Vérane', 'Méline', '2023-07-26', 'Nuclear', 19);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (33, 'Séréna', 'Léandre', '2022-01-06', 'PVSyst', 14);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (34, 'Thérèsa', 'Fèi', '2020-01-18', NULL, 1);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (35, 'Tú', 'Tú', '2022-05-08', 'BOSIET', 2);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (36, 'Noëlla', 'Léonie', '2020-03-02', 'Process Optimization', 12);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (37, 'Maïly', 'Zhì', '2017-01-04', 'RDFa', 3);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (38, 'Anaël', 'Dafnée', '2022-06-18', 'People Management', 4);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (39, 'Maëlys', 'Lyséa', '2018-10-12', 'Sculpture', 19);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (40, 'Danièle', 'Aí', '2022-05-28', NULL, 8);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (41, 'Maëlann', 'Hélèna', '2019-01-16', 'DFSORT', 3);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (42, 'Françoise', 'Méng', '2020-02-25', 'PL/SQL', 3);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (43, 'Garçon', 'Märta', '2019-05-06', 'CME', 9);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (44, 'Mélissandre', 'Maëlann', '2020-04-05', 'FTC', 5);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (45, 'Valérie', 'Léonore', '2019-06-28', 'GMRA', 20);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (46, 'Félicie', 'Cécile', '2021-08-26', NULL, 5);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (47, 'Adèle', 'Lyséa', '2020-10-31', 'NPDES', 11);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (48, 'Noémie', 'Pò', '2022-12-13', 'Laboratory', 3);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (49, 'Annotés', 'André', '2019-12-15', 'Science', 14);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (50, 'Félicie', 'Rachèle', '2018-08-13', 'RMADS', 5);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (51, 'Séréna', 'Maëly', '2018-05-27', NULL, 3);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (52, 'Audréanne', 'Táng', '2020-06-05', 'UF/DF', 13);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (53, 'Mårten', 'Loïca', '2022-08-05', 'Amazon RDS', 20);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (54, 'Annotés', 'Cloé', '2023-01-22', 'CSCP', 4);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (55, 'Hélène', 'Stéphanie', '2020-03-07', 'Test Driven Development', 1);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (56, 'Mén', 'Bérengère', '2018-04-22', 'GTK+', 3);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (57, 'Kù', 'Bérénice', '2021-05-04', NULL, 18);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (58, 'Björn', 'Salomé', '2018-09-03', 'VLSI CAD', 11);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (59, 'Léandre', 'Mélodie', '2019-01-20', 'Keyword Research', 8);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (60, 'Marie-ève', 'Torbjörn', '2017-09-30', 'DHTML', 11);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (61, 'Görel', 'Léonore', '2023-02-24', 'SSI', 17);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (62, 'Daphnée', 'Björn', '2018-11-21', 'Microsoft Dynamics ERP', 16);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (63, 'Athéna', 'Dorothée', '2017-03-16', NULL, 9);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (64, 'Médiamass', 'Björn', '2017-12-10', 'DLPAR', 5);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (65, 'Léone', 'Zhì', '2018-05-16', 'Healthcare', 15);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (66, 'Åke', 'Cloé', '2021-09-13', 'Yahoo Search', 13);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (67, 'Pénélope', 'Clémence', '2023-04-11', 'DLPAR', 7);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (68, 'Ruò', 'Aurélie', '2018-10-08', NULL, 20);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (69, 'Simplifiés', 'Noémie', '2023-07-01', 'Board Certified', 13);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (70, 'Örjan', 'Erwéi', '2022-04-03', 'OSHA 30-Hour', 18);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (71, 'Mårten', 'Cécilia', '2020-04-08', 'Published Author', 13);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (72, 'Personnalisée', 'Vérane', '2017-03-22', 'USDA', 19);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (73, 'Véronique', 'Lucrèce', '2020-02-14', 'Kinetics', 14);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (74, 'Lèi', 'Méng', '2023-08-28', 'DFSORT', 18);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (75, 'Ráo', 'Cléopatre', '2023-06-30', 'RBAC', 14);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (76, 'Tán', 'Intéressant', '2023-08-15', 'Governmental Affairs', 10);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (77, 'Séréna', 'Estée', '2021-10-19', 'Quality System', 12);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (78, 'Maïté', 'Garçon', '2023-06-16', 'YSlow', 6);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (79, 'Naëlle', 'Agnès', '2022-01-28', NULL, 8);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (80, 'Crééz', 'Mélinda', '2016-12-01', 'TCR', 17);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (81, 'Kallisté', 'Néhémie', '2022-04-26', 'Trading', 4);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (82, 'Annotés', 'Måns', '2019-12-26', 'Hoshin Kanri', 7);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (83, 'Andréanne', 'Märta', '2019-10-17', 'FHA', 19);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (84, 'Anaëlle', 'Estève', '2019-06-04', 'Vi', 12);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (85, 'Maïlys', 'Styrbjörn', '2021-08-02', 'Cross-functional Coordination', 18);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (86, 'Håkan', 'Renée', '2018-12-29', 'FPGA prototyping', 16);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (87, 'Loïs', 'Judicaël', '2021-10-17', NULL, 19);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (88, 'Méthode', 'Mélia', '2023-01-11', 'Alarm Systems', 6);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (89, 'Görel', 'Josée', '2019-05-04', 'WWAN', 13);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (90, 'Léonore', 'Görel', '2017-05-15', 'LWD', 17);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (91, 'Yénora', 'Bérengère', '2018-08-06', 'Hadoop', 7);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (92, 'Cunégonde', 'Laurène', '2021-12-19', NULL, 4);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (93, 'Thérèsa', 'Kallisté', '2019-09-25', 'Gas Turbines', 18);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (94, 'Méline', 'Åke', '2019-08-09', 'AODA', 18);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (95, 'Kuí', 'Solène', '2018-03-14', 'HTML Scripting', 18);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (96, 'Athéna', 'Eliès', '2017-07-13', 'RPC', 15);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (97, 'Léonore', 'Zhì', '2021-02-18', 'Juvenile Justice', 6);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (98, 'Maëlyss', 'Maëlyss', '2022-02-18', 'Ultrasonics', 16);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (99, 'Cécilia', 'Maëlys', '2019-03-18',NULL, 7);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (100, 'Dù', 'Marie-hélène', '2020-10-21', 'Core Banking', 4);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (101, 'Rébecca', 'Rachèle', '2023-06-17', 'Jet Engines', 17);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (102, 'Maëlann', 'Cunégonde', '2021-04-01', 'DG Sets', 15);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (103, 'Magdalène', 'Illustrée', '2022-10-25', 'Rail', 1);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (104, 'Maéna', 'Nadège', '2021-02-11', 'XRY', 1);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (105, 'Angélique', 'Josée', '2021-06-18', NULL, 1);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (106, 'Ophélie', 'Solène', '2021-03-12', 'HBase', 1);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (107, 'Réservés', 'Nélie', '2018-10-10', 'Yardi Enterprise', 17);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (108, 'Publicité', 'Gwenaëlle', '2017-02-01', 'Rock Music', 15);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (109, 'Dafnée', 'Ráo', '2020-12-05', 'BPCS', 11);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (110, 'Östen', 'Håkan', '2017-12-28', 'Graphic Design', 14);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (111, 'Clémentine', 'Edmée', '2021-02-28', 'Intercultural Awareness', 12);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (112, 'Tú', 'Maëlys', '2018-02-03', 'Translation', 20);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (113, 'Kévina', 'Maïté', '2016-12-15', NULL, 17);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (114, 'Dorothée', 'Inès', '2018-07-30', 'Mobile Marketing', 2);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (115, 'Gwenaëlle', 'Renée', '2021-10-09', 'Overall Wellness', 4);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (116, 'Clélia', 'Simplifiés', '2018-08-26', 'NC-Verilog', 4);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (117, 'Gösta', 'Estève', '2020-01-08', NULL, 7);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (118, 'Mårten', 'Maïly', '2019-02-03', 'Billing Systems', 6);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (119, 'Clémentine', 'Liè', '2021-07-15', 'Buyer Representation', 3);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (120, 'Gaïa', 'Göran', '2018-08-27', 'UPS Systems', 17);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (121, 'Maëlys', 'Örjan', '2022-06-27', 'Force Protection', 1);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (122, 'Judicaël', 'Maëlle', '2018-03-31', 'QS1', 17);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (123, 'Andréanne', 'Annotée', '2020-05-24', 'CWA', 14);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (124, 'Dafnée', 'Aimée', '2022-12-21', 'DG Sets', 18);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (125, 'Gisèle', 'Sòng', '2017-03-23', 'JRockit', 4);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (126, 'Publicité', 'Naéva', '2019-03-16', NULL, 15);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (127, 'Dafnée', 'Cloé', '2020-11-13', 'Obstructive Sleep Apnea', 18);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (128, 'Åke', 'Gisèle', '2018-12-16', 'KPI Dashboards', 12);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (129, 'Torbjörn', 'Léandre', '2023-05-25', 'TTCN-3', 6);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (130, 'Adélie', 'Chloé', '2022-02-24', NULL, 3);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (131, 'Lucrèce', 'Pål', '2020-06-28', 'Order Picking', 5);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (132, 'Táng', 'Mylène', '2021-01-03', 'OTM', 3);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (133, 'Gérald', 'Pénélope', '2023-08-04', 'Lines Of Credit', 4);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (134, 'Håkan', 'Loïc', '2018-05-06', 'OTL', 17);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (135, 'Véronique', 'Örjan', '2022-05-19', 'Irrigation', 14);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (136, 'Gaïa', 'Séverine', '2018-12-06', 'Niche Marketing', 1);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (137, 'Åke', 'Annotés', '2023-06-28', 'CADS RC', 11);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (138, 'Gaëlle', 'Börje', '2017-06-18', NULL, 19);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (139, 'Dafnée', 'Laïla', '2017-11-18', 'Account Reconciliation', 10);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (140, 'Gwenaëlle', 'Gaétane', '2020-04-28', 'Economic Modeling', 14);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (141, 'Mårten', 'Pélagie', '2021-06-06', 'PGW', 4);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (142, 'Léa', 'Anaëlle', '2019-03-11', 'OTA', 12);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (143, 'Bénédicte', 'Inès', '2020-03-08', 'Combined Cycle', 17);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (144, 'Åsa', 'Clélia', '2022-07-07', 'Investments', 10);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (145, 'Lén', 'Styrbjörn', '2020-05-17', 'UG', 16);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (146, 'Mégane', 'Maïlys', '2022-05-29', NULL, 3);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (147, 'Inès', 'Angèle', '2020-06-11', NULL, 8);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (148, 'Märta', 'Léane', '2022-09-24', NULL, 10);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (149, 'Mén', 'Ruì', '2022-01-31', NULL, 10);
insert into alumni (alumni_id, first_name, last_name, graduation_year, current_position, department_id) values (150, 'Médiamass', 'Dafnée', '2021-05-17',NULL, 5);

--done
-- 1 task List of Students and Their Enrollments:
select s.first_name, s.last_name, c.course_name
from students s join enrollments e using(student_id)
join instructors i using(instructor_id)
join courses c using(course_id);

--done
-- 2 task Retrieve a list of all students and the courses they are currently enrolled in, including course details.
select s.first_name, s.last_name, c.course_name, c.department_id, c.credits
from students s join enrollments e using(student_id)
join instructors i using(instructor_id)
join courses c using(course_id);

--done
-- 3 task Find the students who do not have assigned advisors.
select s.first_name, s.last_name, s.student_id, st.first_name as advisor_name
from students s
left join admissions adm using(student_id)
left join advisors adv using(advisor_id)
left join staff st using(staff_id)
where adv.advisor_id is null
order by s.student_id;

--done
-- 4 task Identify the student(s) with the highest GPA and their academic records
select s.first_name, s.last_name, round(sum(t.grade*c.credits)/sum(c.credits) ,2) as total
from students s join transcripts t using(student_id)
join courses c using(course_id)
group by s.first_name, s.last_name
having round(sum(t.grade*c.credits)/sum(c.credits) ,2) = (
	select round(sum(t.grade*c.credits)/sum(c.credits) ,2) as sum1
	from transcripts t join courses c using(course_id)
	join students s1 using(student_id)
	group by s1.first_name
	order by sum1 desc limit 1
);

--done
-- 5 task Calculate the average GPA for students in each major.
select d.department_name, round(avg(gpa),2) as average, count(stu_id)
from (
	select s.student_id as stu_id,s.first_name, s.last_name, sum(t.grade*c.credits)/sum(c.credits) as gpa
	from students s join transcripts t using(student_id)
	join courses c using(course_id)
	group by s.first_name, s.last_name,s.student_id ) as subquery
right join admissions adm on stu_id = adm.student_id
right join advisors using(advisor_id)
right join departments d using(department_id)
group by d.department_name;


--done
-- 6 task Determine which departments offer the most 
-- courses by counting the number of courses offered in each department.
select d.department_name, count(c.department_id)
from departments d join courses c using(department_id)
group by d.department_name;

--done
-- 7 task List faculty advisors along with the students they advise.
select st.first_name, st.last_name,
string_agg(concat(s.first_name,'-', s.last_name), ', ') as students
from staff st
join advisors adv using (staff_id)
join admissions adm using (advisor_id)
join students s using (student_id)
group by st.first_name, st.last_name
order by st.first_name;

--done
-- 8 task Find the student groups with the most members and
-- list the group names and member counts.
select group_name, group_id, count(e.group_id) as member_count
from student_groups
join enrollments e using(group_id)
group by group_name, group_id
order by group_name;

--done
-- 9 task Calculate the occupancy rate of the university's student housing facilities.
select h.housing_id,h.housing_name, h.capacity-count(stu.housing_id) as available
from housing h join student_contacts stu using(housing_id)
group by h.housing_id,h.housing_name;

--done
-- 10 task Compute the average cost of meal plans for
-- different student groups (e.g., freshmen, sophomores, etc.).
select sg.group_name, round(avg(amg.cost),2) as average
from student_groups sg join enrollments e using(group_id)
join students s using(student_id)
join meal_plans amg using(student_id)
group by sg.group_name;

--done
-- 11 task Calculate the total tuition
-- revenue generated by each academic department.
select d.department_name, sum(sf.amount)
from departments d 
join courses c using(department_id)
join instructors i using(course_id)
join enrollments e using(instructor_id)
join students s using(student_id)
join student_fees sf using(student_id)
where sf.status = true
group by d.department_name;



--done
-- 12 task Find the number of available library resources and the number checked out by students. 
select (select count(*) from library) as total, sum(
  case when library.checkout_date isnull and library.due_date isnull then 1
  when library.checkout_date <= current_date and library.due_date isnull then 0
  when library.checkout_date <= current_date and library.due_date <= current_date then 1
  else 0 end
) as books_available
from library;

--done
-- 13 task Calculate the number of student
-- visits to health services and their average visit duration
select count(*) as total_visits,
round(avg(duration),2) as average_duration
from health_services;

--done
-- 14 task List student achievements (awards, honors)
-- and group them by the student's department.
select d.department_name, s.first_name, s.last_name,
s.student_id, st_ach.achievements from departments d
join faculty f using(faculty_id)
join staff stf using(faculty_id)
join advisors adv using(staff_id)
join admissions adm using(advisor_id)
join students s using(student_id)
join student_achievements st_ach using(student_id)
order by d.department_id;

--done
-- 15 task Determine the percentage of students
-- who have participated in internships.
select concat(((select count(*) from internships) * 100)
			  /count(*),'%') as internshipka_bargandar
from students;

--done
-- 16 task Find the countries where students have studied
-- abroad and the number of students in each country.
select county, count(student_id) as bargandar_sany
from study_abroad
group by county
order by bargandar_sany desc;

--done
-- 17 task List the upcoming campus events andtheir details, sorted by date.
select event_id, event_name, event_date, location
from student_events
where event_date>=current_date
order by event_date;

--done
-- 18 task Determine which departments produce the most employed alumni.
select d.department_name,d.department_id,
CONCAT((SUM(CASE WHEN al.current_position IS not NULL THEN 1 ELSE 0 END) * 100)
	   /(select count(*) from alumni),'%') as total
from departments d join alumni al using(department_id)
group by d.department_name,d.department_id
order by total desc;

--done
-- 19 task Identify faculty members who have
-- expertise in specific research areas, based on their academic records.
select first_name, last_name, research
from staff
where research is not null;

--done
-- 20 task Analyze the historical enrollment data
-- to identify trends in student enrollment over the past few years.
select extract(year from(admission_date)) as year,
concat((count(student_id) * 100)/
	   (select count(*) from admissions),'%') as precent
from admissions
group by year
order by year desc;


--done
-- 21 task Verify if students enrolling in
-- advanced courses meet the prerequisites by checking their transcript records.
select s.first_name,s.last_name, c.pre_course,
(select round(sum(t1.grade*c1.credits)/sum(c1.credits),2)
	from students s1 join transcripts t1 using(student_id)
	join courses c1 using(course_id)
	where c1.course_id = c.pre_course) as pre_gpa
, c.course_name,round(sum(t.grade*c.credits)/sum(c.credits),2) as gpa
from students s join transcripts t using(student_id)
join courses c using(course_id)
where c.pre_course is not null
group by s.first_name,s.last_name, c.pre_course, c.course_name
having 3.00<= (
	select round(sum(t1.grade*c1.credits)/sum(c1.credits),2)
	from students s1 join transcripts t1 using(student_id)
	join courses c1 using(course_id)
	where c1.course_id = c.pre_course
);

--done
-- 22 task List students with outstanding fees, including the total amount owed.
select stfe.student_id, s.first_name, s.last_name, stfe.amount
from student_fees stfe join students s using(student_id)
where stfe.status = false
order by stfe.amount desc;

--done
-- 23 task Identify instructors who are teaching
-- multiple courses in the same term and list the courses they are teaching.
select stf.first_name, stf.last_name,
extract(year from(e.enrollment_date))
as zhyl, count(e.student_id) as tirkelgen_sabaktar,
string_agg(concat(c.course_name),', ') as courses
from enrollments e join instructors i using(instructor_id)
join courses c using(course_id)
join staff stf using(staff_id)
group by stf.first_name, stf.last_name,zhyl
order by zhyl;

--done
-- 24 task Calculate statistics on student
-- diversity, such as the distribution of gender, ethnicity, or nationality.
select gender,count(gender),
concat((count(gender)*100)/
	   (select count(*) from students),'%')
from students
group by gender;


--done
-- 25 task Find the most popular combinations
-- of courses (sets of courses taken together) among students.
select string_agg(concat(c.course_name),', ')
as course_combination, count(*) as popularity
from enrollments e join instructors i using(instructor_id)
join courses c using(course_id)
group by e.student_id
having count(*) > 1
order by popularity desc;

--done
-- 26 task Compare the academic performance (GPA) of students based on their faculty advisors.
select adv_name, last_name, round(avg(gpa),2) as average
from (
	select stf.first_name as adv_name, stf.last_name
	as last_name, round(sum(t.grade*c.credits)/
						sum(c.credits),2) as gpa , adv.advisor_id, s.first_name as s_name
	from students s join transcripts t using(student_id)
	join courses c using(course_id)
	join admissions adm using(student_id)
	join advisors adv using(advisor_id)
	join staff stf using(staff_id)
	group by stf.first_name, stf.last_name,c.course_id, adv.advisor_id,s.first_name
	order by adv.advisor_id, gpa) as subquary
group by adv_name, last_name
order by average;


--done
-- 27 task Identify student groups that have
-- members from a wide range of majors, promoting interdisciplinary collaboration.
select sg.group_name, count(distinct d.department_name),
string_agg(distinct concat(d.department_name), ', ')
from student_groups sg join enrollments e using(group_id)
join students s using(student_id)
join admissions adm using(student_id)
join advisors adv using(advisor_id)
join departments d using(department_id)
group by sg.group_name;

--done
-- 28 task List courses with consistently high
-- enrollment, helping with scheduling and resource allocation.
select c.course_name, count(e.instructor_id) as count
from courses c join instructors i using(course_id)
join enrollments e using(instructor_id)
group by c.course_name
order by count desc;

--done
-- 29 task Calculate the average time it takes
-- students to graduate, considering their major and any changes in degree programs.
select d.department_name,
round((select sum(case
	when extract(year from(current_date))-extract(year from(adm1.admission_date)) = 0 then 1
	when extract(year from(current_date))-extract(year from(adm1.admission_date)) = 1 then 1
	when extract(year from(current_date))-extract(year from(adm1.admission_date)) = 2 then 2
	when extract(year from(current_date))-extract(year from(adm1.admission_date)) = 3 then 3
	when extract(year from(current_date))-extract(year from(adm1.admission_date)) = 4 then 4
	else 0 end)
	  from admissions adm1
	  join advisors adv1 using(advisor_id)
	  join departments d1 using(department_id)
	  where d1.department_name = d.department_name)
	   /(select cast(count(adm1.admission_date)as NUMERIC )
		from admissions adm1 join advisors adv using(advisor_id)
		join departments d1 using(department_id)
		where extract(year from(current_date))-extract(year from(adm1.admission_date))<= 4
		and d1.department_name = d.department_name ),2),
count(adm.student_id)
from departments d join advisors adv using(department_id)
join admissions adm using(advisor_id)
group by d.department_name;

--done
-- 30 task Determine if students who complete
-- internships have a higher graduation rate
-- compared to those who do not.
select concat(count(i.student_id)*100/
			  (select count(*)from graduations),'%') as internship_otkender, 
concat(100-(count(i.student_id)*100/
			(select count(*)from graduations)),'%') as internship_otpegender 
from graduations g join students s using(student_id)
join internships i using(student_id);